{
    "pixel 9 pro xl": [
        {
            "user": "ElastepStep",
            "id": "1etv3qv",
            "title": "Pixel 9 pro xl impressions after trying it in BestBuy. ",
            "score": 384,
            "url": "https://www.reddit.com/gallery/1etv3qv",
            "num_comments": 405,
            "created": 1723830129.0,
            "body": "I’ve preordered P9ProXL, but decided to play with the device in Best Buy first. What can I say… It’s very similar to iPhone 15pm, screen is really really bright, I can’t say the colors are amazing though. Somehow I like the colors on S24u better. I was shocked that camera takes so much time to take a shot. It’s like you press a shutter button and it spins for like 500ms. It’s much better on both iPhone and Smasnug! Photos are good as far as I could tell, but need to wait for full reviews to come out. Snappiness is… Not good. Sorry. S24u is miles ahead. Somehow it got stuttered in random places while scrolling. Screenshots app did not work - it kept saying nothing found. Studio app - Not sure what’s the point of Gemini app just generates the same pictures? It also said that it could not generate people. Recorder app - I could not find how to generate a summary of conversation recorded. In photos app there was no option to try that generation feature with prompt. Weather app is a joke. As an AI summary it said - “it will get colder in the next 4 days”… Emm, I sorta can see it? Absolutely useless… Gemini Live (chat) was also not available on the demo unit..\n\nI’ve canceled my preorder as I was really disappointed. They sounded like it’s a premium phone that can compete with flagships during the presentation . In reality.. IDK.. I highly HIGHLY! recommend going to the nearest Best Buy and give it a good try. For me the phone felt like a ~$700 phone at max. $1199 is not its price. \n\nJust to make it clear I was comparing it with s24u and iPhone 15pm that I currently own. Was thinking to trade in s24u as the camera is trash in low light. But s24u is much much snappier… Will see what ai features will make it way to other devices :) But I have a suspicion that if you pay for Gemini you’ll get a lot of them. ",
            "comments": [
                {
                    "author": "Atosl",
                    "id": "lig89kt",
                    "body": "I never had a phone run fluidly in a store. Not even the S23 I bought last year.",
                    "score": 273,
                    "created": 1723834672.0,
                    "replies": [
                        {
                            "author": "hooyahat",
                            "id": "ligfxnl",
                            "body": "It most likely isn't using mobile data, but connected to their slow ass store wifi.",
                            "score": 57,
                            "created": 1723837179.0,
                            "replies": [
                                {
                                    "author": "Atosl",
                                    "id": "lighl5l",
                                    "body": "yeah but also animations are janky with that demo running",
                                    "score": 31,
                                    "created": 1723837715.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MissingThePixel",
                            "id": "lij2vrs",
                            "body": "Pixels demo mode is ass. The phone runs slow, the refresh rate is limited, the system is extremely locked down. Other phones tend to let you do whatever you want, and instead they just reset when the screen is off",
                            "score": 11,
                            "created": 1723876778.0,
                            "replies": []
                        },
                        {
                            "author": "DearHearing4705",
                            "id": "ligitg1",
                            "body": "Yeah I've definitely never test driven a phone in order to buy hahaha.",
                            "score": 10,
                            "created": 1723838109.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jesterc0re",
                    "id": "ligac3a",
                    "body": "Demo unit means - it stays with the screen at full brightness all the day and has old software on it? All the issues you described are probably software and heat related. Phone is probably hot AF and thus can be slower.",
                    "score": 114,
                    "created": 1723835344.0,
                    "replies": []
                },
                {
                    "author": "chin_rick1982",
                    "id": "lig7vy9",
                    "body": "I'm not buying it. My 8 Pro was ahead of the S24 Ultra when I played with it before buying the 8 Pro imo. Everything about the 8 Pro is snappy and vibrant and I highly doubt the 9 Pro XL will be worse.",
                    "score": 84,
                    "created": 1723834549.0,
                    "replies": [
                        {
                            "author": "Accurate-Currency181",
                            "id": "lih0wim",
                            "body": "I have the 8 pro and my wife couldn't wrap her head around a Pixel so she got the S24 Ultra. Long story short, we both agree the Pixel takes better pictures and that surprisingly the Pixel is faster as well. I know that doesn't make sense according to specs but loading apps and web surfing has the Pixel slightly ahead. With that said, she wants the Pixel 9 Pro now.",
                            "score": 26,
                            "created": 1723844062.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "y_am_i_hear",
                    "id": "lifysqf",
                    "body": "You do realize you were handling a display unit in demo mode, right? 🙄",
                    "score": 82,
                    "created": 1723831649.0,
                    "replies": []
                },
                {
                    "author": "MilfAndCereal",
                    "id": "lig100r",
                    "body": "My dilemma is that my S23U has a shattered front screen. I love this phone, but they want $350 to fix it. Best buy will give me $863 or something like that, making the Pixel 9 Pro XL cost me about $200 net considering the $200 gift card they also give you.",
                    "score": 78,
                    "created": 1723832357.0,
                    "replies": [
                        {
                            "author": "rscottzman",
                            "id": "ligv5fp",
                            "body": "Crazy how much you Americans get via tradeins. I was checking in the Google store and I'd only get around £330 for my perfect condition S23U",
                            "score": 65,
                            "created": 1723842101.0,
                            "replies": [
                                {
                                    "author": "__globalcitizen__",
                                    "id": "lih95xa",
                                    "body": "They are trying to take a bite out of the Apple market share so we in the UK and Europe get the crappy deals...",
                                    "score": 16,
                                    "created": 1723847019.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "waytoojaded",
                            "id": "lign7vs",
                            "body": "I don't think it's much of a dilemma, it'd be a no brainer for me. S23 has 3.5 years left of support, 1.5 years old by now too. You spend $150 less of of pocket and also net a $200 gift card and get a brand new P9P XL.",
                            "score": 22,
                            "created": 1723839549.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FJKiller",
                    "id": "ligs2xj",
                    "body": "Demo mode is ass on all phones. Also, not sure if it's the safety device on there throwing you off but the quality is on par with S24U and iPhone 15 Pro. Wasn't expected but it's the biggest advancement I've seen on a Pixel so far in terms of how quality it feels.",
                    "score": 50,
                    "created": 1723841119.0,
                    "replies": []
                },
                {
                    "author": "Reddit-Surfing",
                    "id": "liglj90",
                    "body": "I work at a mobile store and the demo software isn't optimized. It causes the phone to lag badly. \nProbably also isn't final software.",
                    "score": 48,
                    "created": 1723838999.0,
                    "replies": [
                        {
                            "author": "y_am_i_hear",
                            "id": "ligs4yw",
                            "body": "Thank you. Not sure how people don't understand this.",
                            "score": 23,
                            "created": 1723841136.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HStark_666",
                    "id": "lig6bqu",
                    "body": "I think the retail units will perform better. I agree that Google's live-demo units are horrible and they should really re-think how to optimize their live demos. Last year I was getting my Pixel 7 Pro repaired and played around with the Pixel 8 Pro and Pixel Watch 2 demo units in store, and they are slow af. The pixel watch had a massive amount of burn-in as well. My Pixel 7 Pro is still super smooth. I have since purchased a Pixel Watch 2 and my unit have been super smooth. \n\n  \nIn addition, I find Samsung's software to not stand the test of time either. I've seen several buggy and slow live-demo Samsung phones as well, and my Fold 4 consistently have more lag than my Pixel 7 Pro, despite having a better chipset.",
                    "score": 24,
                    "created": 1723834046.0,
                    "replies": []
                },
                {
                    "author": "one80oneday",
                    "id": "lighqwt",
                    "body": "Please cancel your orders so I can get mine faster! I'm supposed to be out of town next weekend 😳",
                    "score": 18,
                    "created": 1723837766.0,
                    "replies": []
                },
                {
                    "author": "Impossible-Use6521",
                    "id": "lig163b",
                    "body": "But it's a smokin phone no doubt for 300 bucks, which is essentially what a lot of people are doing here in the US at Best Buy.",
                    "score": 18,
                    "created": 1723832410.0,
                    "replies": []
                },
                {
                    "author": "malgenone",
                    "id": "lifxefg",
                    "body": "When talking about the fluidity and maybe the apps and ai not working properly, Could we say that some of that is because it is a display unit? Probably not updated with the most current software..was it connected to Internet. I also have xl on preorder but I want to give it high hopes.",
                    "score": 18,
                    "created": 1723831205.0,
                    "replies": []
                },
                {
                    "author": "bradyaaron667",
                    "id": "ligkc9y",
                    "body": "This phone is running a demo, of course it's not going to be \"fluid\".",
                    "score": 17,
                    "created": 1723838605.0,
                    "replies": []
                }
            ],
            "search_query": "pixel 9 pro xl"
        },
        {
            "user": "jaleelhamid",
            "id": "1ev0ofv",
            "title": "Ordered my first pixel 9 pro XL",
            "score": 159,
            "url": "https://www.reddit.com/r/GooglePixel/comments/1ev0ofv/ordered_my_first_pixel_9_pro_xl/",
            "num_comments": 183,
            "created": 1723954934.0,
            "body": "After 17 years of being an iPhone loyalist, I’m finally taking the plunge and switching to Pixel! I’ve always been a big Apple fan because of how seamlessly their hardware and software work together. I’ve been eyeing the Pixel for a while, but none of them really made me want to leave like the Pixel 9 Pro. I’m also planning to get the Pixel Watch 3 and Pixel Earbuds Pro 2.\n\nI’m both excited and nervous about this switch. I have no idea what to expect, but I can’t wait to try it out.\n\nHas anyone else made the switch from iPhone to Pixel? What was your experience like?\n\nAny advice from current Pixel users? ",
            "comments": [
                {
                    "author": "NowLoadingReply",
                    "id": "liogest",
                    "body": "I made the switch from iPhone to Pixel years ago and I never looked back.\n\nYou're going to need time to adjust, but look online for solutions/ask questions on Reddit, and you'll be fine.\n\n  \nEnjoy.",
                    "score": 71,
                    "created": 1723961274.0,
                    "replies": []
                },
                {
                    "author": "SnooChipmunks1820",
                    "id": "liomgog",
                    "body": "Made the switch and am a loyal Pixel Customer ever since! Yeah the devices may lack raw power in comparison to Apple, but the OS, the UI, the Animations everything is so much more satisfying to use. And the cool AI Features are just the cherry on the top, its the overall usability and look and feel of the OS which does the magic for me",
                    "score": 18,
                    "created": 1723965075.0,
                    "replies": [
                        {
                            "author": "jaleelhamid",
                            "id": "lios749",
                            "body": "Everyone talks about the raw power but let’s be real. Does a smart phone need that much power??",
                            "score": 34,
                            "created": 1723968889.0,
                            "replies": [
                                {
                                    "author": "SnooChipmunks1820",
                                    "id": "liow25t",
                                    "body": "No, unless you want to play AAA Games, thats exactly the point why I dont get this awful hate about the raw power of the phones :D",
                                    "score": 18,
                                    "created": 1723971526.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "lazyluchador",
                    "id": "liocwvi",
                    "body": "What made you want to switch to Android and what about the Pixel 9 Pro XL specifically appealed to you?",
                    "score": 12,
                    "created": 1723959182.0,
                    "replies": [
                        {
                            "author": "jaleelhamid",
                            "id": "liodc3o",
                            "body": "Day to day features that are available for users. I feel like I wasted so much time on a iPhone that only handled basic tasks like calls, browsing and texting.\n\nGoogle pixel on the other hand does a lot of little things convenient things and the assistant and Gemini were the biggest selling features for me. I love the phone features like the hold feature, tell the caller using the Assistant to hold 1 minute before you can pick up the call.",
                            "score": 17,
                            "created": 1723959427.0,
                            "replies": [
                                {
                                    "author": "mdiz1",
                                    "id": "liopi5h",
                                    "body": "I hope you are US based, quite a few of these features aren't available elsewhere",
                                    "score": 10,
                                    "created": 1723967073.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "krishpotluri",
                    "id": "liprib3",
                    "body": "If you are used to all of the Apple services like Podcasts, Find My, iMessage etc., you WILL miss those apps no doubt. Especially Find My if you share locations within your family. \n\nIf you are a photographer and deal with a lot of RAW files, Pixels and Androids in general can't handle most of the formats. You would have to download additional apps and create a new workflow. Cumbersome.\n\nBut besides these two points, I'm sure you will enjoy the Pixel experience so much more. The Ui/Ux is soooo much cleaner and better, no bloat. Pixel-exclusive features are amazing, ESPECIALLY call screening or hold for me feature. And overall, Google Assistant to more questions than Siri.",
                    "score": 10,
                    "created": 1723988666.0,
                    "replies": []
                },
                {
                    "author": "WholeSad633",
                    "id": "liozdk1",
                    "body": "I’ll do exact the same, from 14 pro to pixel pro xl",
                    "score": 10,
                    "created": 1723973784.0,
                    "replies": []
                }
            ],
            "search_query": "pixel 9 pro xl"
        },
        {
            "user": "DionCura",
            "id": "1e0k2xy",
            "title": "Should I Upgrade to the Pixel 9 Pro XL or Wait Another Year?",
            "score": 137,
            "url": "https://i.redd.it/h026rqxnqubd1.jpeg",
            "num_comments": 221,
            "created": 1720687264.0,
            "body": "What do you lot reckon? \n\nYeah, I have the Pixel 8 Pro now and I'm a bit in a dilemma. Next month, the new Pixels will be announced. I have been known for buying the newest and best phones, which is why I rock a Pixel 8 Pro and an iPhone 15 Pro. But I like the new design of the 9 Pro XL. \n\nWhat do you lot reckon: switch or stay the same and wait a year?\n\nTell me in the comments.",
            "comments": [
                {
                    "author": "bodez95",
                    "id": "lcnh7k0",
                    "body": ">I have been known for buying the newest and best phones, which is why I rock a Pixel 8 Pro and an iPhone 15 Pro. But I like the new design of the 9 Pro XL.\n\nJFC this is a shitpost right?\n\n**IIT:**  \n**OP:** *\"Should I upgrade?\"*  \n**Comments:** *\"What are your needs? Is there something your current phone can't do that you need it to?\"*  \n**OP:** *\"Nothing. I just need the approval of strangers. Should I get the new phone? It looks cool.\"*\n\nIt isn't even in the hands of reviewers or consumers yet man. God damn.",
                    "score": 145,
                    "created": 1720691943.0,
                    "replies": []
                },
                {
                    "author": "mickturner96",
                    "id": "lcnbxau",
                    "body": ">I have the Pixel 8 Pro now\n\nWait another year \n\nI'm still running the Pixel 5",
                    "score": 133,
                    "created": 1720688254.0,
                    "replies": [
                        {
                            "author": "OtterTalesStudio",
                            "id": "lcnl29k",
                            "body": "I just recently changed my P5 for P8P. Only to have telecam. P5 still like new, still dope",
                            "score": 23,
                            "created": 1720694377.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lordruperteverton69",
                    "id": "lcnejmh",
                    "body": "People will tell you to wait for TSMC with the Pixel 10 but ignore the fact that it will be the first iteration. Google isn't known to get it right on the first try. The Pixel 9 will be the 4th semi custom Tensor iteration. It is possible that the 9 could be more stable than the 10. I have no way of knowing and I could definitely be wrong but looking back on what Google has shown us, I don't think it's that far off. At the end of the day, just get what you want.",
                    "score": 44,
                    "created": 1720690111.0,
                    "replies": []
                },
                {
                    "author": "ns1852s",
                    "id": "lcncqzq",
                    "body": "My theory is, wait at least I'm until the phone no longer receives security update.\n\nUpgrading every year is extremely wasteful both to your wallet and the environment. Used to upgrade every year when I had a Galaxy. Pixel 7 stopped that",
                    "score": 29,
                    "created": 1720688837.0,
                    "replies": []
                },
                {
                    "author": "NukE30",
                    "id": "lcp056p",
                    "body": "Rampant consumerism at it's finest. Considering getting a new phone after a year. What an absolute waste of money.",
                    "score": 17,
                    "created": 1720714537.0,
                    "replies": []
                },
                {
                    "author": "icepac",
                    "id": "lcnc2g6",
                    "body": "Decide when it launches. I would wait for the Pixel 10 with TSMC chip.",
                    "score": 11,
                    "created": 1720688355.0,
                    "replies": []
                },
                {
                    "author": "danielyelwop",
                    "id": "lcng988",
                    "body": "The phone doesn't even officially exist yet. Why don't we just wait until the phone is actually out in the hands of consumers/ reviewers before making judgement.",
                    "score": 10,
                    "created": 1720691309.0,
                    "replies": []
                }
            ],
            "search_query": "pixel 9 pro xl"
        },
        {
            "user": "Yazzdevoleps",
            "id": "1en6tg2",
            "title": "Google pixel 9 pro xl (1099$) review by Mashable ",
            "score": 154,
            "url": "https://www.reddit.com/gallery/1en6tg2",
            "num_comments": 92,
            "created": 1723125819.0,
            "body": "https://web.archive.org/web/20240808091300/https://mashable.com/article/pixel-9-pro-xl-vs-iphone-15-pro-max",
            "comments": [
                {
                    "author": "min_dynasty",
                    "id": "lh40vwe",
                    "body": "Damn, that's a good looking phone. Wanted to wait for the Pixel 10 to upgrade my 7 but may have to cop this!!",
                    "score": 49,
                    "created": 1723126846.0,
                    "replies": [
                        {
                            "author": "MrViZZiato",
                            "id": "lh5dv5n",
                            "body": "Don't listen to anyone. Get what you like and be happy. And if Google happens to do a good trade-in for your previous phone, then the pixel 9 Pro XL will only cost you less. Every year I upgrade to the newest pixel phone and trade in my previous. I don't do it because I have to. I do it because I enjoy it and I like having the latest and greatest. Plus I'm big into taking pictures so I like having the updated cameras.",
                            "score": 24,
                            "created": 1723141916.0,
                            "replies": []
                        },
                        {
                            "author": "Least-Local2314",
                            "id": "lh46ecq",
                            "body": "7 Pro is also a ridiculously great deal for newcomers nowadays",
                            "score": 17,
                            "created": 1723128611.0,
                            "replies": []
                        }
                    ]
                }
            ],
            "search_query": "pixel 9 pro xl"
        },
        {
            "user": "Maxwellxoxo_",
            "id": "1erl0w8",
            "title": "This is unacceptable: $1100-$1450 Pixel 9 Pro XL has just 128Gb of storage ",
            "score": 1540,
            "url": "https://m.gsmarena.com/google_pixel_9_pro_xl-ampp-13217.php",
            "num_comments": 716,
            "created": 1723588417.0,
            "body": "Keep in mind this phone costs $1100 in the US, $1300 in the EU and *$1450* in the UK.",
            "comments": [
                {
                    "author": "pudgybunnybry",
                    "id": "lhzh44t",
                    "body": "*Starts* at 128gb. It goes up to 1tb.\n\nPrice seems a little silly for 128gb, sure. Vote with your wallet.",
                    "score": 403,
                    "created": 1723589556.0,
                    "replies": [
                        {
                            "author": "DiplomatikEmunetey",
                            "id": "lhzy2wu",
                            "body": "> Vote with your wallet.\n\nI cannot stress this enough. Vote with your money. It is the only way you can make a difference. Companies understand only one language: Money! \n\nVoting with your time (attention) and money are the only two real votes you have in this world that can make a difference.",
                            "score": 107,
                            "created": 1723595859.0,
                            "replies": [
                                {
                                    "author": "Vintodrimmer",
                                    "id": "li173fg",
                                    "body": "Voting with your wallet may work if the company is specialized in a particular good and it may result in them going under.\n\nThis won’t work with Google, since they are not going under even if 0 units are sold and they clearly treat their mobile division as an AI and Google One promotion platform and not as an important part of their business.\n\nRemember that they sell in very few countries to start with and don’t seem to care about profits from phones.",
                                    "score": 13,
                                    "created": 1723615703.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Maxwellxoxo_",
                            "id": "lhzh80t",
                            "body": "The 128GB model is what the prices I’m using are for",
                            "score": 30,
                            "created": 1723589595.0,
                            "replies": [
                                {
                                    "author": "pudgybunnybry",
                                    "id": "lhzi1v3",
                                    "body": "Got it. yeah, seems pretty silly.\n\nI'm thinking about trading in my 8P for just the 9, 128gb. Turns out I don't use telephoto enough and don't need a bigger size. Oddly, the thermometer is the only thing I'd actually miss having. It's essentially just about $75 (trade in + $100 BB card).\n\nSmaller size and ultrasonic is enough to justify that price, imo.",
                                    "score": 17,
                                    "created": 1723589900.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kleinsumo",
                    "id": "li0abcd",
                    "body": "just dont buy it, that's what i do when i find something is unacceptable.",
                    "score": 171,
                    "created": 1723600460.0,
                    "replies": []
                },
                {
                    "author": "dentendre",
                    "id": "lhzv3q4",
                    "body": "I mean no one is forcing us to buy. Just buy any other phone that fits the budget. I understand you're trying to highlight the outrageous price for 128Gb. The phone looks to be average to me. Vote with your wallet.",
                    "score": 78,
                    "created": 1723594748.0,
                    "replies": []
                },
                {
                    "author": "Ikeelu",
                    "id": "lhzoe50",
                    "body": "I agree, but also, you have to consider the majority that use more than 128 is probably 5% or less. I'm the type of person who upgrades just about yearly, loves tech, and has 54gb free on my 128 Pixel 8 Pro. If someone like me has that much free space, I'd imagine that the average user most likely used far less. You have to remember the sub is the minority, they just speak the loudest. Like I said.. I agree it should be higher as the base for the price, but it only pleases a small percentage of buyers.",
                    "score": 73,
                    "created": 1723592276.0,
                    "replies": [
                        {
                            "author": "CharlestonChewbacca",
                            "id": "lhzsugn",
                            "body": "Agreed. I'd consider myself a \"power user\" and I'm sitting at 100/128GB on my Pixel 7 Pro. \n\nI have thought about going with more storage, but I've never needed to be concerned with storage space, so that would just feel like a waste of money I think.",
                            "score": 39,
                            "created": 1723593906.0,
                            "replies": []
                        },
                        {
                            "author": "RazzmatazzWeak2664",
                            "id": "lhzz1mm",
                            "body": "Unless you offload all your media quickly, 4K video eats up space pretty quickly. A minute of video is like 2GB easily.",
                            "score": 15,
                            "created": 1723596221.0,
                            "replies": []
                        },
                        {
                            "author": "illuminated0ne",
                            "id": "lhzphbq",
                            "body": "Yeah exactly, Google knows exactly how many people need more than 128 GB. Tech reviewers won't be happy but the average user is fine.",
                            "score": 11,
                            "created": 1723592672.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wingdom",
                    "id": "li010lr",
                    "body": "Best Buy is offering $1099 for my S23 Ultra trade in. So it would be free, but they would put a $1099 hold on my credit card, and only refund it after they ship me the Pixel, then I ship them my phone, and they inspect it. Thats like 3 weeks where they're holding my money... not sure if I'll do it or not.",
                    "score": 66,
                    "created": 1723596956.0,
                    "replies": [
                        {
                            "author": "some_person_guy",
                            "id": "li0dlpp",
                            "body": "Would you be screwed if they determined that the condition does not meet the criteria for the discount and lessoned the refund?",
                            "score": 17,
                            "created": 1723601711.0,
                            "replies": [
                                {
                                    "author": "SonuOfBostonia",
                                    "id": "li0m3vs",
                                    "body": "Traded in my pixel 7 pro into Google, they said the condition didn't meet their criteria, so I asked for it back. All these years later, I have yet to receive it.",
                                    "score": 39,
                                    "created": 1723605122.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "VegetableHeavy3944",
                            "id": "li0zedm",
                            "body": "That's arguably a downgrade lol, pixel phones are nice don't get me wrong. The Samsung phones are just built better and have better chips",
                            "score": 11,
                            "created": 1723611388.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "glasgowgeg",
                    "id": "li1toem",
                    "body": ">and $1450 in the UK\n\nNo it's not. It's £1,099 ($1,412.06) but that includes 20% VAT.\n\nThe relevant comparison to the US price would be pre-tax, so it'd be £915 ($1,175).\n\nSo whilst it's more expensive, it's not as expensive as you're making it seem.\n\nBut also, anyone pre-ordering now gets 256GB for that price, so at the moment to claim it's 128GB for that price isn't a great argument.",
                    "score": 45,
                    "created": 1723630148.0,
                    "replies": []
                },
                {
                    "author": "Gamerxx13",
                    "id": "li0g3hq",
                    "body": "It’s funny people make fun of Apple on this sub all the time. Apple might be better proposition right now",
                    "score": 39,
                    "created": 1723602679.0,
                    "replies": []
                },
                {
                    "author": "JSpangl",
                    "id": "lhzue0e",
                    "body": "Until the 28th, Google is giving an extra $200 in credit to the Google Store (on top of the 10% as a Google One member), and offering $540 for trading in my Pixel 7 Pro. \n\nThat puts the phone at a net cost of around $300 for me. I'll use the Google Store credit to turn around and upgrade my wife's Pixel 7 around Black Friday.",
                    "score": 30,
                    "created": 1723594481.0,
                    "replies": [
                        {
                            "author": "FistOfSven",
                            "id": "li13ndj",
                            "body": "In Germany they only offer 178€ (+200€ promo) for my Pixel 7 Pro 128GB",
                            "score": 15,
                            "created": 1723613710.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kbtech",
                    "id": "li09nyg",
                    "body": "Vote with your wallet and don’t buy \n\nI voted with my wallet and bought the 256 GB Pixel 9 Pro XL",
                    "score": 28,
                    "created": 1723600213.0,
                    "replies": []
                },
                {
                    "author": "ADubs62",
                    "id": "li0tdo4",
                    "body": "One thing I think is important to remember the EU/UK prices are inclusive of all taxes. The US prices are not.",
                    "score": 24,
                    "created": 1723608378.0,
                    "replies": []
                },
                {
                    "author": "shinjikun10",
                    "id": "li0a4gx",
                    "body": "This is normal for Japan, but we get full service repair, including glass for 2 years. Including water damage and all that.",
                    "score": 23,
                    "created": 1723600386.0,
                    "replies": []
                },
                {
                    "author": "Hyperion1144",
                    "id": "lhzpzj3",
                    "body": "This is just a Pixel 7 Pro with a broken little AI that doesn't work.",
                    "score": 21,
                    "created": 1723592857.0,
                    "replies": [
                        {
                            "author": "sinkingduckfloats",
                            "id": "li0rzjf",
                            "body": "It also has a better selfie camera and a ultrasonic fingerprint sensor. That does count for something in my book. ",
                            "score": 11,
                            "created": 1723607725.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "fightnight14",
                    "id": "li037s4",
                    "body": "It's a matter of perspective, Apple only sells the Pro Max starting 256gb for $1199 so that nobody can complain about the 128gb being expensive at $1099",
                    "score": 17,
                    "created": 1723597781.0,
                    "replies": [
                        {
                            "author": "SettleAsRobin",
                            "id": "li065mb",
                            "body": "It’s actually to make it feel silly to pay $1099 for a 256GB regular Pro and encourages you to pay $100 more just for the Max",
                            "score": 10,
                            "created": 1723598888.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ahyao17",
                    "id": "li07u21",
                    "body": "Just for reference, the iPhone 15Pro also starts at similar price for their 128GB model (at least Australian price).",
                    "score": 12,
                    "created": 1723599525.0,
                    "replies": []
                },
                {
                    "author": "Thin-End-2563",
                    "id": "lhzrt0w",
                    "body": "T-Mobile has the best deals. $999 for 512 GB with trade in. O$ monthly for 24 months. This is the 9 Pro XL.",
                    "score": 10,
                    "created": 1723593522.0,
                    "replies": []
                },
                {
                    "author": "Cyberp0lic3",
                    "id": "lhzrta2",
                    "body": "I despise the direction Google is taking Pixel. It makes me so sad to leave, but I'm not paying these prices.",
                    "score": 10,
                    "created": 1723593524.0,
                    "replies": []
                }
            ],
            "search_query": "pixel 9 pro xl"
        }
    ]
}