{
    "sigma 28 40 lens": [
        {
            "id": "5eqDuCnpVJQ",
            "title": "Sigma 28-105mm f/2.8 Lens Review: Funky &amp; Flawless",
            "description": "Review of Sigma's 28-105mm f/2.8 DG DN Art lens for Sony and Lumix. Discussing features, focusing, and image quality.",
            "views": "58818",
            "likes": "2085",
            "transcript": "Okay, today we're\ntalking about a new lens, the SIGMA 28-105mm f/2.8 DG DN Art, and this one's for Sony E-mount, but I believe there's a\nLUMIX version as well. Sigma did lend me this\nlens to make this review. They didn't pay me any money to make this, they don't get to see\nit before it goes up. This lens goes back to\nSigma when I'm done. But this video does have an actual sponsor and that's Storyblocks. Let's start by going over just a few basic specs on the lens. So it weighs 990 grams or at least the Sony version does. And for comparison, Sigma's own 24 to 105 f/4 is 885 grams. So the interesting thing is that it's not that much heavier than the f/4 and they accomplish that by one, a new optical formula, but also not getting that four\nmillimeter on the wide side. Also, for a 105 millimeter lens, it's not stabilized. That's something to consider. It is an external zoom, but at 105, it's not stabilized. Where often, 24 to 105\nf/4s are often stabilized. So just keep that in mind. Let's go over some of the buttons and switches it has here. First off, in the hands,\nit feels really good. I like the texture on it. And speaking of that zoom\nring that I just moved, it's nice, it's well dampened. Smooth, no complaints. You'll notice that there\nis a zoom lock switch over on this side. Now this is more for storage or for if you hold the lens upside down, it's not gonna break free, but you can still break through that lock by just zooming it. There's two function buttons\non the lens, one here and then one over here by the AF/MF focus selector. And there's also a switch for clicking and declicking the aperture ring. And the aperture ring\nalso has a feature I like, which is a lock to help you\nkeep the lens in the A-position if you want to control it\non the camera without it accidentally, you know, going to f/4. And then you're wondering\nwhy you can't change the iris on your camera. It has that. So basically every little switch and button that you could\nwant on a lens is here, and the front filter\ndiameter is 82 millimeters. So overall, no complaints with the lens, feels good in the hand. It's nice, seems well made. There is a difference with\nthe manual focusing though. If you're familiar with some of the more recent Sigma lenses, I've often had trouble describing them. I would say they're not completely linear, but you can move it precisely enough that you can get around that, especially for photographers. Normally, you'd be able to\ndial in the manual focus because the nonlinear response means that when you move it\nslowly, it focuses slowly. Then when you move it\nquickly, it focuses quickly. But I found that just\nby moving it naturally, I always felt very precise. Sony lenses often work on\nsort of a medium quick speed, but they're linear. The acceleration is the\nsame all the way through. Now I believe you can probably\nprogram this on a LUMIX camera to be linear or\nnon-linear whatever you want. But on the Sony cameras,\nwe're stuck with just how the lens performs naturally, which is different on this lens. There is no slow speed anymore. It's sort of, like, even if\nyou turn it quite slowly, it still feels more like a medium speed. Medium to quick are your two options now. And I'd say this is maybe\nthe worst thing about this and it's definitely a step\nin the wrong direction because if you're not gonna be linear, then at least give me that super slow, super precise thing. If you're gonna be non-linear, then why make everything, you know, so now it's just non\nrepeatable and not as precise. So that's a con and again, for the LUMIX\nversion it might be fine, but it definitely feels like a little bit of a downgrade compared to a Sony lens and possibly even to the, you know, super long\nthrow, previous Sigma ones. You still have a long throw, but yeah, I don't like it quite as much, but the ring does turn nicely in the hand. The autofocus is improved\nthough compared to some of those older Sigma lenses because this is now using their high response linear actuator. So they're, you know, linear, super fast autofocus motors, which on the last couple Sigma lenses that are also using these is terrific. They work excellently\nand no complaints at all. So autofocus will be fine, just some nitpicks about manual focus. And the minimum focus distance\nis the same on this lens at the wide end as it is on the telephoto, which is 0.4 meters or 1.31 feet, which means that you're gonna\nget much closer reproduction on the telephoto end than\nyou will on the wide end. And the reproduction is\nactually pretty good. So this is a 28 millimeter and if we punch right in, we can see that it is quite sharp, which is good, means we don't have any issues with minimum focus. But look at the difference\nif we zoom to 105, you should get pretty good reproduction. It's not, you know, full macro obviously, but it's pretty tight. It's one of the tighter\nzoom lenses I've seen for photographing this Rubik's cube. And again, we're getting\nincredible sharpness right there in the center, even even at the absolute minimum focus. I also have a couple\nsomewhat real world examples of me testing both the autofocus and again, close focusing. This was at 105 mil and I was kind of tracking\nthis bumblebee around and I was really impressed\nby the sharpness. I mean, just look at all\nthese little tendrils on the dandelion and yeah, and even the bumblebee just looks, it looks great and I have one more example, again, incredibly sharp. You can see the full frame here. This will also give you\na little bit of an idea of the bokeh, which we'll\ntalk about again in a minute. But pretty clean, standard bokeh. Nothing too, you know,\nit's not really swirly or anything weird going on, just pretty standard in the background. But just look, the\nsharpness is incredible, although I do wish on this one\nthat I got both wings sharp, but that's not really a lens issue. That is a skill issue because if there's one thing I'm not, it's an insect photographer. So if I really needed\nimages of a sharp bumblebee, I probably would've been better off just downloading 'em from Storyblocks, the sponsor of today's video. The stock media platform that offers unlimited downloads of diverse and high quality content for one predictable subscription cost, but Storyblocks offers\na whole lot more than just bumblebee media. In fact, their library\nhouses over a million HD and 4K video files, images and motion graphics templates. And jokes aside, those motion\ngraphics have actually saved me time on previous projects, especially now that they added\nDaVinci Resolve Templates. Much better than my\nprevious and tedious method of making those graphics in Photoshop and then animating them in\nthe Edit tab using key frames. Plus anything you download from\nstory blocks is 100% royalty free with clear cut licensing, so you can focus on creating. Not worrying about usage rights. The platform is incredibly easy to use and the library is frequently restocked with commission content\nbased on customer demand to ensure you'll have access to files that are not only high\nquality, but fresh and diverse. So to get started with unlimited\nstock media downloads at one set price, head to storyblocks.com/undone or click the link in the description. Okay, let's finish off the Focus section by talking about parfocalness and focus breathing. In the parfocal department, which is the lens's\nability to focus at one end of the zoom range and then\nwhen you zoom to the other to maintain focus without\nneeding to refocus. So on this one you can see, okay, we're in focus here and this is focused on the wide end, but if we go to the 105 end, it's not quite sharp anymore. However, if we refocus on the 105 end and then zoom out to 28, it actually maintains its\nsharpness pretty well. Again, not perfect, it's okay. Let's give it a 6 out\nof 10 for parfocalness. The autofocus is pretty fast though, so as long as you're not crash zooming like some episode of \"The Office\", you can probably allow the autofocus to bridge the gap in the lack of parfocalness on this\nlens, if that makes sense. And then lastly, focus\nbreathing was extremely well controlled in this lens, which was great to see because, you know, even\nif you use a Sony camera with focus breathing compensation, usually it doesn't work\nwith third party lenses. So you want the lens to have really good focus breathing control. Now I'm sure I'm showing a\nclip of it on the screen now, but for those of you that don't know, focus breathing is where the field of view\nchanges as you focus. It almost seems like you're\nzooming instead of focusing. But this lens, the frame\nbarely changes at all. So that's fantastic. Now let's move on to bokeh. This is at 28 millimeters at f/2.8. You can see we do have some\ncutting in in the corners and if we look at some of\nthese orbs in the center here, they look quite nice. You will notice something\nthat's interesting about how many iris blades there are and we'll get more into that in a minute. But this is a 12-bladed iris, which is uncommon for Sigma. At 28 mil, though, they're\nnot gonna be that luxurious, but at 105, we get a\nbetter look at them here. Even up in the corners,\nthey do quite well. There is a bit of that\nonion-ringing going on, but the outer membrane isn't\ntoo strong, so that's nice. Not the best I've seen,\nbut certainly passable. And again, one more shot\nso we can see the extent of the cat's eye, which isn't too bad at all, which is why in those other\nshots you didn't really have that much of a swirly look because the bokeh for better or worse is a little bit\nsterile on this lens. So it's not gonna be distracting, but it's also not gonna add anything, you know, magical to your shots if that's what you're looking for. And then if we stop down, we can get a look at that 12-bladed iris. Now the 12-bladed thing is interesting. Sigma doesn't really make\nlenses with 12 blades and they don't plan on\ndoing so in the future, I was told in my briefing. This is sort of a one-off that was necessary for this optical design to maintain some other\ncharacteristics that they wanted. But it does create interesting sunstars. You'll notice that instead of\ngetting twice as many spikes with ones in between these, you get fewer, stronger,\nthicker, more distinct spikes sticking out of the sun. It's one of the interesting\ncharacteristics about an even-bladed iris,\nespecially when you're at 12 blades of this one here. So, you know, this could be some interesting\ncharacter if that's something that you wanted, if you wanted to show\nthe sun in your shots. But while we're here, let's talk a little bit about flare. So you can see on certain angles, it is incredibly well controlled. These blacks are super black and rich. You can get a little bit of, you know, ghosting and\nartifacts depending on how you let it enter the frame. These sun stars are pretty wild though. This is sort of a worst case scenario where you shoot in a really strange angle. I don't know why you would shoot this, but I just wanted to\nshow the sort of extent of the combination of the 12 blades mixed with flare combining at\nthe worst possible nexus. This is what you get. But if you're shooting like this, put your hood on, it's good. The flare's okay, they're usually pretty well controlled, but these sunstars are wild. And it's kind of just a fun little characteristic about this lens. And it might end up being\na one-off that it's like, \"What's that lens that has the\n12-bladed iris from Sigma?\" It's this one and it\nmight be the only one. Now let's talk a little bit about LoCA, longitudinal chromatic aberration, which is the fringing that occurs on the foreground and background out of focus areas that can usually only be\nresolved by stopping down. So if we wanna shoot wide open, we want a lens that has\ngood control over this type of chromatic aberration. And if we zoom in right\nhere, first of all, we can see the frame looks\npredominantly black and white, which is great news because otherwise you would see, you know, opposite colors like pink and green or red and blue. But I don't really see anything. I mean if I get really close, I can see the faintest little tinge, but this is incredibly\nwell controlled LoCA. Some of the best I've ever seen honestly. Like that is absurdly\ngood at 28 millimeters, so that's fantastic. And this is wide open. And at 105 mil, this is the full shot and I can maybe see it a\nlittle bit worse at 105, but again, like, this is really good. And so if I zoom out, yeah, you can see right here a\nlittle bit of bluish there and a little bit of reddish there. But you know, we're\nmagnified at this level. It looks black and white to me, and at the wide end I\ncan barely see anything. So really, really, really\ngood results as far as chromatic aberration is concerned. Here we can take a look at\ndistortion and vignetting. I have no lens corrections applied, but there will be some\nobviously that can improve this, probably fix it completely so I wouldn't worry about it too much. But if you wanna see what it looks like with no corrections on, there is a little bit of vignetting I can see in the corners. We're at 28 millimeters at f/2.8 and we are also seeing\nsome barrel distortion. And if we zoom to 105, it actually kind of flips. There's a little bit of\npincushion distortion now, but the vignetting mostly cleans up. If we go over here, we can take a look at the sharpness, but also again, some vignetting. And at 28, I do see a\nlittle bit in the corners. Again, this is uncorrected and if we look in the\ncenter here and zoom in, very, very, very sharp. And as we move out toward\nthe edge of the frame, it does fall off a little bit. I saw the MTF charts of this lens and comparatively, it performs\nsimilar on the MTF charts to Sigma's 24 to 70 f/2.8, which is a very sharp lens and noticeably better than\nSigma's 24 to 105 f/4. And center sharpness is not an issue. Just on the wide end, it does fall off a little bit in the corners. Let's take a look at the 105. Again, very, very, very\nsharp in the center. Let's see how it does out toward the edge. At 105, the sharpness doesn't\nseem to fall off as badly, but still this result is excellent. The sharpness is excellent\nthroughout the frame, you know, not as good as some\nprimes and stuff like that, but for 28 to 105 zoom,\nthere's nothing really to complain about here\nwhen it comes to sharpness. And that really is the\nbig question, isn't it? Because this is sort of\na strange focal length 28 to 105 f/2.8, which makes it, you know, a bit bigger and heavier than lenses\nthat don't quite have that focal range, but not quite the reach\nof a 24 to 105 f/4. So it's definitely\nsomewhere in the middle. I thought it was gonna be\nmore compromised than it is, and it isn't, at all. It's, like, without hardly any flaws. I guess what it comes down to is that if you find this combination of features in a lens useful, you know, one that goes from 28 to 105 with a healthy barrel extension or one that has an aperture\nrange of f/2.8 to f/22, then I can assure you that\nthis lens is of top quality and that I think you'll be happy with it. Passed all my tests with flying colors. It is very sharp. Has, like, no focus breathing. The chromatic aberration\nis fantastic on it. It truly is just a terrific lens. So it really just comes\ndown to if it's a lens that you can make use of. And if so, I think you're\ngonna be quite pleased with it. Alright... I'm done. Actually, hold that thought. Editor Gerald here with a minor correction about the longitudinal\nchromatic aberration. I heard from some of my\nfellow lens reviewers that they were experiencing more LoCA than what I showed here in my tests, so I went back to try and recreate it. And while I couldn't recreate it using my test method conventionally, I was able to create some\nmore striking LoCA results by following what they did. Here is one that's similar\nto what I showed you. I did the test again. And as you can see, really, really, good. I see the faintest bit of maybe\nlike a green color this way and the faintest amount of sort\nof a purple color this way. But if we take a shot like this. This is a 28 mil at a very low angle and jack up the ISO, then you can see it a little bit worse. Little bit more green, a little bit more of the\nmagenta coloring down here. It's still really minor though, which is why I usually like\nto say you should zoom out and then determine if the\noverall image, you know, looks black and white or if you can see chromatic aberration. At 105mm, it's a little bit worse just like we saw with my original test. We can see the blue and the red. But again, it fades out right away in both directions. And in this example, again, a little bit worse but it fades out in both directions. But when zoomed out, it still looks, they both still look pretty\nmuch black and white. And again, this is accentuated\nby getting a really low angle and then either shooting underexposed and cranking it up in post, or by shooting with a much higher ISO. But I wanted to show you\nwhy I didn't complain about the chromatic aberration\nin the first place too much. This is my recent review of\nthe 85 G Master II from Sony compared to the original G Master. And this is chromatic aberration\nthat's worth pointing out. And differences between the two. But look at this shot and then look at the 28 to\n105 zoomed to a similar level. This is not a problematic\nchromatic aberration. Once again, there's the 85 G Master. And if we compare it to\nthe ARRI Signature Prime that I did from that, you know, Best Lens I've Ever\nUsed video that I made, even it has a minor amount\nof chromatic aberration. But once again, look\nat the one on the left. This is the Signature Prime and then now look at the 28\nto 105 at 28 millimeters. It's better than the Signature Prime. So that why I said it's\nessentially flawless optically. So while I admit that I\ndefinitely underestimated how bad you can make the LoCA look by applying certain principles to it, I do like to keep my\ntest results standardized across the board, which his why I didn't\ntest it at high ISOs with a low angle. But even at high ISOs with low angle, I wouldn't call this LoCA problematic. Okay, enough rambling\nabout chromatic aberration, back to that funky outro. (funky music)"
        },
        {
            "id": "4XSJU9hG8v0",
            "title": "SIGMA 28-45 f1.8 Lens REVIEW: WOW, But...",
            "description": "This video is brought to you by Squarespace. I've been using Squarespace for over 10 years now and I think you should give it a ...",
            "views": "51972",
            "likes": "1647",
            "transcript": "right before we jump into this video if you'd like me to send you a free guide to capturing Motion in low light situations just look for this Orange Box over on fros photo.com put your name email address in it hit send it I'm going to send you that guide for [Music] free Jared poen fronos photo.com and this is a review of the sigma 28 to 45 mm f1.8 DG DNR you did hear that correct this is an f1.8 and sigma says that this is the world's first zoom fullframe lens that is a 1.8 Zoom now this is available for the Sony e-mount as well as the lount alliance.com which you should go over to El Mount alliance.com you're welcome so the big questions in this review that I want to answer is 1.8 better than 2.8 what are the differences is is this a big enough Zoom range is it not a big enough Zoom range should you look at something like the Sony 24 to 52.8 which is slightly less expensive than this I'm going to answer all those questions as well as show you sample images throughout the review as well as dive into the iPad so what did I photograph I took it to a concert which is a great place to use a 1.8 Zoom because it's nice and versatile I went out to Longwood Gardens where I took some wide shots and tight shots one at 28 some at 45 as well as was going into the gardens and out into the Meadows to photograph the building and then finally took it out to a baseball game so I could get close to the players and see how it functions now remember Sigma did have an 18-35 f1.8 in the past for crop sensor cameras but that had a slightly larger range than this one because it went a little further so is this enough we will get to that throughout this video they also are trying to position this as a good option for video Shooters now I just shot Stills but it might be a really nice lens on a gimbal because it is internal zooming but now let's take a look at the outside of the lens and tell you a little bit about it it's big that's right it's bigger than a 24 to 72.8 yeah it has an 82 mm filter thread you've got your lens Hood right here always take that off and put it on when you're shooting and let's see how it sits it doesn't Rock very much it's not just in Timberlake you know to rock your body you actually have to make it Rock a little bit so it's nice and stable right there in terms of the zoom throw this is it this is your 28 this is your 45 so you get through it pretty quick but that is not a very large range from 28 to 45 you think 28 to 50 could make sense because we are replacing a 2818 a 3518 and kind kind of replacing a 518 even though 45 is a little less that's perfectly fine you got a bunch of custom buttons here on the side you've got your lock switch for your aperture ring which is good for video Shooters I mean is it good for video Shooters though how many people are actually pulling aperture Rings anybody anybody in the comments you know leave one down below if you actually pull the aperture while shooting video doesn't make any sense in this day and age but you have that you have your autofocus to manual switch and other than that that is the outside of the lens it's got the a remember Sigma has contemporary C they've got art a and they have S for sport so how much does this lens weigh it weighs in at 2.1 lb or 950 G it's not the lightest thing in the world it's not the heaviest thing in the world but for something that goes from 28 to 45 it is a pretty heavy and pretty hefty lens so keep that in mind if you're shooting video the key is you want to make sure that it's balanced on a gimbal if you're going to be running and gunning and the thing is there's not a lot of change from the center of gravity when you were zooming from 28 to 45 so you shouldn't have to do too much in the way of rebalancing if you're going to throw this on a gimbal now close focusing you can get within 11.9 in or 30 cm which is what I tested out when I was at Longwood Gardens photographing the the weeds blowing around the you know a bird tried to attack me a bird tried to attack me at Longwood Gardens I hope I recorded some of that footage cuz it was it was a black bird with red wings and he was like and he kept circling my head and I'm like shoe bird get out of here I didn't know what I was going to do if I had to run I was like stop get away from me bird I don't know maybe he was trying to build a nest in my head or maybe they were trying to build a nest in my head cuz I don't know if it was a male or female bird now in terms of aperture blades you've got 11 aperture blades you are going to see a difference between 1.8 and 2.8 people always say is it really that big of a difference well it's a stop and a third when it comes to light and in this day and age it doesn't matter that much because we can push isos higher but where it comes into play is when it comes to the threedimensional look that you get with a 1.8 a 1.4 an F2 the F 1.2s there's just something magical about the glass that makes the images look better for example I've got Brandon Marsh running out of the Dugout right here and just look at the three-dimensional look that you get it just feels tighter it just feels better now 2.8 are great I was always a 2.8 Zoom guy but now having something like a 28 to 70 F2 on Canon I love something like that and I'm trying to replace as many 2.8 as possible now I'm lucky enough that I can do that but it's great that they have these other options that are 1.8s coming into the market 2.8 are great 1.8s and fours and one 12s and f2s start to get even better now when you can replace three prime lenses potentially with one zoom lens that's something you need to take into consideration add up the price of all three 1.8s if you were going to do that and see if this will work best for you I'll still give you the price at the end let me jump in here real quick because I want to show you fro Pack 4 in action on this photo right here starting with blu's Clues followed by Brooklyn c41 copper tone High sea Kaleidoscope Mel Brooks saltwater taffy thick and wet Hot American Summer but check this out exclusive and all new to frow pack 4 are these four adaptive custom Lightroom presets that we call X1 X2 X3 and X4 I'm going to use X3 for ey enhance right here I go ahead and click it come over to my masks and select Iris and check this out I can raise the exposure on just those eyes to make them pop but if you go too far they become White Walkers and doesn't look good so you just have to find a good happy medium place so those work amazing but my all-time favorite preset from fro pack one is called Skittles with one click it goes boom so look if you want to speed up your raw workflow give yourself a great starting point or you're just tired of other people's presets just sucking ARS don't suck we created 14 all new custom Lightroom presets that you can check out right now at fronos photo /r 4 while you're over there you can play with the sliders to see the befores and The Afters and if you decide to pick them up right now they are currently on sale or if you want to get the Grand Slam bundle that includes fro pack one and of course Skittles you'll get fro pack 2 three and four as well and you'll save even more now let's get back to the video now since I mentioned 2.8 and 1.8 let's go out to the baseball field where I was sitting inside Third Base position which gives me a great shot of the on Deck circle of the opposing team and this is where I went from 1.8 to 2.8 you can see the difference and you know if you were just looking at a 2.8 you'd be like yeah that looks good nice background it's it's a 2.8 we love the way that that looks but when you see the 1.8 and it's not as prevalent in a shot like this but you will see the difference the closer you get to your subjects uh and away from the background it does make a major difference I'm just looking at this signboard in the back it's more in Focus there at 2 point 8 and it's even more blown out at 1.8 that's what you're looking for but you're also getting the sharpness you're also getting the clarity the tightness the better contrast that you get out of better glass let's jump back in to the concert now I went and photographed my buddy Keith who plays bass he's slapping the bass slapping the bass slap the bass man he was slapping the bass for a band called Nimrod they are a Green Day tribute band and they actually don't suck they were really good and I I'm very particular about music and they were good so they pulled it off but here we have Keith at 28 mm slapping de base then we zoom in to 45 that is the range that you get in my opinion what it felt like shooting it in all of the scenes that I shot it in is that 28 wasn't wide enough and 45 wasn't long enough and it's the story of my life cuz that's what she said not wide enough not long enough leave so yeah I I I I really wish it went to 24 you know 24 to 50 but there's always going to be a trade-off when I looked at these images which I did take with the Sony A1 keep in mind you've got the e-mount and since Stephen says that I wasn't very uh you know loud and excited about the l-mount alliance it was part of the lount alliance alliance.com which is built on Squarespace by the way but when I got these images into the computer and I zoomed in I was like damn that's sharp it looked great at 1.8 the focus was really good the colors that I was able to pull out of it are really nice I was happy with the results that I got I really like what I was able to do at a concert situation but keep in mind if you're in a tight situation or a tight space you might not be able to get wide enough where you get his whole body or their whole body in and if they're further away 45 might not be enough to get what you need now moving on into the concert the guitar player was sitting here uh and at 28 mm at f1.8 this looks fantastic right right you could see the Bad Bunny over there to the right or whatever they call that bunny from Green Day you could see them out of focus the guitar player right here the black and white looks fantastic I was really happy with the sharpness of this I was like that is a really sharp lens now let's go out to Longwood Gardens a place I love going and if you're ever in the Philadelphia area about an hour outside of the city is this Longwood Gardens it's an incredible place to go I highly recommend it they allow you to bring tripods they allow you to bring cameras so if you want a place to go and take cool photos go to Longwood Gardens so here are the fountains with lens correction on for this lens I like what it did it really straightened out the lenses now remember lens correction is being added digitally to almost every single new lens these days when they put the digital lens correction on there that is how they intended the lens to be so when you see it corrected it's corrected at 28 mm for this lens uncorrected it's probably slightly wider but they build that in so that they can correct for the Boe that is there and give you straighter lines now let's head back out to the ballpark because I can get up close and personal on the field before the game to get some cool shots now I picked this one of JT real Muto coming out of the Dugout because we have the Sun bright and in the SK Sky uh right before game time probably about 5:30 let's see is there some flare we do have a little bit of lens flare coming in there it's nothing that that I would be worried about but I'm again happy with the sharpness I mean JT is perfectly sharp and the guy over his shoulder at 2.8 would probably be a little more distracting but at 1.8 not distracting at all continuing on we have one of the Phillies signing autographs here look 28 is is fine I I would like slightly wider but it's a trade-off that you have to ask yourself are you g to miss shots that you would have gotten at 24 uh and I don't think it's that big of a deal the 1.8 I rather have all day and yeah I shot all of these mostly at 1.8 because if I have a 1.8 I want to shoot it at 1.8 because I want to see the best results possible and I do feel uh wider open in most cases is better now in terms of focus Motors you've got HLA Focus Motors in this which gives you really fast Focus I had no issues with focus and I felt this was better than the 24 to 72.8 where the focus felt a little slower in some situations at least in comparison to the Sony 24 to 72.8 I didn't feel like the focus was slow at all on this I felt that it was great I didn't notice it focusing and it was awesome now in terms of shooting speed you are still limited to those 15 frames per second in continuous autofocus you will not get up to 30 frames fres a second or 90 or 120 if you're using the a93 or any of the future cameras that offer that so just keep in mind your limit is 15 frames per second a couple more images before we wrap this up we've got Nick castanos right here you can see the focus is tight on him eyes nice and sharp colors nice and bright and vibrant and saturated and part of that is because I use my presets on there FR Pack 4 looks really good but look at the background they are obliterated they are not a distraction and that's why I shot down the Dugout the way that I did here is so that you can see the out of focus area and yes 1.8 is going to give you a better separation from the background than 2.8 and the last image is right here of Garrett stubs who turned around on the bench he was standing up there and I was right there at 28 mm and boom do I want to always be at 28 millim when I'm this close to the the players the answer is no I would rather be a little further away but because I have the ability to do this and I know some of the players now they're cool with it and it helps us get these results but look let's zoom in all the way on his eye man that's really good let me jump in here real quick and let you know this video is brought to you by Squarespace if you're looking to build your very own online portfolio use what I've been using for my personal website at Jared poland.com for well over 15 years now the reason is it's simple easy and affordable and I don't need to know any coding to get your 14 day free trial head on over to squarespace.com fronos photo if you decide that is for you use the code fronos photo at checkout to get 10% off your first order now let's get back to the video I am really happy with the results that I got out of this lens so what does it cost we are at $1,349 whereas a Sony 24 to 52.8 which is wider and a little longer for her pleasure is at ,00 $ now if I had to choose between the two of those I'm taking the 1.8 Zoom all day long why 1.8 better it's just it's just better now the Sony is lighter it might be a better option for some video Runners who want to save on weight if you're looking to save weight then that Sony might be a better choice cuz it's slightly wider and slightly longer but man when you can get a 1.8 Zoom I I would definitely consider it but there's two more tests that are going to determine if you buy it or not there's the sniff test oh yes smells like the Philly Fanatics nose oh that is such a good Philly fanatic smell and the wind tunnel test Let's see we Huff we puff and we blow failed it failed it it blocked all the wind but that doesn't mean that this lens is a is a fail at all I I really liked it yes I want a little bit more but if you're replacing a 2818 a 3518 and a 50 in all intent and purposes then I really like this something else that I'll add is that I love my 28 to 70 F2 on Canon yes it's a little heavier and yes it's almost twice the price or more than twice a price CU it's $3,000 but that 28 to 70 range I mean that is completely covering everything and if the rumors are true for Sony and for Canon we might see 24 to 70 f2s coming at some point the difference between F2 and 1.8 not as big as 1.8 and 2.8 you're still going to get that look that I absolutely love so if you are looking for something like this and you think that that range works for you I can highly recommend it based off of the quality the fast focusing the sharpness everything about it I was really happy with except I would like a little bit more wide and a little bit more reach what do you guys think leave some comments down below thank you very much for watching Jared po Andros photo.com see you"
        },
        {
            "id": "mNMY8CWc_AQ",
            "title": "Sigma 28mm f/1.4 DG HSM &#39;Art&#39; lens review with samples (Full-frame &amp; APS-C)",
            "description": "A brand new 28mm monster from Sigma - does its quality justify its price tag? Find it here (Amazon affiliate link) (Be sure to get the ...",
            "views": "68184",
            "likes": "1018",
            "transcript": "hello again everyone and today we're look at a totally brand new lens Sigma are continuing their unrelenting mission to take over the world with oversized professional f 1.4 camera lenses and they cover yet another focal length now with their new 28 millimeter f1 point for art for full-frame digital SLR cameras or mirrorless cameras if you adapt it on it will be available in Canon Nikon or Sigma mounts and the price in the UK will be 1099 pounds that translates to probably around 1200 euro or US dollars so on the expensive side and I'd like to thank Sigma UK for loaning me a copy of this lens for testing for a little while although as usual this is a totally independent review I'll be taking a look at its strengths and weaknesses 28 millimeter on a full frame camera is a standard wide-angle it's not tight enough to give you any emphasis on your subject really nor wide enough to stretch the corners of your images at all it gives you very neutral looking images for some people that's exactly what they want for others it's a little boring I'm not a huge fan of 28 millimeter myself but that's just me I can definitely see the use of a 28 millimeter prime lens and this one's maximum aperture of f1 and another dimension to its potential users outer focus backgrounds at 28 millimeter look nice and gentle and of course that bright aperture lets in tons of light for shooting in darker situations on aps-c cameras it's the full-frame equivalent of 42 millimeter a bit more interesting really giving you slightly tighter images this could be an amazing standard lens for aps-c camera owners the depth of field will look slightly deeper of course on an aps-c camera as usual the equivalent of about F 2.2 still really nice though again let's look at the build quality it's completely what we're used to for a sigma art prime lens frankly really excellent it weighs a couple of pounds just under a kilogram it's weather sealed and strong and metallic feeling the focus ring is rubberized and turns very smoothly and has full time manual focusing I found the autofocus motor to be quick quiet and quite accurate both on my canon 60 and when mounted onto my sony cameras using Sigma's own MC 11 lens adapter one thing to bear in mind is that this lens does not have image stabilization the filter size is a large but quite standardized 77 millimeters wide it comes with a nice lens hood with a little locking switch that's a new one for me on a sigma lens and it also comes with one of Sigma's awesome foam lens cases which I love I attach them to my belt when shooting weddings overall it's typically fantastic build quality here for a sigma art lens alright then image quality this is one of the few lenses which are not gonna bother testing on my 20 megapixel full-frame camera because we can see everything we really need to know for my 42 megapixel results here it is adapted onto my sony a7r 2 with Sigma's official MC 11 lens adapter which worked with the lens really nicely by the way in the middle of the image we see very high resolution but only average contrast the corners look brilliantly sharp say what a great result there f2 sees a little more contrast in those corners and a brilliantly punchy image back in the middle F 2.8 is only a tiny tiny bit better in the middle and inner corners but f/4 is very slightly sharper again it stays there sharp down to f/8 but will start getting a little softer if you stop down from here so on full frame we see fantastic image quality straight from F 1.4 really not totally perfect but definitely brilliant how about image quality on a 24 megapixel AP see camera at f1 point for the middle of the image is brilliant again despite the 24 megapixel aps-c sensor being a bit more demanding here the corners are slightly soft today they stay about the same down to F 2.8 although contrast is a touch better when stopped down but stop down to f4 and there's next to a punch of resolution over in those corners here's the middle of the image again now in case you're interested pretty impressive it'll stay there sharp until you stop down to about f11 or so so it really is a great show for this lens on aps-c although that edge of perfection we saw on full frame has slipped away a bit let's take a look now at distortion and vignette on a full frame camera we see slight barrel distortion being projected here about the usual for a 28 millimeter full frame lens at at 1.4 those corners look very dark though as you'd expect their improved at f/2 and stopped down to F 2.8 for even illumination into those corners this lens can focus as closely as about 26 centimeters from your subject not bad for a wide-angle prime lens at F one point for the close-up image quality is slightly soft stop down to f/2 though to get back to perfection so try to do that when you're shooting close-up let's see how it works against blank light we actually see quite a lot of flaring here but the thing is it's really gentle so you might put it in your images from time to time but it won't be very bothersome finally bokeh no problems here at all as we've come to expect from Sigma's art lenses when you open up that aperture you get out of figures backgrounds that looked lovely and soft related Tabaka his longitudinal chromatic aberration at F 1.4 here you can see a slightly strong level of purple highlighting in the foreground and green in the background stop down to f/2 to see it reduced overall well if 28 millimeter is for you look no further this Sigma lens is about as good as you're going to get really well Zeiss do make a manual focus Otis equivalent lens which might be very slightly better returnee costs five thousand pounds considering that this autofocus Sigma lens will cost five times less it easily comes recommended"
        },
        {
            "id": "LCebPKgpHYo",
            "title": "Sigma 28-45MM F1.8 DG DN ART Lens | Hands-on Portrait Photography",
            "description": "Join Sal D'Alia as he takes us on a photo shoot in Washington Square Park with model Joanna using the all-new Sigma 28-45mm ...",
            "views": "8375",
            "likes": "184",
            "transcript": "this is alalia for Adorama TV and in this Endzone video I'm going to talk about the new Sigma 2845 mm f1.8 D gdn art this is the world first zoom lens with a Conant f1.8 aperture for fullframe mirrorless camera systems it's available for Sony e-mount and L Mount I put it to the test shooting with Joanna in Washington Square Park I shot everything with my Sony Alpha 7 R5 Sigma developed this lens as a successor to the sigma 1835 1.8 which in 2013 became the first lens in the world to achieve f1.8 throughout the entire Zoom range this lens achieves performance comparable to Prime focal length lenses this 2845 mm focuses on suppressing actual chromatic aberration which you can notice often in large aperture lenses in order to achieve images with minimal coloration on both the focus plane and the bouet the minimum focusing distance is 30 cm which is around 11.8 in and is throughout the entire range of the zoom and the maximum magnification of 1.4 is achieved at the 45 mm focal length you can see here how close I am to Joanna and with a 1.8 you actually have to be careful to try and focus the eye instead of the the eyelashes that's how shallow the adapter field is the lens also features an internal zoom and what Sigma calls the HLA which is a highly response linear actuator autofocus the optical design minimize Focus breathing which makes this lens well suited for video work as well you can see how I'm not using any tripod on this [Music] shoot on the lens you have a click and the click and a lockable aperture ring also the lens is dust and splash resistant considering that you have a 1.8 costant aperture Zoom Sigma found a very good compromise of weight and size I was happy with the results of this lens I like the colors I like the sharpness I definitely like the bokeh but you can see also on the corner of the frames when you're wide at 28 mm all the lines are straight everything look as good as it would be at the center of the frame this is a great warhorse lens with a 28 to 45 range you can shoot pretty much anything and that aperture constant f1.8 gives you beautiful images and Superior Optical performance exactly like you would expect from an art serious lens thank you Sigma for loing me the lens if you have any question please leave it below subscribe to Adorama TV and I'll see you next time [Music] this"
        },
        {
            "id": "N3-vGIUBJOw",
            "title": "Sigma 28-105mm f/2.8 DG DN &#39;Art&#39; lens review",
            "description": "Yet another striking new lens from Sigma...is that zoom range useful enough, and will the thing be SHARP enough for anyone to ...",
            "views": "25326",
            "likes": "1278",
            "transcript": "howdy once again everyone another month another announcement of radical new Sigma lens what a year they're having so far my gosh their designers must be working harder than air traffic controllers well here is the new Sigma 28 to 105 mm f2.8 DG DN art yes 28 to 105 mm f2.8 awesome the ears of all kinds of wedding photographers photojournalists event and portrait photographers just pricked right up and its full frame with its minimum Focus distance of only 40 cm it has decent macro ability as well and that Zoom range is potentially very useful for video makers too looking for a bright aperture lens whose focal length they can get just right I can imagine this lens being of great interest to professional cinematographers the lens will cost 1,399 in the UK when it comes out I'll pin the US dollar price in the comments be sure to remind me if I forget it will be available on Sony E and also on L Mount cameras and as I mentioned it covers a full-frame image Circle I'd like to thank Sigma UK for loaning me this lens for 10 days or so for evaluation although as usual this is a totally independent review on a fullframe camera that 28 to 105 mm Zoom range for an f2.8 lens is simply out of this world although not completely unprecedented tamon made one of these things back in in 1997 I actually tested one a few years ago Link in the description below it was a bumper to bumper disaster one of the worst lenses I've ever tested then recently Canon brought out their own 24 to 105 mm f2.8 zoom lens an awesome piece of equipment again Link in the description below for a review but at a price of $3,000 and a weight of3 it's rather a pain to shoot with and carry around with you not a particularly fun or affordable lens for Mortal human beings like me so I think there's definitely room on a market for a Sigma lens like this but is it worth its price let's start by looking at its build quality the first thing that jumps out is how big the lens is although not to the point of being unmanageable it weighs about 990 G or over 2 so it's rather heavy too although not quite to the point of being tiresome to use its body is made of a mixture of metal and plastic feeling fairly solid and is based on a metal mount with weather ceiling next comes an aperture ring this can be set to turn smoothly or with clicks at every third of an F stop which caters well for both Stills and video shooters usefully that aperture ring can also be locked in or out of automatic mode making it harder to accidentally set incorrectly next comes a rubberized Zoom ring it turns quite smoothly and evenly but a little heavily with a little stickiness to it so it does take a bit of effort on the old fingers to quickly zoom in and out then again that's what you'd expect on a lens with such a zoom range combined with larger than usual glass elements inside the zoom ring can be locked at 28 mm although it's not a very firm lock following that we get an automanual Focus switch alongside a couple of customizable Focus hold buttons followed by the rubberized manual focus ring which also turns very smoothly and responsively when you're zoomed in the lens displays almost no Focus breathing very impressive zoom out and it gets a little more noticeable but honestly for video makers this is a great performance the lens's autofocus Motor Works silently and accurately in single shot autofocus mode the Focus motor worked very quickly in continuous autofocus mode though it performs big Focus pulls almost instantaneously this is the fastest autofocus you can really get nowadays very impressive The Lens comes with one of sigma's good quality padded carry cases as well as this nice lockable lens Hood with a rubber trim its filter thread size is a large 82 mm and it does not have image stabilization although it cooperated with the inbody stabilization of my Sony camera pretty well all in all the lens is large size and heavyweight May P some people off but other than that the build quality is still excellent and it has a number of of particularly useful features for video Work including almost no Focus breathing and Incredibly fast autofocus okay then image quality I'm testing this lens today on a Sony a7r 3 camera with its 42 map fullframe sensor in camera correction are turned on for this test the reason I like testing on a 42 megap sensor by the way is that it's a lovely happy medium between a 24 or 33 map Sony camera and a higher resolution 60 map one anyway at 28 mm and f2.8 image quality is stunning in the middle razor sharp with excellent contrast that sharpness remains throughout the image frame until we reach the very Corners where a little softness and darkness can be seen nothing too serious though stop down to F4 for more brightness and sharpness to emerge and the Very edges look just a little sharper at f5.6 and f8 with a lens staying about as sharp as this until he's top down to f11 Let's zoom into 55 mm then at f2.8 we're getting the same perfect image quality in the middle the corners again are noticeably softer but not too terrible they get a lot sharper at F4 but that's about as sharp as they get really finally let's Zoom all the way into 105 mm at f2.8 the lens loses its razor edge of sharpness and contrast here but image quality is still very good over in the corners again we get some soft softness stop down to F4 for an improvement in the corners but again that is as sharp as they get the middle now looks fantastic the lens stays their sharp down to F-16 where defraction is now taking a heavy toll overall on a full-frame camera I don't know if this lens will be quite sharp enough for the most demanding of pixel beeping professionals but honestly I personally wouldn't have much hesitation shooting a wedding with it it's nice and sharp in the middle of your images and the corner image quality isn't so bright and shiny but it's acceptable especially considering the lens's ambitious design well let's take a quick look at how this lens performs on a cropped sensor by mounting it onto a 24 map apsc camera at 28 mm and F 2.8 we still get razor sharpness in the middle of the image the corners though are looking much sharper than on a full frame that is The Sweet Spot advantage of an apsc camera at work right there although we do also notice a little color fringing on contrasting edges stop down to F4 for just a touch more sharpness and contrast but that's as sharp as the image quality gets let's zoom into 55 mm now again excellent image quality in the middle of the frame over in the corners this time softness is a bit more noticeable stop down to F4 though and those Corners get much sharper the lens Tays their sharp down to about f11 finally 105 mm at f2.8 image quality is slightly softer than middle now with slightly low contrast Corner image quality is looking a little rough here too stop down to F4 for more contrast and to touch more sharpness in the corners the middle looks fantastic now though stopped down to f5.6 and the middle looks as good as before but the image Corners are looking better and at f8 they're also looking okay overall on an apsc camera the lens is nice and sharp in the middle across most of its Zoom range but Things Fall Apart slightly at 5 mm where you'll want to stop down a little for best results all right let's hop back onto a fullframe camera now turn off in camera Corrections and take a look at Distortion and vignetting at 28 mm we see a lot of barel distortion and rather dark Corners stop down to F4 or f5.6 for those Corners to brighten up zoom into 40 mm or so and that Distortion straightens out Zoom all the way into 105 mm and it flips into rather strong pin cushion dist Distortion with again heavy vignetting stop down to F4 or f5.6 for those Corners to brighten up so well it's a typically bad performance for a modern zoom lens here that's just the direction lens designers are going in today getting the camera to correct those things make sure your images are getting corrected either by your camera or in post next closeup image quality and as I mentioned the lens has a very impressive minimum Focus distance of only 40 cm nice at f2.8 closeup image quality is rather soft and ghostly stop down to F4 for big improvements though and at f5.6 close-up sharpness and contrast is excellent let's see how the lens performs against Bright Lights now at wider angles it's excellent news contrast remains very high and there's almost no flaring to be seen here zoom in though and we catch some glaring and broader flaring when bright lights are directly in the image or just on the per refere and while we're working in the dark let's take a look for coma and Sun Stars here's some good news even at f2.8 coma smearing on bright points of light is basically non-existent nice so let's zoom out again and look for sunstars stop down to f5.6 and they become quite noticeable already they get progressively more impressive from f8 to f11 F16 and F22 so that's pretty awesome to see as well next bcka this L can get you some deeply outof focused backgrounds which are averagely smooth quite nice on a whole actually for a zoom lens however if you zoom right in then exceptionally bright specular highlights can have a problematic Edge to them but only in rather extreme situations and a slightly busy substructure it's nothing disastrous though only on very bright specular highlights when you're zoomed in and generally apart from that the Boker is fairly smooth and finally related to bcka comes longitudinal chromatic aberration it's rather noticeable at f/2.8 and F4 although I've certainly seen worse than this before at f5.6 it's reduced and at f8 it's gone overall this might not be a perfect camera lens but it certainly is good and extremely useful not to mention enjoyable to use and I can imagine wedding photographers and photojournalists finding it very helpful in terms of its image quality we get mostly good but slightly mixed results here the lens doesn't have the sharpest Corner image quality basically but then again hardly a surprise for such an ambitious design something I didn't mention before is that this lens seemed to have quite warm colors on the hole whether that bothers you or not is up to you but it's more than sharp enough for 4K video work and it's very good build quality and auto figus low coma big sunstars and good close shooting ability all make it a pretty great lens to use so it certainly does come recommended if it covers what you [Music] need thanks for watching everyone I hope you enjoyed that video and if not you're probably on the wrong Channel Try watching some videos about cats instead that's what I'm going to go into to do now anyway if you regularly enjoy these reviews and find them helpful then check out my patreon page in the description below there you can find all kinds of exclusive bonus videos as well as Early Access to lots of my reviews as well as getting a warm fuzzy feeling deep inside for supporting the channel take care and God bless everyone"
        }
    ],
    "pixel phone reviews": [
        {
            "id": "6nelcelHAN4",
            "title": "Using the Google Pixel in 2024 - Review!",
            "description": "The first Google Pixel & Pixel XL were fresh, unique flagships that started Google's current smartphone line- replacing the Google ...",
            "views": "113915",
            "likes": "4079",
            "transcript": "this is the Google pixel 9 Pro Google's ninth major Flag ship for the pixel line a lot of things have changed in the past decade AI is the centerpiece of practically any product these days camera bumps are almost hilariously big and Google even offers a foldable option if your wallet is feeling just a little bit too full smartphones are so so different today than they were not even a decade ago and yet the core experience does still remain the same this is the first Google pixel released October 2016 boasting a magnificent blue color and eye-catching aluminum and glass design the phone ran clean stock Android receiving updates from Android 7 n get to Android 10 in 2019 side note I really miss when Google used dessert names for each Android iteration it was fun for Google's first entry into the market this seemed like a pretty good start but of course it wasn't really Google's first smartphone with an entire line of Nexus devices coming beforehand all from a plethora of different Android manufacturers why Google decided to Rebrand their phones moving forward into the pixel is I think pretty straightforward they wanted to give their phones their own Google Centric identity rather than that of whatever company made it the Nexus line had also gotten somewhat convoluted in recent years leading up to the pixel with 2015 seeing the Nexus 5x and 6p released simultaneously despite a Nexus 5 and 6 already existing from 2013 and 2014 respectively problem was Google already had a Nexus 7 specifically a line of tablets named after their size of 7 in and so Google likely wanted to avoid any sort of Nexus 7 smartphone it was also around this time Google had begun utilizing their new pixel branding starting with the 2013 Chromebook Pixel and you also have the pixel C which was an Android tablet coming out in 2015 it only made sense for Google to drop the Nexus line Al together and refocus their efforts to a new line of phones that could represent them as a company and their own vision for Android moving forward a vision that would come with the first Google pixel along with each device succeeding it hey how's it going I'm Josh from 91 Tech and over the years Google pixel smartphones have seen a lot of ups and downs to put it mildly the blue tinted pixel 2XL display the ridiculous 3XL Notch the weird radar stuff on the pixel 4 but somewhere along the line Google did seem to get into a Groove releasing more budget oriented pixel a models starting with the 3A then also beginning to make Pro Models not unlike Apple or Samsung you of course then also have the pixel folds with a new version of that coming this year despite Google's challenges they've always had the resources to stick with the pixel line procuring a reputation of having some of the best smartphone Photography in the industry and so today I thought it would be a good time to take a look at exactly where all this started with the first generation pixel and pixel XL from 2016 so today I'm very excited to introduce you to a new phone made by Google we call it [Music] pixel I have here the Google pixel XL which features Fe a 5.5 in 1440p AMOLED display versus the 5-in 1080p display on its smaller counterpart the battery is also a bit larger on the XL but beyond that there are no real differences in the hardware I would definitely prefer the XL model personally both for the larger battery and display But ultimately I would never really want to use this phone today for the same reasons as practically any 8-year-old smartphone out there the hardware and software is outdated even if the basic performance is mostly spiffy at least until you get into more intensive things including even just scrolling through the Google Play store which does quickly reveal the age the display is pretty nice or it would be if my model here did not have Burnin severe burn in back when I bought this thing years ago the seller said it had light and barely visible Burnin obviously this was an exaggeration but it's not a big deal since I only have this phone for review not to actually use and it doesn't affect the actual experience only the Aesthetics burning can be a very common issue with OLED devices especially from this era you definitely would want to make sure you weren't letting your phone stay on a single image for too long at a time or you'll get what happened here one of the best elements of this phone when it came out and I would argue today as well is the premium aluminum design with glass on the top part surrounding the fingerprint sensor in the middle which feels reliable to use and still quite fast while there's some inherent disadvantages to having the fingerprint sensor on the back like having to pick up your phone to unlock it when it's just sitting on your desk it is still a spot your finger naturally rests when you're holding your phone and so I really don't mind it at all and that two-tone design I mean the blue is so unique and unlike practically anything we see in any smartphone today it's also nowadays unheard of to have a camera sitting flush with the back of the phone no camera bump in sight this is kind of refreshing even if the trade-off for the improvements in cameras these days is no doubt worth having the bumps although that pixel 9 Pro I mean that camera bump is just absurd things have come a long way for sure anyways this phone does feel like a nice change of pace with its two-tone look complemented by the simple G logo near the bottom no really big logos no Nexus word bark and perhaps most importantly no non-g gooogle manufacturer logos making this truly a Google phone plain and simple notably though while the Nexus line was gone it certainly wasn't forgotten living on in spirits with future pixels this phone was actually made by HTC with Google collaborating heavily Google actually tried to offer Huawei the contract to make the new pixel but this was declined when Google refused to stick the Huawei logo on the device alongside their own that's what this phone is really all about the beginning of Google's own smartphone brand free from the shackles of sharing the spotlight as much as I love the Nexus line which was so unique for having so many different Android manufacturers make each new device year toe there is an element of consistency sort of lacking from those devices and it makes complete sense Google wanted to just start fresh there were three color options for this phone including the blue along with the white and black unfortunately only the black color option had black bezels I've never been a fan of white bezels and it's not helped by how big they are in the first place I've talked about this before but I've got a real problem with old phones that used to have these ridiculous bezels but would refuse to put in a physical home button keeping instead the digital one I think Samsung always handled it perfectly until their bezels got thin enough to be rid of the home button completely with the S8 but they had one for years and allows for the space normally taken with the navigation bar to be used for actual content you've got all this white space on the pixel that's just sitting there doing nothing mind you I can live with the thick bezels but they have to have some sort of purpose there is no purpose for these including no front firing speaker and that's the thing the Nexus 5x and the 6p from 2015 both had speakers on their bottom bezel black bottom bezels by the way making the phones not only look sleeker but it gave some practical purpose to the unused space now Google doesn't help things by making said bezels more obvious by coloring them in white but still it's a waste in my eyes especially at a time so close to those bezels just being gone Al together the Galaxy S8 would come out in 6 months and the iPhone 10 in only a year but I digress my phone here is in rough shape cosmetically with some chipped paint but it's still very sleek and something I've always liked is the textured power button on the side which is just a nice little touch remember were those like differently colored power buttons on some of the other pixels I really missed those I don't know why they went away from it there is an argument to be made that the pixels of the past are completely foreign to Modern pixels and I think there's some Merit to it after the pixel 5 there was a pretty significant turn in design Direction with a massive horizontal camera bumps becoming front and center or I guess back and center and the fingerprint sensor moving to under the display I also personally really miss the glass and matte finishes contrasting together which Google got rid of with the pixel 4 the pixel 3 and 3XL from the back are still some of my all-time favorite smartphone designs I think they're just gorgeous and the frosted glass was the Perfect Touch moving from the aluminum of the pixel 1 and 2 just don't look at the front of the 3XL and it's absolutely beautiful that two-tone style started with the first pixel and it still looks pretty great in my opinion the aluminum does have downsides like the lack of wireless charging and we're also missing out on any sort of water resistance which was pretty bad for 2016 we do have USBC as well as the 3.5 mm headphone jack thankfully something Google was proudly boasting about painting after Apple got rid of theirs only to end up doing the exact same thing with the pixel 2 a single year later would it have been so hard to keep it at least one more year to not look so dumb so fast in any case at least we do have it here we've also got the specs pretty typical for a 2016 Android Flagship we're looking at the Qualcomm Snapdragon 821 processor 4 GB of RAM and either 32 or 128 gigs of internal storage with no expandable storage options unfortunately however this being a Google pixel that means you get cloud storage for free for your photos forever which hey that's pretty cool assuming those pictures aren't being used to train AI right Google right unfortunately this unlimited photo storage feature only applies to the pixel 5 and below it was a smart way for Google to get users in the door but I guess they decided it was no longer needed as a selling point on the flip side of this Google has done a pretty good job with software update longevity and they've only been improving Android phones have been always Infamous for typically only getting a couple years of updates if even that and the Google pixel thankfully did get from Android 7 to Android 10 which is pretty good compared to the majority of other 2016 flak ships Plus Google had only guaranteed updates till October 2018 so they actually gave it an extra year these days Google is promising updates for seven years on their newest phones and assuming they follow through on that it's pretty nice to see definitely a big advantage of going with a Google phone is as you would likely expect not only do you get more frequent and consistent Android updates but you're also now getting those updates for longer and so the pixel XL here is helped by having Android 10 Android 10 came out fall 2019 bringing a massive overhaul to the software experience including the gesture navigation system a very welcome system level dark mode and plenty of other things you would expect in a yearly update it doesn't quite feel natural to use my pixel with gestures rather than the typical home button I must admit but having the option here does lend a lot in keeping this phone feeling more modern even if performance can be a bit inconsistent it also appears there's a good few options for unlocking the bootloader on these phones as well as installing custom roms which is nice the community for this phone on the XDA forums appears to be still relatively active so there's always more you can potentially do for now though I'm sticking with the Bas experience and I'm a little torn on how to feel about this phone's performance on one hand it generally feels smooth enough navigating through the UI and messing around but it also does start to feel its age when I get into anything even moderately intensive trying to watch a YouTube video while installing an app in the background had me infinitely buffering for example that being said if unlike me you're capable of exercising even a modum of patients it appears this phone can still do the vast majority of tasks you might want to do on your smartphone it's 8-year-old Hardware is certainly holding it back but it's helped massively by the clean non- bloated stock Google Android experience and I do think this phone could be a usable device for those who end up stuck with it for whatever reason being 8 years old is going to hinder any smartphone in pretty much any category and that would include the photography that being said I also think this can be a usable experience believe it or not as these cameras have held up much better than I would expect from a 2016 smartphone we're looking at an 8 megapixel selfie camera which for whatever reason is positioned on the top left of the phone but it takes fine selfies nothing crazy here the single camera lens on the rear is 12 megapixels and while it's hindered by not having any fun telephoto or Ultra wide options it still manages to hold its own pictures from this phone still very much have that classic pixel look to them well not every situation favors the older pixel with its small camera sensor ideally you're going to want to take photos outdoors and good lighting but even in low lights the pixel camera app with its night sight does offer some versatility there is no portrait mode here but we do have the lens blur feature which is quite similar I found the phone wasn't great at handling motion taking pictures of my dog often resulted in blurry images as she would move around but if you're patient decent results are very possible and I think all this does go to show how long smartphone cameras have actually been pretty good even if it's one of those areas they've managed to improve upon the most year toe as they also get bigger and bigger there's some real charm to having a camera that sits flush with the phone itself and for it to actually take some nice photos despite that even for 2016 having no camera bump was rare and nowadays as mentioned it's just straight up unheard of video recording at 4K 30 isn't so great the image stabilization feels very janky to me unnatural and I can see the age here still overall I was impressed by the photography of the first Google pixel and it's not hard to see how they quickly fostered a reputation of having some of the best cameras in the smartphone industry now I did mention earlier that AI is now the focus of basically every new product coming out these days but this was actually also the case with the first Google pixel as this was in fact the first device to feature the Google assistant in many ways the first Google pixel is the quintessential pix pixel phone the design is bold and stands out the software is clean and fresh the photography is sharp and focused but the phone isn't perfect by any means the white thick bezels have aged terribly and not even having dual front firing speakers just feels like a waste lacking basic features like water resistance wasn't a good look in 2016 and there was absolutely room for improvement with future pixel models and ultimately the phone didn't end up selling anywhere near the numbers of Samsung or Apple the 2016 iPhone 7 and 7 plus saw around 160 million units sold throughout their lifespan the 2016 Galaxy S7 and S7 Edge saw around 55 million units sold and the first pixel and pixel XL sold over just 3 million the reality was and always has been Google hasn't seen the levels of success they would like to 2023 saw 10 million pixels sold so they've gotten better no doubt in part thanks to having more options throughout their lineup but there's also a lack of true dominance something their Nexus line also often struggled with still I think this was a fantastic start for Google's new smartphone line moving forward and in in my opinion the phone has aged about as well as any Android Flag ship from 2016 possibly can you've got to respect Google's determination having just gotten to their ninth pixel Flagship and only time will tell how many more phones will bear the pixel name and so with that I think I'm right about done here I didn't have a ton to say about this phone I do really like it especially that blue color if I'm being honest did any of you ever have this phone or consider getting it how do you think it's held up 8 years later make sure you leave your comments down below and if you found this video interesting please hit that like button and consider subscribing for more content just like like this huge shout out to the channel members for being absolutely amazing people and thank you all so much for watching I'm Josh from 91 Tech and I will see you all next time [Music] [Music]"
        },
        {
            "id": "3ZDcr1icSo4",
            "title": "Google Pixel 8 / 8 Pro Review - Problems!",
            "description": "My full review of the Google Pixel 8 / 8 Pro - We're a bit late with this one, but we're working hard to step up what it means for ...",
            "views": "3682431",
            "likes": "111093",
            "transcript": "I've been using the Google pixel 8 and 8 Pro for a while now I've taken these phones basically around the world with me and the only reason that I've waited till now to talk about them is they're complicated these are the most exciting smartest most futuristic phones that I really want to tell you while the best phones I've ever seen but I can't the packaging you'll get them with is pretty simple so this is the pixel 8 and then this is the pixel 8 Pro and each one comes with a manual charging cable and an adapter to switch from your last phone so when I first picked these phones up and I experienced the design I thought yes the pixel 8s look and feel basically like the pixel 7s the same space age aesthetic with ultra minimal speaker grills they're a lot more comfortable this silky frosted glass that you get on the pro this material right here this is what every phone should be made of and I've always said that the pebble is like the most comfortable shape that a smartphone can be and well with these new rounded Corners this is the closest we've been in a while now I know some people don't like the pixels whole visa thing I've got a friend who keeps telling me it looks like your phone is wearing a headband but I think it's great this visor it keeps the cameras high up on the phones your hands are completely clear of them it's symmetrical so when you put it on a table you don't get any weird rattling when you tap the sides of the screen the only thing that I don't like is that they've given the pro a glossy visor and saved the matte one for the base pixel8 and the matte is just way better it doesn't attract fingerprints it doesn't get scratched as easily this one does but at least the visors are very slightly raised in front of the cameras so your cameras are safe and then next to those cameras we've got a brand new temperature sensor on the pro why do we have a temperature sensor on first glance it seems really dumb and it doesn't exactly get clearer when you open up the new thermometer app to use it and the thing just looks like a template that's been drawn out in Microsoft Paint including an image that's very obviously like 240p resolution the app basically allows you to go up close to household objects and measure the temperature okay I mean I don't see people doing that for enjoyment and then for it to be an actually useful tool it needs to be laser precise but it isn't point it at the same object from the same distance and every single time the reading is different close enough to get a ballpark idea but not close enough to be a professional piece of equipment so here's my hot take I think Google put this in solely for the purposes of human temperature detection the idea that you know you're feeling sick your pixel is the first thing you can reach for to get a second opinion in fact earlier this year before the phones were even announced we saw a leaked video showing how you can move the sensor across your forehead to get a reading that is a great feature if it works cuz I mean I feel like people now are more conscious about getting sick than they've ever been before and your phone is like the one thing that you can pretty much guarantee you will always have with you it's just that if you want to be able to claim that your device can take your body temperature then that requires proper medical clearance which takes time so at the last minute realizing that this clearance is not going to be ready for the phone's launch I'm thinking that Google just quickly scrambled together another random alternate use for the temperature sensor just so they could still talk about it regardless of if that's true or not right now temperature sensor feels like a bit of a Miss but the rest of the design is close to are perfect for me and then you properly dive into the software with Google's version of the new Android 14 and this is both where I have some of my biggest problems but also in so many ways this is the user experience that I've dreamed of most of the time the animations are silky smooth and the attention to detail with them is Sublime like just for example the way that your screen turns on depends on how the phone is unlocked like if you use the power button the animation starts from the power button if you use the fingerprint scanner it starts from the middle of your screen and if it's face unlock the front camera will be the center point or another one you know when you want a gesture back and forth within an app you kind of pull in from the side well when you pull in here what you're pulling is this little arrow it'll stay attached to the border of the screen until you pull it with enough pressure for it to dislocate when it bounces forward off the border with momentum that has physical impact thanks to the soft vibrations of the phone it's very subtle but it's this kind of stuff that really makes it feel like you're interacting with objects that have real weight and presence and I got to say whoever is on Google's team making these kinds of minute but meaningful decisions you have my respect it's a large part of what separates the pixel from other androids for me and the haptic vibration experience all around whether you're typing or feeling that slight bump you get every time you scroll past an app or when you're using this Inc screen fingerprint scanner it is top class but it's not just about animations it's just the software as a whole feels very attentive it feels very tuned in to what people want like you know when you hear a song playing in a store and you start bopping along and you want to know what it is and then you realize that your phone has not just figured it out for you but it's presenting the information to you on a platter on your always on display one of the flights I was on recently I just lost my internet connection and suddenly remembered I had no idea what time I was Landing but then I pulled out my pixel and it was just there the information was on my lock screen the phone's packed with tutorials that explain how all the more complex things work and that is great cuz I don't think anyone is going to be able to pick up a phone as advanced as the pixel 8 and actually make the most of it without them every phone could do with more of these to be honest oh yeah and the Google Assistant more human than ever before I was using this a few days ago to prepare for an interview with very important person actually you will see that soon but I was essentially going on a really long walk and having the phone dictate articles on the internet to me and it sounds way less artificial than it does on my iPhone plus you have the ability to control speed so you can get it to reach you at 0.5x speeds or if you're some kind of very gifted person 3x speed you've got improved speech recognition I was using the Google translate conversation mode is literally my only way to communicate with the people in Sagal when I was out there recently I've been using this with my aunt who's Italian and literally speaks like four words of English it's still not quite perfect you have to wait between each person talking so the phone can keep up but it's good enough that I've been able to have conversations that I could never have had before so the intelligence of the software is a practicality win but it's also got some customizability perks like you have the ability to ask AI to design the perfect wallpaper for you as a concept this is freaking insane in my life I have spent many days worth of of time scrolling endlessly through wallpaper apps watching 25c full screen ads every 2 minutes just to try and find what I'm looking for and so all of a sudden just being able to ask for it is it's like a childhood dream now it can't make absolutely anything it does have parameters that it works within like minerals or paintings but that hasn't stopped me making tons of wallpapers that I feel really happy with and that I'm almost attached to because I know they're one of a kind I find the categories they're actually just useful because they guide it towards things that naturally make for good work wallpapers and then the software can take that wallpaper and theme itself around it it'll give you these color palette options and when you pick one you will see those colors throughout your entire user interface your widgets and even your lock screen you can also finally pick what shortcuts you want on your lock screen which is cool but it's a bit too limited right now for me to actually say it's useful but then you've got the headline software feature 7 years of updates oh W what we already thought it was pretty crazy that Samsung has started guaranteeing four Apple's had a lot of credit over the years for doing 5 plus seven I mean I don't imagine most thousand flagship phone purchasers are going to use one phone for 7 years but still 7 years of updates means that anyone who then buys the phone in the secondhand Market could still keep up to date and that's awesome now Google does have a pretty colorful history of discontinuing products that don't quickly build up large user bases so this could have come from a place of let's make this massive promise and only deliver on it if it really does translate to a big boost in pixel sales I've seen this sentiment a lot but I'm optimistic so far Google has always delivered on its pixel update promises plus I think the thing that I haven't seen being talked about is that it's getting easier to keep a phone up to date you know the major Android versions they're not changing as much as they used to so this idea of promising 7 years of updates it's a lot it's generous but at the same time it's not this insurmountable hurdle that they've just put up for themselves and also one of the complaints that's often lodged against pixel phones specifically is that a lot of things that are marketed as if their Hardware features are actually just software features that are very soon brought to other pixels too so you don't actually need to to buy the latest to get the latest and well yes this is true it happens a lot of the things that you might think are pixel 8 exclusive because of how they're positioned might not necessarily stay that way but I mean first of all they're not the only company that does this I mean that's very much what the iPhone event was like this year too and secondly it's not a bad thing that a company is supporting their older models that's the harder thing to do for them and it also means that while you're not the main beneficiary at the very beginning when you go out and you buy the latest you become the beneficiary when the next phone gets launched and you realize that you actually don't need to rush out and buy it so there's a lot of good about this software clearly but for me it has also been a pretty major source of frustration but before that all makees sense we need to talk about the cameras this is going to feel like a very strange thing to say for a phone this intelligent whose primary focus is the cameras and who's just supposedly had every camera upgraded and is now apparently the best camera on a smartphone but I think the pixel 8 and 8 Pros cameras need quite a bit of work the hardware is strong on paper both pixels have the same 50 megap main camera and then while the pixel 8 pairs that with with a 12 map Ultra wide the pixel 8 Pro pairs it with an even wider 48 map Ultra wide and then a 48 megap 5 times telephoto camera and I love this trend of not just having one good main camera but also kitting out each camera sensor cuz I think it's important when you're taking a photo to not be thinking oh which one of these cameras have the best sensor quality again and more just which camera creatively suits the shot that I'm trying to take and the pixel 8 Pro it definitely achieves that feeling like the telephoto camera thanks to the combination of five times magnification and really smart machine learning manages to retain sharpness all the way to 20 times and even 30 times in some cases which is its maximum amount of Zoom when was the last time you saw a phone that could actually get to its Max zoom and still take a satisfactory shot you don't get that feeling as much with the normal pixel8 cuz the ultra wide is weaker and there's no telephoto but since it's a $699 phone as opposed to the $999 pro the fact that you're at least still getting a proper Flagship main camera that's about the best you could hope for right so what's my beef then well essentially that these are the most technically sophisticated intelligent cameras I've ever seen on a phone but with a whole load of weird limitations that slowly eat away at that like when you're in portrait mode it forces you to digitally crop in a minimum of 1.5 times for some bizarre reason and then even weirder is that you can't zoom in more than three times one of the main camera upgrades that you're paying the difference in price for on the pro is this new five times telephoto camera why on Earth would they not allow you to use it here the same is true for slow motion where well you can zoom in up to seven times but it doesn't switch to your telephoto camera it uses seven times digital zoom and it looks terrible you've got this awesome new blur feature which lets you shoot cinematic video that I would genuinely say looks more realistic than both Samsung and Apple's but it's capped at 1080p compared to their 4K and also doesn't work on the front cameras and also only the pro gets the pro camera settings which I realize sounds like an obvious statement but you can't help but feel hard done by with the normal pixel 8 because given that this is one of those rare situations where both phones have the exact same chip and the exact same main camera Hardware so why is it that I can use this one to take proper 50 megap shots but I can't use this one to do the same do you see what I mean with these cameras like it just feels like there's so many unnecessary fences being put up here that just make it feel like you're not making the most of the great Hardware you're getting and then there's the lack of Polish like the transition between lenses it feels pretty rough it's laggy and the actual Viewpoint is jumping quite a lot every time there's a switch so anytime you want to shoot a video where you're moving in between these various focal lens it's not a great look the stabilization is very bipolar with good lighting the fact that you have really heavy electronic stabilization applied is mostly a good thing it means that you can just walk and your footage is so smooth that it almost looks like you're using a gimbal especially when using this pan mode which further slows down your footage and adds an extra layer of stabilization without even a hit to resolution I love this feature I'd actually probably use it to film bits of our videos if the quality of the video itself was a bit higher but I'm getting to that and then the thing with electronic image stabilization is that as the light starts to dip it gets worse and what was once an ultra stable camera is replaced by a camera that's constantly trying to hold itself stable but ends up creating lots of weird blurring and artifacts in the process in times like this I would say that not everything needs to be ultra stable it's fine to be a little shaky if it avoids the artificial feeling cuz that's life and then when you pair this weird stabilization with the fact that video can still get decently grainy as soon as you hit like middle lighting conditions and sometimes the out put of the pixel 8 and pixel 8 Pro can just look straight up bad like here's the latest iPhone in the same scene it's not perfect either but distinctly better at managing tricky lighting and the switching between its various lenses it's still better than the pixel 7s were last year but it's just I feel like with Samsung and Apple this year the camera improvements to these tricky scenarios have been even bigger than this now Google does have two features coming later in the year which are video night sight AKA improved low light video and then video boost which is this really unusual one where once you've taken a video and it's backed up online Google will run it through their servers upgrade the colors and the details and then just pop it back into your library for you it's a bit of a strange offering but if Google does actually deliver with both of these features then that would fix two of my biggest complaints with the pixel camera it's just well video boost isn't coming to the normal 8 just the 8 Pro and it's at this point a promise it's a even if the products aren't quite right now don't worry we got you if I already felt really good about the cameras and they were promising bonuses then I'd be comfortable with that and I side with the fact that they will probably deliver but because there are things that aren't right now that I think need fixing buying the phones at this moment in time feels like a bit of a gamble now that said there are a lot of redeeming qualities like the phones already do take really detailed clear high quality photos with realistic colors all around the new iPhones still come out a bit more detailed thanks to them now shooting in 24 megapix as opposed to the 12.5 megapixel that these shoot at but in terms of the quality of the image this is high and then you've got best take which is kind of like the next era of Google's Top Shot feature when you took a bunch of similar photos your phone could previously identify which was the best and serve it to you but now it can actually create a hybrid of all of them where everyone looks their individual best for up to five people part of me finds it a bit creepy it's like the most real visceral example of photo manipulation in a way that the shot you end up with as a whole is not actually the real moment that was captured then on the other hand it's a very intelligent solution to a very human problem that I and I'm sure most of you have also come across like or not this is the way that phone cameras are headed and then audio Magic Eraser is another one of those situations where you see it in action for the first time and you feel like you've just witnessed magic it figures out the different layers in the audio for example there might be a wind layer or a general background noise layer it separates them into separate compartments and it allows you to erase whichever ones you want like if you're trying to focus on a conversation you're having but there's some really annoying music in the background it'll figure that out and delete the music and this doesn't need to be videos taken on the phone it can be any video which creates it's a really weird situation for me because we use background noise removal a lot for our videos and this phone is actually a much faster way of doing it than a proper professional using top-of-the-line editing software and it can't fix everything but then again neither can those programs and in our experience every audio track that is fixable this can and it will fix so we'll be legitimately sending our videos from a Mac Pro this size to a phone this size to do the work on that's the sign of a good feature and at this point there are tons of examples of this the way the phone can add a light source that shapes light around a person's face the Magic Eraser which can not just remove distractions but also camouflage them and this is also apparently getting better later this year and then of course this new magic editor which includes the erasing but also just goes further and it's one thing seeing the feature get announced on stage but it's a very different feeling seeing fundamental parts of a photo that you've just taken being changed like this the ability to erase people to move people and the sky swapping I've seen phones that can swap Skies before but not like this this is genu genuinely jaw-droppingly realistic and more importantly it's all presented in a package that basically anyone can understand and use okay now with all of that in mind here is where we talk about the drawbacks for starters all of this generative AI stuff for anything that has to like use AI to create something so things like the AI wallpaper making and the magic editor they need a permanent internet connection because every action you take needs to be passed through Google servers plus for magic editor your photos also have to be backed up to your Google account before it's willing to even try and process them and that means is while definitely impressive this whole process is nowhere near as seamless as it was painted out to be Google actually showed us this demo on stage of a lady in front of a waterfall they showed how easy it would be to just erase people in the background get rid of her shoulder strap pick her up move her around the image and then swap out the sky what an insane demo but the reality is quite different and to show my point I downloaded the same image and this is what it's actually like the phone will sometimes struggle to identify what counts as a person in the background and so it's fiddly to select there's a lot of waiting time in between each action like just to erase one set of people it's a whole new loading screen and then for every like fourth or fifth action I take I keep getting this error that magic editor is unable to show results that might violate its terms which is very confusing given that this is literally the exact demo that Google gave now I don't want this to take away from the fact that what it's actually doing is amazing but it just feels so sluggish that you're constantly reminded of how it's not running on device it doesn't feel like your phone is doing this processing and the power is in your hands it very much feels like you've just got access to a login to an AI website that's doing it on your phone's behalf and it's not just the cloud editing that feels slow the entire editing Suite on this phone it chugs and it really makes you realize that the tensor G3 chip inside this phone is not quite Flagship level it leans very heavily on the AI aspect to be able to do some of these really cool pixel things but the raw power especially the graphics power is lacking I think of this like a more modern version of like the Apple A14 chip from 3 years ago in terms of its ability to play games and because it's got less computational power it's less good at general computing so basically any task that Google hasn't specifically optimized it for will naturally happen a bit slower than it would on the competition the phones just generally are not the most stable like sometimes the screen has stopped responding and apps have just randomly bugged out and then there's the thermals two times while I've been using the pixel 8 Pro for prolonged periods of time one while I was doing lots of video samples and one while I was using it as a hot spot that's a fun bit of irony this phone has gotten hot and when it gets hot everything has lagged like the camera feed for example has just become really choppy and you just know that the phone is screaming for you to stop so those are the major problems I faced then we've got a whole load of minor ones so signal signal and core quality of my experience has been pretty good but not the best signal is the one thing that's very hard to scientifically test just because of how many variables there are but it's felt like it's dropped more often than my iPhone 15 Pro when I'm hotspotting which I do a lot of and it looks like why that is is that Google is not using the latest and greatest 5G mod modem in these phones they're using a revised version of an older modem I spent ages trying to get some of the new Google Assistant features to work like the ability to now ask Google's B AI much more complex questions the new upgraded call screening features and the ability to summarize internet Pages for you only to realize that they're actually not available in my country yet they're Us exclusive for the foreseeable future which was not communicated very clearly at all the face unlock is good when it works but it's just not as secure as face ID on the iPhone and also needs to be quite a bit closer to your face as it's not using infrared or anything it's basically just taking a photo and the fingerprint scanner has been completely fine there's no problem but it's just slower than some other phones using more advanced Teck okay that's a lot of stuff now just before we bring it together screens and battery so the screens are actually both great and it feels like they've made sensible compromises on the Bas 8 such that it doesn't feel like you're missing much they're both 120 HZ very bright screens the 8 Pro is actually meant to go even brighter but honestly I can't tell the difference they're both good the bass pixel 7 had a pretty noticeable chin on it it it was no American Dad but you know you could tell the bass pixel 8 it still has a bit of a chin on it but it's trimmed down it's subtle enough now that you can decide not to notice it the 8 Pro is higher resolution than the 8 but by default actually comes set to a slightly lower resolution just below 1080p which is quite unusual but honestly sharp enough that I've not really noticed or felt like I needed to bump it up the pro also has slightly stronger glass and the final perk is that while both phones can dial their refresh rate up to 120 HZ this can go down to 1 HZ whereas this and when you go down to 60 HZ and this does make a bit of a difference to battery I'm relieved to say that finally the pixel 8 Pro feels like a pro for battery life like 7 to 8 hours of screen on time has been a pretty normal thing for me to reach but the Counterpoint to that is that the Basse pixel is a decent amount behind it's fine battery life for someone who's generally a bit hands-off with their phone but for me the normal pixel 8 has been just about enough to get through the day but to the point where I'm getting back to my charger in the evening with a trickle of sweat running down my forehead one new feature that really does help though is this new focus on battery estimations of it being less about specifically what percentage you're on and more about if you continue in the app that you're in with your current levels of power draw exactly what time you will run out okay so should you buy the pixel 8 and the pixel 8 Pro and should you be enjoying this video then a sub to the channel would be appreci 8 it I really want to say yes no phone has convinced me of the AI future that we're moving towards more than these two right here they are exceptionally smart but just a little too much in a way that makes it feel like a concept phone a phone with a set of really cool really powerful specific highlights that genuinely do feel like a glimpse into the future but then slight neglect when it comes to the more simple things like signal and video quality and thermals not to mention just far too much being left in the hands of what's coming soon what's not available yet there's actually a lot more of that that I've not even covered in this video like Zoom inhance that can improve what photos look like when you crop into them after capture improve Magic Eraser performance etc etc etc but at the same time I do think these phones have such a high potential ceiling that I do want to give them the chance to see if they can actually get there so I would say this let's let them sit for 3 months and then let's see if we get to the fixes that we need and then I'll either make a full update video here on YouTube or I'll do a Twitter thread so be sure to be following on there and I will catch you in the next one"
        },
        {
            "id": "EGkGRs6YhoM",
            "title": "Google Pixel 9/Pro Review: Gimmick or Good?",
            "description": "Pixel 9 and Pixel 9 Pro are full of AI and wrapped in premium build. What a gift. Explore the full Anker Prime lineup and get the ...",
            "views": "3971439",
            "likes": "135148",
            "transcript": "- So I really like these new Pixel phones. New designs this year, obviously, but also new specs, new features, also new issues, but of\ncourse, new price tags, so we really gotta jump\ninto the nitty gritty of what's actually good about them. (upbeat music) (upbeat music continues) (upbeat music continues) So we've been hoping for a real, complete, flagship quality competitor\nfrom Google for a while now. And on one hand, it feels\nlike we finally got 'em, but on the other hand... Did you guys watch the Google\nevent announcing these things? Like, I feel like you\ncan learn a lot about how a company really feels about the products that they're presenting by just watching the announcement event, and these felt like a software showcase that just also happened to\nhave some phones to go with it. Which I guess is not insane when you know the history\nof Nexus and Pixel, but it did the opposite of giving me confidence in these phones. But now I've been using these\nphones for two weeks straight, and I actually feel like I can tell you what's good or bad about them. (upbeat music) So, hardware is mostly\nwhat I'm talking about when I say these phones feel\nlike flagships, in a good way. Like, it would be easy to dismiss them as almost the same as last\nyear just squared up, but there are a lot of\nother little things too. Like, the screens are brighter\nat their max brightness, 2,700 nits for the Pixel 9\nand 3,000 nits for the 9 Pros, and then the even bezels\nall the way around, that requires some extra consideration, wrapping the edges of the OLED\npanels under those corners. And there's a new ultrasonic\nfingerprint reader under here on all of them, finally. It's way faster and more reliable than the disappointing\noptical ones from before. The only thing I wish, and\nit's such a small thing, but I wish I could just unlock at any time when the display is completely off. Like, currently, you have to\nhave the always on display on, or hit the power button or\nbe getting a notification, and then you can unlock\nwith a quick touch. But like on Samsung phones, that spot on the display is\nalways a hotspot no matter what, you can just unlock by touching there, so I kind of wish the Pixel would let me do that from a blank screen, too. The haptics are really nice again, and the buttons are\nreally clicky this year. (buttons clicking) But then of course, the hardware is what's on the inside too, so that is the new Tensor G4 chip, and a bunch of extra RAM. Now, the Tensor G4 isn't actually that much more powerful\nthan last year's chip, in fact, you probably\nwon't notice a difference for 99% of the stuff you do on the phone, but what's actually\nsignificant is a new NPU that's way more powerful\nand dedicated to AI tasks, and the way more RAM is\nalso dedicated to AI tasks. I'm told a big portion of the RAM is literally reserved for AI stuff. So I will get to all that AI\nstuff in a minute, don't worry. But just in the world\nthat we're living in, where the meta for a lot of\nthese major new smartphones is, okay, minor new\nimprovements here and there, but mainly just a bunch of new\nAI features and capabilities, I'm glad that the Pixel also got a bunch of meaningful\nfeeling hardware stuff, too. And then obviously, yes, you\ndo have the squared off sides that I just know are supposed to fit in with the iPhones and\nSamsungs of the world. I've said it before, I\nlike the look and feel, and that also applies to\nthis new camera visor, which is less of a visor and I guess more of\nlike a shelf island now. Kind of looks a bit weird in some renders, but you just kind of have to trust me, seeing it in person, it's fire. I like it. Even if it will totally collect\ndust in just the same way as the last year in\nthe corners, it's nice. Oh, and I almost forgot,\nthere is a new size, so you can have a Pro phone,\nbut without it being an XL. Love the choice. I am a little worried that that one probably won't sell as\nwell as the two extremes, but I'm just, I'm glad we\nhave the choice this year. Be happy about it before\nit gets discontinued. So anyway, it all sounds pretty good, but I do have a few gripes, which I'm allowed to, it's $1,000. So, the size of the batteries is about the same as last year, 4,700 milliamp-hours in\nthe smaller size ones, 5,000 milliamp-hours in the big phone, and I've had pretty good battery life, like, A minus battery life with the XL. Consistently five plus\nhours of screen on time, lots of heavy, high brightness use. But they still don't charge that fast. Like, the XL is maxing\nout at like 37 watts, and it's actually slightly\nslower on the smaller phones. Now, I'm not saying you\ngotta go thermonuclear level, Realme, 320 watt fast charging,\nlight your phone on fire charging speeds or anything like that, I'm just saying fast\ncharging would be nice. 50, 60 watts, that's it. I feel like that's just not that insane but would be significantly\nbetter for using the phone. Now, I also need to say, Pixel 9 has matte sides with glossy back, but the Pixel 9 Pro has glossy\nsides with the matte back. We've seen this strategy before. I just think the matte sides look and feel so much better than the glossy, so I kind of wish you could\nget like a matte on matte look, but that's just me. And then one more thing, of course, these phones start at higher prices, or at least the base one starts at 799, but this is a $1,000 phone that starts at 128 gigs of storage. Thanks, Apple. I guess\nthat's the standard now, too. But it's 2024. I would've\nliked, you know, 256 to start. (upbeat music) So cameras have always been a big part of the Google phone experience, or at least they have for a while now, and on Pixel 9s, that's still true, but not in exactly the same way. So, all across the board,\nthe Pixel 9 and 9 Pro actually share the same primary camera and the same ultra wide. The Pros just get that extra\ntelephoto, the 5X zoom. And the primary camera that they all share is basically the same as last year. The ultra wide is new, it's\n48 megapixels instead of 12, but it bends down to 12. So, look, shooting with these new cameras, it's great, it's a quick\nsmartphone camera app, there's a bunch of easy to use modes, it's responsive, focuses quick, it's easy to get consistent good pictures\nthat process pretty quickly. What I mostly notice about these photos is they still look very processed to me. Like, this is the Pixel\nlook now these days, with the last few\ngenerations, just lots of HDR, lots of contrast, lots of dynamic range. Also, lots of sharpening. It's just not as natural of a look as we've seen in some others. It's just more on the punchy side. Which is honestly great\nfor just sharing a photo on social media, but some may\nprefer a more neutral photo. The new selfie camera on the Pro actually feels like\nthe biggest improvement as far as detail and color\nover the regular Pixel 9, which doesn't get this, but I'd say this is a pretty nice selfie camera, just so much dynamic range. But if you wanna see and\nhear what video footage from the Pixel sounds like,\nI shot an entire video on the auto focus channel\non the Pixel 9 Pro XL in 4K30 with, actually,\nno external hardware. I didn't even plug in a mic.\nThis is just the built-in mics. So yeah, just me holding a phone. If you don't zoom in at\nall, the videos look great. They're sharp, but obviously\nstill very processed, and you can see it, like,\nprioritizing segmentation and, like, lighting on my face\nand shifting colors around. So, I'll leave a link below\nif you wanna watch that whole eSprinter review when it goes live. And you might as well subscribe over there while you're at it for other car videos. But this is all part of\nthe Pixel experience. Just like, they're still\ntuning these cameras, they may end up looking a little\nmore natural in the future, even though it's been a generation. That's one of the things that\nyou can get outta this phone, but also, when they present these things, it's all about the features, the smarts, the crazy AI magic editor and all this AI stuff on these phones. There's a lot to the Pixel experience. (upbeat music) So, Google makes Android, Google makes their own Android phone, therefore the Google\nAndroid phone should be the vessel for showing off the latest and greatest from Android, right? I mean, Android 15 preview\njust got shown off in February. It's coming out by the end of the year. These phones launch with Android 14. That's not a joke. All these Pixel 9s are running the second latest version\nof Android out the box. Obviously, they should\nbe first in line for 15, and then the seven years of\npromised software updates, but that's still hilarious. But every time I go back\nto using a Pixel, you know, I'm reminded of all this stuff that I miss when I use other phones. Like call screening. So good. I mean, I know Samsung kind of has like a janky Bixby version of it,\nbut it doesn't work as well. I've tried. The now playing feature also. that just kind of ambiently tells you what song is playing in the background wherever you're at, love it. And now there's all this new\nstuff that they're adding that also may or may not\nhook people to the Pixel. So, Call Notes is a\nnew one. Pretty useful. Summarizes phone call that\nyou're on with a recording. And the new Pixel Weather app. Originally, I wasn't gonna give\nthat much of a chance to it, but honestly, it's turned\nout to be just as good as basically any other Android\nweather app I've tried. So you can get to it by\ntapping the weather widget on the home screen, and it's\ngot this really pretty UI where you can rearrange the big tiles and put the ones you care\nmost about closer to the top. It doesn't let you change\nyour weather source, but I mean, I'm already\nnitpicking at a level that only weather nerds\nwill really care about. And they also threw in an updated\npanorama UI in the camera, and I don't know if\nanybody cares about this, but the temperature sensor in\nthe Pros works on people now. I don't know if you caught that. And it gives these live\ntemperature readings now as you move around an object. None of which is medical\nadvice, by the way. I'm actually impressed\nby Google's commitment to this particularly useless app. Like, Google, I know you get a lot of heat for killing things typically,\nbut I give you permission to stop working on the thermometer app. I think you've done it. But there's one thing that, again, if you watched Google's event, that is really supposed\nto stand the Pixel out from the rest of the world of smartphones, and that is because this\nis where Gemini lives. This is this deep, deep integration with Google's newest assistant here. Literally, the boot up\nanimation on this phone is the Google logo, and then it turns into the Gemini logo before it starts up. Like, these are basically Gemini phones, so let's talk about it. (upbeat music) So, ignoring the fact that Google has this horrible habit of rebranding\nand renaming things in the most confusing way\npossible, it seems clear that Gemini is the thing we\nshould be focusing on here. Like, there's a lot of\npressure on this little box to be as useful as possible. And it actually delivers. Like, I have found\nGemini to be very useful, and also rapidly improving\nover the past couple weeks and gaining new capabilities, and it's still, it's very conversational, it remembers context, it gets questions correct most of the time. It's good. I clearly need to do an\nupdated assistant battle, because the last one I did was with Google Assistant, not Gemini. But see, that's the weird thing. Google introduced this\nhuge, new Gemini assistant to everyone, but also, Google Assistant still exists alongside\nGemini on these phones, too. Like, it's two different assistants. Matter of fact, for a little while, Google Assistant was\nactually better than Gemini at a lot of things for what regular people were doing with it, because\nGemini couldn't set timers, it couldn't get directions to places, it couldn't do basic home controls. And so Google Assistant would be the thing that it would fall back on and that people would continue to use. It was confusing. Even now, on the Pixel 9, you can hold down the power button or swipe up from the\ncorner to get to Gemini, but the permanent Pixel home screen widget on everyone's phone, if\nyou tap that microphone, that's the old Google Assistant. But today, now, Gemini can\nactually set timers and alarms, and it can listen and tell you what song is playing in the background,\nwhen it couldn't before. And it can do home controls\nlike changing my Nest thermostat temperature and\nturning smart lights on. But for some weird reason, when it's doing all of\nthese new capabilities, it's showing me a little\nGoogle Assistant logo in the corner, as if to tell me, like, okay, it works, and we\nhave this new capability, but Gemini is doing this through\nthe old Google Assistant, which, why even tell me that? Just do the thing. So anyway, then also, in the settings, you'll be able to have\nthese Gemini extensions, which when you enable them, will let Gemini see more\ninto your actual life, like, through other apps like Google Docs and Drive and your calendar. And to me, that's really where\nit becomes the most useful. Like, I start asking it\nto find emails for me and tell me the traffic to my next calendar event and things like that. That is just like talking\nto a normal person, and it's super useful. But then Gemini Live gets into this slightly less comfortable sometimes, but also sometimes very useful, fully conversational mode with Gemini. So you just open it like\nthis, and let's full screen. So, okay, I've got this\nwasp nest in my studio, and I need to get rid of it. What do I do? - [Assistant] Wasps are pretty aggressive, so getting rid of the nest\nsafely is the priority. Do you know what kind of\nwasps are in the nest? That will help me figure out the best way to help you remove it. - I have no idea, but they're all really active all the time. - [Assistant] Okay, that makes sense. To start, it's best to try and figure out what kind of wasps you're dealing with. Are they yellow and black\nwith a narrow waist? If so, they're probably yellowjackets. Or are they more brown or\ngray with a wider waist? Those would be paper wasps. - You know what, I don't\nwanna get that close to 'em. How about I just find pest\ncontrol nearby? Can you do that? - [Assistant] Okay. - So this is all at the mercy\nof your internet connection and it not hallucinating and\ngetting everything right, but when it does, it's actually,\nit can be super useful. Especially when you have, like, a bunch of follow up\nquestions about something and you wanna just keep\ngoing, then it's less of a bunch of typing Google\nand just talking to it. It's fine. So I do think Gemini is actually\nreally good at this point. I will plan on doing a comparison to the new Siri, of course, probably ChatGPT, and probably some others in\nsome updated assistant battle. Feel free to get subscribed if you want to see that when it comes out. But as of right now, yeah,\nI'm a fan of what assistant, assistant, of what Gemini is doing. But the thing is you can do any of this with Gemini on any Android phone. Matter of fact, Google\nliterally demoed Gemini with a Galaxy S24 Ultra\nat their own event. Like, they didn't even try to hide it. So if that's not unique to Pixel and it's basically the Gemini phone, like, what's the point of all this new NPU power with the Tensor G4 and all this extra RAM\ndedicated to AI tasks, what exactly is that good for? Well, there are a bunch of other AI tasks. (upbeat music) So here's how I wanna go through these. There's a bunch of new AI\nfeatures on the Pixel 9s, and I wanna just sort of divide them into useful, meh, and gimmicks, based on my own experience with them over the past couple weeks. I've been trying 'em all, using 'em, putting 'em through their\npaces, and I have some thoughts. So, some of 'em are really good and add to the Pixel experience, and others, not that\ngreat, kind of overrated. So, under useful, I'm\nputting Gemini, of course, just the assistant overall. It's quick, it gets things right. Fine. Then I have Call Notes,\nVideo Boost, and Add Me. So, Video Boost actually seems to make a surprising difference at how good the video quality comes out of a Pixel and what you can get outta these. Call Notes is convenient,\nbecause if you have the guts to turn it on on a phone call, it can record everything, ingest it all, transcribe it, summarize it, and give you that after the phone call, which, it's just useful. And then Add Me. (chuckles) Oh, Add Me. Add Me is interesting. It's good, it works pretty well, I just, I'm not sure if people\nare going to actually use it or if they're gonna, like, try it once and then forget about it and\ngo back to taking selfies, but it does what it's supposed to. It's right there next\nto the portrait mode. It's easy to access in the camera. And so if you need to take a group shot and you actually have no\none to take it for you, this feature is genuinely useful. It just combines two pictures, and boom, everyone's now in the photo. In case you were wondering, yes, you can do Add Me with yourself, and yes, if you pixel peep, you can tell that it's not perfect every single time. There are fuzzy edges. Like, it's clearly using the\nbase frame from the first photo and then compositing in the last person. But in general, like, the fact that Google has leaned this far in and created a genuinely\nuseful feature out of thin air by just abandoning reality\nin the Pixel camera app, I guess, yeah, you gotta give 'em credit. It's just will people\nactually know to use this or will they just go back\nto taking, like, a selfie with everyone behind them so\nthey get everyone in the shot? I don't know. Only time will tell. So then there's meh, there's,\nlike, the okay stuff. So, I have the new weather\nsummaries in the new weather app. They're AI generated. So right at the top of the app there, it gives you some text to\ndescribe the day for you, so you don't have to look at all those confusing numbers underneath. Honestly, it's actually\nkind of useful sometimes. But is this really AI? Like, maybe the sentence\nstructure is coming from an LLM or something, I don't know, whatever. It's fine. It certainly didn't tell me about all this clouds coming in, probably\ngonna dump some rain and also ruin my lighting. But then Magic Editor got\nthis Reimagine feature that lets you highlight\nany part of an image and then enter some text to turn it into something\nelse completely different to have your photos\nlook like, I don't know, a fantasy land or something\nthat also never happened. It does outright refuse to do some of my more dramatic edits, like, it doesn't seem to\nwanna reimagine people ever, but it'll happily add\nobjects to the background or change the setting\nentirely, if you're into that. I don't know. What is a photo anyway? And then the last meh, but not least, or whatever, is the Screenshots app. Am I missing something here? I mean, I get the premise. You have some screenshots on\nyour phone that you've taken, where you want to save some\ncritical information in them, so they built a place where\nyou can organize 'em all into collections, which is convenient. You can search through them. You can have it remind\nyou at a certain date and time of a specific screenshot, and even link you back to the webpage that you took a screenshot of. And it makes all this\ninformation searchable. But I'm sitting here thinking, shouldn't this have been\nbuilt into Google Photos? Like, did you know that\nSamsung's Photos app already built in the smart linking to any website you take a screenshot of? I mean, don't get me wrong, it works. It does what it's supposed to. My theory is they're probably\ndoing slightly more analysis, more processing of all the bits of text and information in each photo than they would with the\nnormal Google Photos app, so that is what enables all\nthe indexing and everything. And then maybe if it goes well, they'll also bring all that\nto the Photos app, maybe? Or if it doesn't go well,\nthen they can kill it easily. I don't know, whatever. It's fine. That's not, though, as bad\nas my gimmicks section. So, Zoom Enhance. Have\nyou heard about this? There's a new edit\nfeature finally shipping in the Photos app that encourages\nyou to zoom all the way in on a photo and then let\nit do its Pixel magic, where it plays this whole animation like it's gonna reconstruct your photo and find some hidden details,\nbut it kind of never does. At the end of the day, all it does is sort of turn up the clarity filter and maybe add what feels\nlike some fake texture where it thinks there\nshould have been some. I'm not buying it. And then there's the Pixel Studio app, which is just this neat little app to generate new images\ncompletely on device. And again, what I'm not saying\nis that it doesn't work, it actually does work impressively well. In like three seconds on device, it can generate whatever you want. It's just that I don't... I guess I don't really see\na real genuine use for this other than just messing around. Which, hey, honestly, that's fine too. If you just wanna mess around and make a meatball sub with legs, then you got it. Knock yourself out. (upbeat music) So, before it starts pouring rain, the meta with new smartphones in 2024 is, you know, slight improvements\nacross the board, but then also some splashy new AI features that are only available on the newest one because the new chip\nand the new neural cores and it's just special for that reason. So, that's what's happening. And if you want, you could easily throw these new Pixels into that camp. But the reason you'd buy this phone is really just the same\nas ever for a Pixel. It's the smartest smartphone in the room, and it's now also in a piece\nof kind of nice hardware that's a pleasure to hold and use. And then there's a\nbunch of AI stuff on top that you can try and\neither take it or leave it. It's kind of just up to you if you wanna get a bunch\nof use outta that stuff or literally never touch it at all. I'm curious if you leave\na comment down below what sort of stuff you think you would use or buy the phone to use, or which stuff you don't think is that useful at all. At the end of the day, we'll\nhave to see how it ages, but I'm thinking Pixel 9 and 9 Pro is some of their finest work yet. Also, shout out to Anker\nfor sponsoring this video. Their new Anker Prime lineup\nis their most advanced multi-device fast\ncharger they've made yet. That includes three charging\nstations, one docking station, one wall charger, one power\nbank, and one new cable. So the two that stand out to me the most are the Anker Prime charging station and the Anker Prime power bank. The charging station is\nthis desktop accessory that can kick out 250 watts in total among its four USB C and two USB A ports, and then it has a\ndisplay that can show you how much power each port\nis drawing actively. And then it lets you\ncustomize charging priority on each port, so you can let\nit just sort of auto adjust and make the highest demanding items get the max charge that they can take. And then the power bank has a 9,600 milliamp-hour capacity, and there's two USB C ports on it, and up to 65 watts output from this thing. But it can also be a wall charger, too. So, that 1.3 inch\ndisplay is gonna show you how much battery you have left and how much power each of\nthose ports is outputting. So you can check 'em out, and the rest of the Anker Prime lineup, in the video description. But either way, that's been it. I got this in before the\npouring rain started, so I'm pretty proud of that. But let me know what you\nthink in the comments below. Talk to you guys in the next one. Peace. (upbeat music)"
        },
        {
            "id": "8Lb9023_D0A",
            "title": "Google Pixel 9 Pro Review - Redemption Time!?",
            "description": "Full review of the Google Pixel 9 Pro and Pro XL, including camera comparisons, all AI features, as well as a battery test and more ...",
            "views": "2170354",
            "likes": "86090",
            "transcript": "I have had a complicated relationship with the Google pixel phones over the years I've always said that at their very core these phones are special they have this beautifully animated friendly customizable software that's always capable of doing a few things so intelligent that they're practically indistinguishable from Magic but at the same time these phones make me rage because so far there's always been a blocker significant enough issues that distract you from being able to focus on that delightful software I've had build quality issues I've had overheating issues I've had signal issues inconsistent camera issues and just generally the phone's being quite a bit slower than the competition issues so that puts this new pixel 9 Pro and the 9 Pro XL which is the one I've been mainly using in a very interesting position they have a lot to prove but if they can prove it then I mean these could basically become my favorite phones ever so this is how the pixel 9 Pro and the pro XL come presented it's a pretty box but sadly it's also a pretty empty box you get the phone you get a cable and there's a Sim ejector somewhere in here well at least it makes my job quicker here's the thing though this is the best built pixel ever it feels almost exactly like an iPhone 15 Pro Max when you pick it up very similar Dimensions very similar flat sides with a slight curve and it's the same weight down to the gram I remember reading a post saying that way more of the people who buy pixels are actually X iPhone users as opposed to X Samsung so I'd be very surprised if this similarity wasn't intentional to even further entice Apple Fans who are still on the fence but either way I mean this as a compliment to the pixel the sides are grippier than their pass phones it looks and feels just really classy especially with these thinner completely even screen bezels and this is also easily the most solidly constructed phone Google has ever made it doesn't Flex one bit and if you haven't already seen it I'd say it very much passed the Jerry rig durability test I've kind of been getting the feeling over the last few years that the pixel would end up as yet another one of those canned Google projects you know the classic downward spiral where things aren't quite there with a tech product so then it doesn't sell well so then it makes less money so then it gets less investment and never improves because of that besides Google is specifically famous for cancelling projects but getting a significant redesign like this feels like a reassurance that Google is still very much kicking around Google is still determined to keep trying to become a definitive part of this Smartphone War and the more that you use this phone the more you realize why that's so important to them but I'll get there oh also I don't normally talk about cases but if you're going to make one this is how it's done this thing is addictively soft it shows up no fingerprints no light scratches it gently swoops around the camera module giving you this soft lip to rest your fingers against there's nice felt on the inside a metal logo and metal buttons which actually match the remaining visible part of the phone and the sprinkle on top is that the fit is perfect every single cutout is exactly centralized which well youd be surprised how often that doesn't happen and you know what design is not the only thing that's on the up here the optical fingerprint scanner that we used to have that was one of my major gripes this new pixel switches that out for an ultrasonic scanner it's basically firing out sound waves instead of light to map out The Ridges of your fingers but the upside of that is that it gives the phone basically a three-dimensional understanding of your prints so it's more reliable and you really feel that I haven't had any signal issues and while it's hard to say anything conclusive about signal because there's just so many factors I do a pretty regular 2 and 1/2 hour trip from Nottingham my hometown to London on the motorway and the signal is famously patchy on this though I was actually flitting between 4G and 5G almost the entire time with only two 5minute bursts of nothing so it's looking likely that the new modem on the inside of this pixel is doing its job the general feel of using the phone is it's Flawless it's the best honestly every single animation has an accompanying feeling generated by the vibration motor even things like a gentle hum as you slide up and down your brightness plus I've not had a single bug which low bar I realized but that automatically makes this the most stable pixel launch in history the battery is actually the battery is not charged so it's on 8% right now let's just plug it into our shiny new anchor Prime power station but yeah the battery life on these Pros is enough I wouldn't call it sparkling I'm talking 6 and 1/2 hours of screen on time on the smaller Pro and 7 on the XL Which is less than my Samsung but enough for almost anyone and it feels like Google's gained control of their overheating problem I mean the solution wasn't rocket science they just finally caught up and put a vapor chamber in the phone like their competitors have been doing for ages that has a lot of KnockOn effects it means that the screen which is bright and pretty Delicious By the way doesn't dim minutes after I take it out on a hot day the camera seems to record continuously without stuttering and games don't dramatically slow down with persistent play in fact I did whip out the good old 3D Mark extreme stress test to put some numbers to this feeling and found that while Galaxy s24 Ultra had 57% stability meaning that by the end of this 30 minute or so stress test it was only running at 57% of the performance it started with the pixel retained 71.7 now that's not the full story cuz while the pixel's stability score is higher its performance to start with is so much lower that even with more stability there isn't a single point in this test where it's better than the s24 ultra every year performance has been a classic pixel weakness that every year Google seems to to keep addressing by just slapping that AI Band-Aid on top and this new phone isn't completely free of that curse either the new tensor G4 chip that you find inside of the pixel9 pros it is still noticeably less fast than the chip inside the best from Samsung Apple OnePlus all of those companies top end phones make basically every action instant whereas the pixel still feels like it enjoys its thinking time you know little things like it taking just a split second for the full resolution image to load when you zoom into it and the phone's storage speed might have something to do with that too I ran multiple tests and the pixel comes out as significantly slower in terms of sequential read and write speeds than Samsung which would explain why it takes longer to load things and I'm just going to be brutally honest this disparity felt like an acceptable compromise when Google was charging $900 for a pro pixel but now we're at $1,100 it needs to get on that level that said in a way it's actually better than I thought it would be I was expecting gaming for example to be a flop but this is Zen Zone zero this is as difficult as mobile games get to run and I've played this for an hour at a time on absolutely maxed out settings with no issues apart from some slightly toasty side rails and also this chip combined with now 16 GB of RAM by default seems to drastically speed up AI tasks I'm talking like 50% faster than they used to be which was much needed one of the key things that got to me with last year's pixel 8s was how St the difference was between how easy and instant Google made AI photo editing look at their launch events versus the fiddly reality of it on the phones made many times worse by the 5 to 10c loading time in between every single action and so the fact that this stuff is so much faster here it already starts to alleviate my blood pressure as for all the new AI stuff they announced I'd say most of it feels a little half-baked which is a phrase I think I've used to describe every single AI phone this year but there are three things three things I absolutely love the thing that they spent most of the time talking about was this one called ad me where if you want to take a group shot but you don't want to ask someone to take the photo you can separately take each person's shot and Google software can merge them together into one and while I would say that is very impressive from a technical perspective I just don't think I'd ever use it I've never really had a situation where I've wanted to take a group shot and I haven't been able to find someone to take that shot and if you can find someone then that still feels like the better option to me cuz that way you don't have to do this little fiddle you don't have to take two separate shots you don't have the risk that it doesn't quite turn out the way you expected which as we all know there is a very decent chance of with any AI feature and also you know it's just that your end result then is a photo of a real moment which maybe I'm oldfashioned but I still think that counts for something there's a whole new app now for image generation called pixel Studio but to be honest while it can generate some pretty quick Nic looking images from scratch based on a prompt it's nothing new or better than what's out there it needs wi-fi even though it's supposedly running on device and when you want to use it to mess with photos you've already taken it's extremely limited and fiddly with the selection tool being practically dysfunctional and like what in Earth is this why are the two key options for your next Generation AI photo editing app to add a caption or add a sticker this would have been cool if we were still living in the year 2000 the phone's assistant is in a slightly weird place basically this phone's default assistant is Gemini Gemini is more heavily AI powered it's way smarter but it also seems to have a lot of limitations with how it can interact with your apps and also doesn't do some of the more basic things that Google Assistant used to do so it feels like we're at this pretty clumsy middle phase where you get both and you can switch between them depending on the feature set you want which makes me feel very much like a beta tester oh but the magic editor is starting to get pretty interesting though I was playing around yesterday with the feature that allows you to zoom out of a photo that's already been taken and I couldn't believe it like look at this shot I click the autof framing button and Bam it's understood that this wooden beam along the top has got to continue it's understood that there's an extra step here and it's estimated what it's likely to look like it's understood that the trees are thinning around here so when it zooms out it's making sure that you can see more of the sky there the idea of this feature isn't new the execution of it very much is and you can now reimagine photos which can actually be very powerful and very convincing I remember my jaw practically hitting a floor when I managed to change my cat into a dog I mean what the Google the only thing I would say is it's a real hit to the features usefulness that you can't use it on shots of people there's a new pixel screenshots app which also falls into the category of pretty good I actually think it's great that there's a separate app to manage screenshots cuz the reasons that I want to find screenshots are always very different to the reasons that I might want to browse my gallery and while what the app does is not distinctly different to what most phones can already do by allowing you to search for things within your screenshots it is one layer more intelligent because your phone can not just look at the specific info in the screenshots but also use AI to take one step back and understand what the screenshot is meaning you're way more likely to be able to find it based on a Vaga description the first thing that I absolutely love though is Gemini live it's it's basically the AI that you're used to but in a much more free flowing way than I think we've ever experienced you talk you listen you can talk over the AI there are no trigger buttons or trigger words it allows you to have something that very closely resembles a real human conversation let's do a little live demo I'm debating between going for an Android phone or an iPhone I'm a simple person what would you recommend okay choosing between Android and iPhone can be tough iPhones are known for being really userfriendly and straightforward they're a good choice if you want a phone that's easy to set up and just works all right then Google thank you U but what I also like about it is that when you wanted to stop talking you don't need to say anything or do anything you just say what you want to say and it will slowly reduce its own volume and listen and I actually think that makes it a really powerful tool because it becomes like a a live bouncing board like I was chatting to it last night I said I'm going to have some people over what could I do for dinner that's a bit different it said why don't you theme it I was like great idea we chatted for another 3 to 4 minutes and by the end of it I had a complete menu plan for my Pokémon themed dinner including the salad I would use to represent grass types and the spicy curry I'd use to repres present fire types now as for the other two AI features that I think are amazing they're both within the camera so let's talk cameras the rear set of cameras have almost identical Hardware to last year's phone so that's a 50 map main 48 map Ultra wide and then a 48 map five times optical zoom and so it's probably not shocking news to learn that the base quality of photos feels not that different from last year so that means good color reproduction a very strong ability to handle High dynamic range scenarios and control those bright spots very comparable levels of detail to Samsung's highest end Galaxy s24 Ultra but then a night mode that's good but just a little softer than Samsung's and a portrait mode that I think it's fair to say falls behind like look at the edge detection here versus the Galaxy it really gives itself away as a phone photo and upsettingly many of the frustrations I had with last year's phone are also still present here zooming in and out is still very laggy it makes it feel unpolished the camera preview can still get grainy even if the end photos are not the transition between lenses feels jumpy there's weird limitations like you can't use your five time zoom lens to take portraits nor can you use it for slowo with instead the phone opting for some very poor quality digital zoom and this really cool cinematic blur mode is 1080p only but the front camera is new this is now a 42 map sensor that's the reason for the Fairly large cutout and I'll take it it lets you go super wide if you want to get those group shots I don't think I've ever seen a phone go wider than this but also I was pleasantly surprised by the detail and you can also shoot some pretty solid 4K video because yes Google has put some work in to bring up the video quality on the pixels 2 and that leads me on to the AI feature video boost it's kind of strange but when you're taking video on this phone this only works on your rear cameras by the way you have the option to boost that video If you select the option then your phone will keep the footage largely unprocessed so that the next time you're on Wi-Fi it can upload it to the cloud and get Google's superpowered data centers to process it even better than your phone itself could it improves the colors the dynamic range the stabilization it can completely rescue grainy footage taken in low light which was one of the biggest weaknesses of past pixel phones it can even upgrade the resolution to 8K and it's one of those features that you feel like it shouldn't work it almost sounds like some kind of elaborate scam but but it does I guess you could say there is a hidden cost associated with it though cuz like if you want 8K video boosted content you're going to need a heck of a lot of cloud storage specifically Google Cloud Storage you'll need about 800 mb per minute of it and also you need to be very careful with this phone about joining other people's data hotspots cuz your phone will pick them up as Wi-Fi networks and before you know it you could have burnt through 10 gab of their data obliviously boosting your videos in the background without you even realizing I know this from personal experience doesn't make you popular but it's this kind of stuff that reminds you why Google never stops trying with the pixels cuz I mean like if this phone succeeds so do all of their services and not just Google photos but also their Gemini AI because this phone is the best possible portal through which to funnel people to them it's also very clear that this is why Google is like the only Company still shipping a top-of-the-line Pro phone starting with just 128 GB of onboard storage which to be honest combined with it costing a whole $100 extra just to get to 256 feels lowkey diabolical to me ah but then here is the other thing about this camera the zoom Zoom see the big tin super res Zoom feature that pixels have is already good like when you zoom in 30 times and you take the shot a surprising amount of improvement is made after that capture to the point where I would say the pixel's long-range Zoom shots are already 95% as good as those on Samsung's s24 Ultra and that's one of that phone's key selling points but then add in the new Zoom enhance AI feature on top of that and Samsung gets absolutely murdered now this obviously does open a can of worms cuz what Google is doing here is inventing detail it's not completely consistent and it's perfectly possible that this texture it's creating isn't completely real so is it actually the better zoom camera I guess that's up to you but which image would I rather have that's pretty clear it's the Google the final thing I would add about cameras is the very underrated panorama mode this is the best phone for taking panoramas it makes them really easy to take they're super detailed and each photo is stitched together extremely seamlessly okay so is this phone good yes it is the pixel 9 Pro either improves upon or completely fixes about 70% of my issues with past pixels everything from cameras to Performance to AI it does that with classic Google perks like this joyous software and 7 years of Android updates with then extras that I didn't even know I wanted like this big redesign or well actually forget the redesign look at this case I really like this thing the key cons are just well you're basically paying $1,200 for the XL model cuz no one wants a flagship phone with just 128 GB of storage and it's still not as fast as the competition okay it's been an hour and the phone is on 67% while I've been using it the whole time and you want to know why it's because of the new anchor Prime charging station the company has sponsoring this video but that doesn't change the fact that this is the new gold standard for a setup it's got a total output of 250 wats so 1 cable into here and this thing can happily charge your laptop three phones and two other gadgets all at full speed plus it's got a 2.26 in LCD interactive charging display which gives you immediate updates on charging status and speed but there is more there's a new fusion power bank which is so cool because this is basically a full-on wall charger and then as soon as you want to go somewhere you automatically have a fully charged 9,600 mAh battery pad not to mention the docking station which is this absolutely ridiculous 14 in1 charging and data transfer solution you can turn a desk like this into a desk like this with one of these this stuff right here is no exaggeration currently the top contenders for what we're going to be kitting out are next gen studio with so check out the full anchor Prime lineup in the link below"
        },
        {
            "id": "zCRpV1p9kfs",
            "title": "Unboxing the new Mint Pixel 8 and 8 Pro #Pixel8 #Google #ASMR #TeamPixel",
            "description": "",
            "views": "5911289",
            "likes": "172609",
            "transcript": "[UNBOXING SOUNDS]"
        }
    ]
}