{
    "pixel phone reviews": [
        {
            "id": "EGkGRs6YhoM",
            "title": "Google Pixel 9/Pro Review: Gimmick or Good?",
            "description": "Pixel 9 and Pixel 9 Pro are full of AI and wrapped in premium build. What a gift. Explore the full Anker Prime lineup and get the ...",
            "views": "3971439",
            "likes": "135148",
            "transcript": "- So I really like these new Pixel phones. New designs this year, obviously, but also new specs, new features, also new issues, but of\ncourse, new price tags, so we really gotta jump\ninto the nitty gritty of what's actually good about them. (upbeat music) (upbeat music continues) (upbeat music continues) So we've been hoping for a real, complete, flagship quality competitor\nfrom Google for a while now. And on one hand, it feels\nlike we finally got 'em, but on the other hand... Did you guys watch the Google\nevent announcing these things? Like, I feel like you\ncan learn a lot about how a company really feels about the products that they're presenting by just watching the announcement event, and these felt like a software showcase that just also happened to\nhave some phones to go with it. Which I guess is not insane when you know the history\nof Nexus and Pixel, but it did the opposite of giving me confidence in these phones. But now I've been using these\nphones for two weeks straight, and I actually feel like I can tell you what's good or bad about them. (upbeat music) So, hardware is mostly\nwhat I'm talking about when I say these phones feel\nlike flagships, in a good way. Like, it would be easy to dismiss them as almost the same as last\nyear just squared up, but there are a lot of\nother little things too. Like, the screens are brighter\nat their max brightness, 2,700 nits for the Pixel 9\nand 3,000 nits for the 9 Pros, and then the even bezels\nall the way around, that requires some extra consideration, wrapping the edges of the OLED\npanels under those corners. And there's a new ultrasonic\nfingerprint reader under here on all of them, finally. It's way faster and more reliable than the disappointing\noptical ones from before. The only thing I wish, and\nit's such a small thing, but I wish I could just unlock at any time when the display is completely off. Like, currently, you have to\nhave the always on display on, or hit the power button or\nbe getting a notification, and then you can unlock\nwith a quick touch. But like on Samsung phones, that spot on the display is\nalways a hotspot no matter what, you can just unlock by touching there, so I kind of wish the Pixel would let me do that from a blank screen, too. The haptics are really nice again, and the buttons are\nreally clicky this year. (buttons clicking) But then of course, the hardware is what's on the inside too, so that is the new Tensor G4 chip, and a bunch of extra RAM. Now, the Tensor G4 isn't actually that much more powerful\nthan last year's chip, in fact, you probably\nwon't notice a difference for 99% of the stuff you do on the phone, but what's actually\nsignificant is a new NPU that's way more powerful\nand dedicated to AI tasks, and the way more RAM is\nalso dedicated to AI tasks. I'm told a big portion of the RAM is literally reserved for AI stuff. So I will get to all that AI\nstuff in a minute, don't worry. But just in the world\nthat we're living in, where the meta for a lot of\nthese major new smartphones is, okay, minor new\nimprovements here and there, but mainly just a bunch of new\nAI features and capabilities, I'm glad that the Pixel also got a bunch of meaningful\nfeeling hardware stuff, too. And then obviously, yes, you\ndo have the squared off sides that I just know are supposed to fit in with the iPhones and\nSamsungs of the world. I've said it before, I\nlike the look and feel, and that also applies to\nthis new camera visor, which is less of a visor and I guess more of\nlike a shelf island now. Kind of looks a bit weird in some renders, but you just kind of have to trust me, seeing it in person, it's fire. I like it. Even if it will totally collect\ndust in just the same way as the last year in\nthe corners, it's nice. Oh, and I almost forgot,\nthere is a new size, so you can have a Pro phone,\nbut without it being an XL. Love the choice. I am a little worried that that one probably won't sell as\nwell as the two extremes, but I'm just, I'm glad we\nhave the choice this year. Be happy about it before\nit gets discontinued. So anyway, it all sounds pretty good, but I do have a few gripes, which I'm allowed to, it's $1,000. So, the size of the batteries is about the same as last year, 4,700 milliamp-hours in\nthe smaller size ones, 5,000 milliamp-hours in the big phone, and I've had pretty good battery life, like, A minus battery life with the XL. Consistently five plus\nhours of screen on time, lots of heavy, high brightness use. But they still don't charge that fast. Like, the XL is maxing\nout at like 37 watts, and it's actually slightly\nslower on the smaller phones. Now, I'm not saying you\ngotta go thermonuclear level, Realme, 320 watt fast charging,\nlight your phone on fire charging speeds or anything like that, I'm just saying fast\ncharging would be nice. 50, 60 watts, that's it. I feel like that's just not that insane but would be significantly\nbetter for using the phone. Now, I also need to say, Pixel 9 has matte sides with glossy back, but the Pixel 9 Pro has glossy\nsides with the matte back. We've seen this strategy before. I just think the matte sides look and feel so much better than the glossy, so I kind of wish you could\nget like a matte on matte look, but that's just me. And then one more thing, of course, these phones start at higher prices, or at least the base one starts at 799, but this is a $1,000 phone that starts at 128 gigs of storage. Thanks, Apple. I guess\nthat's the standard now, too. But it's 2024. I would've\nliked, you know, 256 to start. (upbeat music) So cameras have always been a big part of the Google phone experience, or at least they have for a while now, and on Pixel 9s, that's still true, but not in exactly the same way. So, all across the board,\nthe Pixel 9 and 9 Pro actually share the same primary camera and the same ultra wide. The Pros just get that extra\ntelephoto, the 5X zoom. And the primary camera that they all share is basically the same as last year. The ultra wide is new, it's\n48 megapixels instead of 12, but it bends down to 12. So, look, shooting with these new cameras, it's great, it's a quick\nsmartphone camera app, there's a bunch of easy to use modes, it's responsive, focuses quick, it's easy to get consistent good pictures\nthat process pretty quickly. What I mostly notice about these photos is they still look very processed to me. Like, this is the Pixel\nlook now these days, with the last few\ngenerations, just lots of HDR, lots of contrast, lots of dynamic range. Also, lots of sharpening. It's just not as natural of a look as we've seen in some others. It's just more on the punchy side. Which is honestly great\nfor just sharing a photo on social media, but some may\nprefer a more neutral photo. The new selfie camera on the Pro actually feels like\nthe biggest improvement as far as detail and color\nover the regular Pixel 9, which doesn't get this, but I'd say this is a pretty nice selfie camera, just so much dynamic range. But if you wanna see and\nhear what video footage from the Pixel sounds like,\nI shot an entire video on the auto focus channel\non the Pixel 9 Pro XL in 4K30 with, actually,\nno external hardware. I didn't even plug in a mic.\nThis is just the built-in mics. So yeah, just me holding a phone. If you don't zoom in at\nall, the videos look great. They're sharp, but obviously\nstill very processed, and you can see it, like,\nprioritizing segmentation and, like, lighting on my face\nand shifting colors around. So, I'll leave a link below\nif you wanna watch that whole eSprinter review when it goes live. And you might as well subscribe over there while you're at it for other car videos. But this is all part of\nthe Pixel experience. Just like, they're still\ntuning these cameras, they may end up looking a little\nmore natural in the future, even though it's been a generation. That's one of the things that\nyou can get outta this phone, but also, when they present these things, it's all about the features, the smarts, the crazy AI magic editor and all this AI stuff on these phones. There's a lot to the Pixel experience. (upbeat music) So, Google makes Android, Google makes their own Android phone, therefore the Google\nAndroid phone should be the vessel for showing off the latest and greatest from Android, right? I mean, Android 15 preview\njust got shown off in February. It's coming out by the end of the year. These phones launch with Android 14. That's not a joke. All these Pixel 9s are running the second latest version\nof Android out the box. Obviously, they should\nbe first in line for 15, and then the seven years of\npromised software updates, but that's still hilarious. But every time I go back\nto using a Pixel, you know, I'm reminded of all this stuff that I miss when I use other phones. Like call screening. So good. I mean, I know Samsung kind of has like a janky Bixby version of it,\nbut it doesn't work as well. I've tried. The now playing feature also. that just kind of ambiently tells you what song is playing in the background wherever you're at, love it. And now there's all this new\nstuff that they're adding that also may or may not\nhook people to the Pixel. So, Call Notes is a\nnew one. Pretty useful. Summarizes phone call that\nyou're on with a recording. And the new Pixel Weather app. Originally, I wasn't gonna give\nthat much of a chance to it, but honestly, it's turned\nout to be just as good as basically any other Android\nweather app I've tried. So you can get to it by\ntapping the weather widget on the home screen, and it's\ngot this really pretty UI where you can rearrange the big tiles and put the ones you care\nmost about closer to the top. It doesn't let you change\nyour weather source, but I mean, I'm already\nnitpicking at a level that only weather nerds\nwill really care about. And they also threw in an updated\npanorama UI in the camera, and I don't know if\nanybody cares about this, but the temperature sensor in\nthe Pros works on people now. I don't know if you caught that. And it gives these live\ntemperature readings now as you move around an object. None of which is medical\nadvice, by the way. I'm actually impressed\nby Google's commitment to this particularly useless app. Like, Google, I know you get a lot of heat for killing things typically,\nbut I give you permission to stop working on the thermometer app. I think you've done it. But there's one thing that, again, if you watched Google's event, that is really supposed\nto stand the Pixel out from the rest of the world of smartphones, and that is because this\nis where Gemini lives. This is this deep, deep integration with Google's newest assistant here. Literally, the boot up\nanimation on this phone is the Google logo, and then it turns into the Gemini logo before it starts up. Like, these are basically Gemini phones, so let's talk about it. (upbeat music) So, ignoring the fact that Google has this horrible habit of rebranding\nand renaming things in the most confusing way\npossible, it seems clear that Gemini is the thing we\nshould be focusing on here. Like, there's a lot of\npressure on this little box to be as useful as possible. And it actually delivers. Like, I have found\nGemini to be very useful, and also rapidly improving\nover the past couple weeks and gaining new capabilities, and it's still, it's very conversational, it remembers context, it gets questions correct most of the time. It's good. I clearly need to do an\nupdated assistant battle, because the last one I did was with Google Assistant, not Gemini. But see, that's the weird thing. Google introduced this\nhuge, new Gemini assistant to everyone, but also, Google Assistant still exists alongside\nGemini on these phones, too. Like, it's two different assistants. Matter of fact, for a little while, Google Assistant was\nactually better than Gemini at a lot of things for what regular people were doing with it, because\nGemini couldn't set timers, it couldn't get directions to places, it couldn't do basic home controls. And so Google Assistant would be the thing that it would fall back on and that people would continue to use. It was confusing. Even now, on the Pixel 9, you can hold down the power button or swipe up from the\ncorner to get to Gemini, but the permanent Pixel home screen widget on everyone's phone, if\nyou tap that microphone, that's the old Google Assistant. But today, now, Gemini can\nactually set timers and alarms, and it can listen and tell you what song is playing in the background,\nwhen it couldn't before. And it can do home controls\nlike changing my Nest thermostat temperature and\nturning smart lights on. But for some weird reason, when it's doing all of\nthese new capabilities, it's showing me a little\nGoogle Assistant logo in the corner, as if to tell me, like, okay, it works, and we\nhave this new capability, but Gemini is doing this through\nthe old Google Assistant, which, why even tell me that? Just do the thing. So anyway, then also, in the settings, you'll be able to have\nthese Gemini extensions, which when you enable them, will let Gemini see more\ninto your actual life, like, through other apps like Google Docs and Drive and your calendar. And to me, that's really where\nit becomes the most useful. Like, I start asking it\nto find emails for me and tell me the traffic to my next calendar event and things like that. That is just like talking\nto a normal person, and it's super useful. But then Gemini Live gets into this slightly less comfortable sometimes, but also sometimes very useful, fully conversational mode with Gemini. So you just open it like\nthis, and let's full screen. So, okay, I've got this\nwasp nest in my studio, and I need to get rid of it. What do I do? - [Assistant] Wasps are pretty aggressive, so getting rid of the nest\nsafely is the priority. Do you know what kind of\nwasps are in the nest? That will help me figure out the best way to help you remove it. - I have no idea, but they're all really active all the time. - [Assistant] Okay, that makes sense. To start, it's best to try and figure out what kind of wasps you're dealing with. Are they yellow and black\nwith a narrow waist? If so, they're probably yellowjackets. Or are they more brown or\ngray with a wider waist? Those would be paper wasps. - You know what, I don't\nwanna get that close to 'em. How about I just find pest\ncontrol nearby? Can you do that? - [Assistant] Okay. - So this is all at the mercy\nof your internet connection and it not hallucinating and\ngetting everything right, but when it does, it's actually,\nit can be super useful. Especially when you have, like, a bunch of follow up\nquestions about something and you wanna just keep\ngoing, then it's less of a bunch of typing Google\nand just talking to it. It's fine. So I do think Gemini is actually\nreally good at this point. I will plan on doing a comparison to the new Siri, of course, probably ChatGPT, and probably some others in\nsome updated assistant battle. Feel free to get subscribed if you want to see that when it comes out. But as of right now, yeah,\nI'm a fan of what assistant, assistant, of what Gemini is doing. But the thing is you can do any of this with Gemini on any Android phone. Matter of fact, Google\nliterally demoed Gemini with a Galaxy S24 Ultra\nat their own event. Like, they didn't even try to hide it. So if that's not unique to Pixel and it's basically the Gemini phone, like, what's the point of all this new NPU power with the Tensor G4 and all this extra RAM\ndedicated to AI tasks, what exactly is that good for? Well, there are a bunch of other AI tasks. (upbeat music) So here's how I wanna go through these. There's a bunch of new AI\nfeatures on the Pixel 9s, and I wanna just sort of divide them into useful, meh, and gimmicks, based on my own experience with them over the past couple weeks. I've been trying 'em all, using 'em, putting 'em through their\npaces, and I have some thoughts. So, some of 'em are really good and add to the Pixel experience, and others, not that\ngreat, kind of overrated. So, under useful, I'm\nputting Gemini, of course, just the assistant overall. It's quick, it gets things right. Fine. Then I have Call Notes,\nVideo Boost, and Add Me. So, Video Boost actually seems to make a surprising difference at how good the video quality comes out of a Pixel and what you can get outta these. Call Notes is convenient,\nbecause if you have the guts to turn it on on a phone call, it can record everything, ingest it all, transcribe it, summarize it, and give you that after the phone call, which, it's just useful. And then Add Me. (chuckles) Oh, Add Me. Add Me is interesting. It's good, it works pretty well, I just, I'm not sure if people\nare going to actually use it or if they're gonna, like, try it once and then forget about it and\ngo back to taking selfies, but it does what it's supposed to. It's right there next\nto the portrait mode. It's easy to access in the camera. And so if you need to take a group shot and you actually have no\none to take it for you, this feature is genuinely useful. It just combines two pictures, and boom, everyone's now in the photo. In case you were wondering, yes, you can do Add Me with yourself, and yes, if you pixel peep, you can tell that it's not perfect every single time. There are fuzzy edges. Like, it's clearly using the\nbase frame from the first photo and then compositing in the last person. But in general, like, the fact that Google has leaned this far in and created a genuinely\nuseful feature out of thin air by just abandoning reality\nin the Pixel camera app, I guess, yeah, you gotta give 'em credit. It's just will people\nactually know to use this or will they just go back\nto taking, like, a selfie with everyone behind them so\nthey get everyone in the shot? I don't know. Only time will tell. So then there's meh, there's,\nlike, the okay stuff. So, I have the new weather\nsummaries in the new weather app. They're AI generated. So right at the top of the app there, it gives you some text to\ndescribe the day for you, so you don't have to look at all those confusing numbers underneath. Honestly, it's actually\nkind of useful sometimes. But is this really AI? Like, maybe the sentence\nstructure is coming from an LLM or something, I don't know, whatever. It's fine. It certainly didn't tell me about all this clouds coming in, probably\ngonna dump some rain and also ruin my lighting. But then Magic Editor got\nthis Reimagine feature that lets you highlight\nany part of an image and then enter some text to turn it into something\nelse completely different to have your photos\nlook like, I don't know, a fantasy land or something\nthat also never happened. It does outright refuse to do some of my more dramatic edits, like, it doesn't seem to\nwanna reimagine people ever, but it'll happily add\nobjects to the background or change the setting\nentirely, if you're into that. I don't know. What is a photo anyway? And then the last meh, but not least, or whatever, is the Screenshots app. Am I missing something here? I mean, I get the premise. You have some screenshots on\nyour phone that you've taken, where you want to save some\ncritical information in them, so they built a place where\nyou can organize 'em all into collections, which is convenient. You can search through them. You can have it remind\nyou at a certain date and time of a specific screenshot, and even link you back to the webpage that you took a screenshot of. And it makes all this\ninformation searchable. But I'm sitting here thinking, shouldn't this have been\nbuilt into Google Photos? Like, did you know that\nSamsung's Photos app already built in the smart linking to any website you take a screenshot of? I mean, don't get me wrong, it works. It does what it's supposed to. My theory is they're probably\ndoing slightly more analysis, more processing of all the bits of text and information in each photo than they would with the\nnormal Google Photos app, so that is what enables all\nthe indexing and everything. And then maybe if it goes well, they'll also bring all that\nto the Photos app, maybe? Or if it doesn't go well,\nthen they can kill it easily. I don't know, whatever. It's fine. That's not, though, as bad\nas my gimmicks section. So, Zoom Enhance. Have\nyou heard about this? There's a new edit\nfeature finally shipping in the Photos app that encourages\nyou to zoom all the way in on a photo and then let\nit do its Pixel magic, where it plays this whole animation like it's gonna reconstruct your photo and find some hidden details,\nbut it kind of never does. At the end of the day, all it does is sort of turn up the clarity filter and maybe add what feels\nlike some fake texture where it thinks there\nshould have been some. I'm not buying it. And then there's the Pixel Studio app, which is just this neat little app to generate new images\ncompletely on device. And again, what I'm not saying\nis that it doesn't work, it actually does work impressively well. In like three seconds on device, it can generate whatever you want. It's just that I don't... I guess I don't really see\na real genuine use for this other than just messing around. Which, hey, honestly, that's fine too. If you just wanna mess around and make a meatball sub with legs, then you got it. Knock yourself out. (upbeat music) So, before it starts pouring rain, the meta with new smartphones in 2024 is, you know, slight improvements\nacross the board, but then also some splashy new AI features that are only available on the newest one because the new chip\nand the new neural cores and it's just special for that reason. So, that's what's happening. And if you want, you could easily throw these new Pixels into that camp. But the reason you'd buy this phone is really just the same\nas ever for a Pixel. It's the smartest smartphone in the room, and it's now also in a piece\nof kind of nice hardware that's a pleasure to hold and use. And then there's a\nbunch of AI stuff on top that you can try and\neither take it or leave it. It's kind of just up to you if you wanna get a bunch\nof use outta that stuff or literally never touch it at all. I'm curious if you leave\na comment down below what sort of stuff you think you would use or buy the phone to use, or which stuff you don't think is that useful at all. At the end of the day, we'll\nhave to see how it ages, but I'm thinking Pixel 9 and 9 Pro is some of their finest work yet. Also, shout out to Anker\nfor sponsoring this video. Their new Anker Prime lineup\nis their most advanced multi-device fast\ncharger they've made yet. That includes three charging\nstations, one docking station, one wall charger, one power\nbank, and one new cable. So the two that stand out to me the most are the Anker Prime charging station and the Anker Prime power bank. The charging station is\nthis desktop accessory that can kick out 250 watts in total among its four USB C and two USB A ports, and then it has a\ndisplay that can show you how much power each port\nis drawing actively. And then it lets you\ncustomize charging priority on each port, so you can let\nit just sort of auto adjust and make the highest demanding items get the max charge that they can take. And then the power bank has a 9,600 milliamp-hour capacity, and there's two USB C ports on it, and up to 65 watts output from this thing. But it can also be a wall charger, too. So, that 1.3 inch\ndisplay is gonna show you how much battery you have left and how much power each of\nthose ports is outputting. So you can check 'em out, and the rest of the Anker Prime lineup, in the video description. But either way, that's been it. I got this in before the\npouring rain started, so I'm pretty proud of that. But let me know what you\nthink in the comments below. Talk to you guys in the next one. Peace. (upbeat music)"
        },
        {
            "id": "3ZDcr1icSo4",
            "title": "Google Pixel 8 / 8 Pro Review - Problems!",
            "description": "My full review of the Google Pixel 8 / 8 Pro - We're a bit late with this one, but we're working hard to step up what it means for ...",
            "views": "3682431",
            "likes": "111093",
            "transcript": "I've been using the Google pixel 8 and 8 Pro for a while now I've taken these phones basically around the world with me and the only reason that I've waited till now to talk about them is they're complicated these are the most exciting smartest most futuristic phones that I really want to tell you while the best phones I've ever seen but I can't the packaging you'll get them with is pretty simple so this is the pixel 8 and then this is the pixel 8 Pro and each one comes with a manual charging cable and an adapter to switch from your last phone so when I first picked these phones up and I experienced the design I thought yes the pixel 8s look and feel basically like the pixel 7s the same space age aesthetic with ultra minimal speaker grills they're a lot more comfortable this silky frosted glass that you get on the pro this material right here this is what every phone should be made of and I've always said that the pebble is like the most comfortable shape that a smartphone can be and well with these new rounded Corners this is the closest we've been in a while now I know some people don't like the pixels whole visa thing I've got a friend who keeps telling me it looks like your phone is wearing a headband but I think it's great this visor it keeps the cameras high up on the phones your hands are completely clear of them it's symmetrical so when you put it on a table you don't get any weird rattling when you tap the sides of the screen the only thing that I don't like is that they've given the pro a glossy visor and saved the matte one for the base pixel8 and the matte is just way better it doesn't attract fingerprints it doesn't get scratched as easily this one does but at least the visors are very slightly raised in front of the cameras so your cameras are safe and then next to those cameras we've got a brand new temperature sensor on the pro why do we have a temperature sensor on first glance it seems really dumb and it doesn't exactly get clearer when you open up the new thermometer app to use it and the thing just looks like a template that's been drawn out in Microsoft Paint including an image that's very obviously like 240p resolution the app basically allows you to go up close to household objects and measure the temperature okay I mean I don't see people doing that for enjoyment and then for it to be an actually useful tool it needs to be laser precise but it isn't point it at the same object from the same distance and every single time the reading is different close enough to get a ballpark idea but not close enough to be a professional piece of equipment so here's my hot take I think Google put this in solely for the purposes of human temperature detection the idea that you know you're feeling sick your pixel is the first thing you can reach for to get a second opinion in fact earlier this year before the phones were even announced we saw a leaked video showing how you can move the sensor across your forehead to get a reading that is a great feature if it works cuz I mean I feel like people now are more conscious about getting sick than they've ever been before and your phone is like the one thing that you can pretty much guarantee you will always have with you it's just that if you want to be able to claim that your device can take your body temperature then that requires proper medical clearance which takes time so at the last minute realizing that this clearance is not going to be ready for the phone's launch I'm thinking that Google just quickly scrambled together another random alternate use for the temperature sensor just so they could still talk about it regardless of if that's true or not right now temperature sensor feels like a bit of a Miss but the rest of the design is close to are perfect for me and then you properly dive into the software with Google's version of the new Android 14 and this is both where I have some of my biggest problems but also in so many ways this is the user experience that I've dreamed of most of the time the animations are silky smooth and the attention to detail with them is Sublime like just for example the way that your screen turns on depends on how the phone is unlocked like if you use the power button the animation starts from the power button if you use the fingerprint scanner it starts from the middle of your screen and if it's face unlock the front camera will be the center point or another one you know when you want a gesture back and forth within an app you kind of pull in from the side well when you pull in here what you're pulling is this little arrow it'll stay attached to the border of the screen until you pull it with enough pressure for it to dislocate when it bounces forward off the border with momentum that has physical impact thanks to the soft vibrations of the phone it's very subtle but it's this kind of stuff that really makes it feel like you're interacting with objects that have real weight and presence and I got to say whoever is on Google's team making these kinds of minute but meaningful decisions you have my respect it's a large part of what separates the pixel from other androids for me and the haptic vibration experience all around whether you're typing or feeling that slight bump you get every time you scroll past an app or when you're using this Inc screen fingerprint scanner it is top class but it's not just about animations it's just the software as a whole feels very attentive it feels very tuned in to what people want like you know when you hear a song playing in a store and you start bopping along and you want to know what it is and then you realize that your phone has not just figured it out for you but it's presenting the information to you on a platter on your always on display one of the flights I was on recently I just lost my internet connection and suddenly remembered I had no idea what time I was Landing but then I pulled out my pixel and it was just there the information was on my lock screen the phone's packed with tutorials that explain how all the more complex things work and that is great cuz I don't think anyone is going to be able to pick up a phone as advanced as the pixel 8 and actually make the most of it without them every phone could do with more of these to be honest oh yeah and the Google Assistant more human than ever before I was using this a few days ago to prepare for an interview with very important person actually you will see that soon but I was essentially going on a really long walk and having the phone dictate articles on the internet to me and it sounds way less artificial than it does on my iPhone plus you have the ability to control speed so you can get it to reach you at 0.5x speeds or if you're some kind of very gifted person 3x speed you've got improved speech recognition I was using the Google translate conversation mode is literally my only way to communicate with the people in Sagal when I was out there recently I've been using this with my aunt who's Italian and literally speaks like four words of English it's still not quite perfect you have to wait between each person talking so the phone can keep up but it's good enough that I've been able to have conversations that I could never have had before so the intelligence of the software is a practicality win but it's also got some customizability perks like you have the ability to ask AI to design the perfect wallpaper for you as a concept this is freaking insane in my life I have spent many days worth of of time scrolling endlessly through wallpaper apps watching 25c full screen ads every 2 minutes just to try and find what I'm looking for and so all of a sudden just being able to ask for it is it's like a childhood dream now it can't make absolutely anything it does have parameters that it works within like minerals or paintings but that hasn't stopped me making tons of wallpapers that I feel really happy with and that I'm almost attached to because I know they're one of a kind I find the categories they're actually just useful because they guide it towards things that naturally make for good work wallpapers and then the software can take that wallpaper and theme itself around it it'll give you these color palette options and when you pick one you will see those colors throughout your entire user interface your widgets and even your lock screen you can also finally pick what shortcuts you want on your lock screen which is cool but it's a bit too limited right now for me to actually say it's useful but then you've got the headline software feature 7 years of updates oh W what we already thought it was pretty crazy that Samsung has started guaranteeing four Apple's had a lot of credit over the years for doing 5 plus seven I mean I don't imagine most thousand flagship phone purchasers are going to use one phone for 7 years but still 7 years of updates means that anyone who then buys the phone in the secondhand Market could still keep up to date and that's awesome now Google does have a pretty colorful history of discontinuing products that don't quickly build up large user bases so this could have come from a place of let's make this massive promise and only deliver on it if it really does translate to a big boost in pixel sales I've seen this sentiment a lot but I'm optimistic so far Google has always delivered on its pixel update promises plus I think the thing that I haven't seen being talked about is that it's getting easier to keep a phone up to date you know the major Android versions they're not changing as much as they used to so this idea of promising 7 years of updates it's a lot it's generous but at the same time it's not this insurmountable hurdle that they've just put up for themselves and also one of the complaints that's often lodged against pixel phones specifically is that a lot of things that are marketed as if their Hardware features are actually just software features that are very soon brought to other pixels too so you don't actually need to to buy the latest to get the latest and well yes this is true it happens a lot of the things that you might think are pixel 8 exclusive because of how they're positioned might not necessarily stay that way but I mean first of all they're not the only company that does this I mean that's very much what the iPhone event was like this year too and secondly it's not a bad thing that a company is supporting their older models that's the harder thing to do for them and it also means that while you're not the main beneficiary at the very beginning when you go out and you buy the latest you become the beneficiary when the next phone gets launched and you realize that you actually don't need to rush out and buy it so there's a lot of good about this software clearly but for me it has also been a pretty major source of frustration but before that all makees sense we need to talk about the cameras this is going to feel like a very strange thing to say for a phone this intelligent whose primary focus is the cameras and who's just supposedly had every camera upgraded and is now apparently the best camera on a smartphone but I think the pixel 8 and 8 Pros cameras need quite a bit of work the hardware is strong on paper both pixels have the same 50 megap main camera and then while the pixel 8 pairs that with with a 12 map Ultra wide the pixel 8 Pro pairs it with an even wider 48 map Ultra wide and then a 48 megap 5 times telephoto camera and I love this trend of not just having one good main camera but also kitting out each camera sensor cuz I think it's important when you're taking a photo to not be thinking oh which one of these cameras have the best sensor quality again and more just which camera creatively suits the shot that I'm trying to take and the pixel 8 Pro it definitely achieves that feeling like the telephoto camera thanks to the combination of five times magnification and really smart machine learning manages to retain sharpness all the way to 20 times and even 30 times in some cases which is its maximum amount of Zoom when was the last time you saw a phone that could actually get to its Max zoom and still take a satisfactory shot you don't get that feeling as much with the normal pixel8 cuz the ultra wide is weaker and there's no telephoto but since it's a $699 phone as opposed to the $999 pro the fact that you're at least still getting a proper Flagship main camera that's about the best you could hope for right so what's my beef then well essentially that these are the most technically sophisticated intelligent cameras I've ever seen on a phone but with a whole load of weird limitations that slowly eat away at that like when you're in portrait mode it forces you to digitally crop in a minimum of 1.5 times for some bizarre reason and then even weirder is that you can't zoom in more than three times one of the main camera upgrades that you're paying the difference in price for on the pro is this new five times telephoto camera why on Earth would they not allow you to use it here the same is true for slow motion where well you can zoom in up to seven times but it doesn't switch to your telephoto camera it uses seven times digital zoom and it looks terrible you've got this awesome new blur feature which lets you shoot cinematic video that I would genuinely say looks more realistic than both Samsung and Apple's but it's capped at 1080p compared to their 4K and also doesn't work on the front cameras and also only the pro gets the pro camera settings which I realize sounds like an obvious statement but you can't help but feel hard done by with the normal pixel 8 because given that this is one of those rare situations where both phones have the exact same chip and the exact same main camera Hardware so why is it that I can use this one to take proper 50 megap shots but I can't use this one to do the same do you see what I mean with these cameras like it just feels like there's so many unnecessary fences being put up here that just make it feel like you're not making the most of the great Hardware you're getting and then there's the lack of Polish like the transition between lenses it feels pretty rough it's laggy and the actual Viewpoint is jumping quite a lot every time there's a switch so anytime you want to shoot a video where you're moving in between these various focal lens it's not a great look the stabilization is very bipolar with good lighting the fact that you have really heavy electronic stabilization applied is mostly a good thing it means that you can just walk and your footage is so smooth that it almost looks like you're using a gimbal especially when using this pan mode which further slows down your footage and adds an extra layer of stabilization without even a hit to resolution I love this feature I'd actually probably use it to film bits of our videos if the quality of the video itself was a bit higher but I'm getting to that and then the thing with electronic image stabilization is that as the light starts to dip it gets worse and what was once an ultra stable camera is replaced by a camera that's constantly trying to hold itself stable but ends up creating lots of weird blurring and artifacts in the process in times like this I would say that not everything needs to be ultra stable it's fine to be a little shaky if it avoids the artificial feeling cuz that's life and then when you pair this weird stabilization with the fact that video can still get decently grainy as soon as you hit like middle lighting conditions and sometimes the out put of the pixel 8 and pixel 8 Pro can just look straight up bad like here's the latest iPhone in the same scene it's not perfect either but distinctly better at managing tricky lighting and the switching between its various lenses it's still better than the pixel 7s were last year but it's just I feel like with Samsung and Apple this year the camera improvements to these tricky scenarios have been even bigger than this now Google does have two features coming later in the year which are video night sight AKA improved low light video and then video boost which is this really unusual one where once you've taken a video and it's backed up online Google will run it through their servers upgrade the colors and the details and then just pop it back into your library for you it's a bit of a strange offering but if Google does actually deliver with both of these features then that would fix two of my biggest complaints with the pixel camera it's just well video boost isn't coming to the normal 8 just the 8 Pro and it's at this point a promise it's a even if the products aren't quite right now don't worry we got you if I already felt really good about the cameras and they were promising bonuses then I'd be comfortable with that and I side with the fact that they will probably deliver but because there are things that aren't right now that I think need fixing buying the phones at this moment in time feels like a bit of a gamble now that said there are a lot of redeeming qualities like the phones already do take really detailed clear high quality photos with realistic colors all around the new iPhones still come out a bit more detailed thanks to them now shooting in 24 megapix as opposed to the 12.5 megapixel that these shoot at but in terms of the quality of the image this is high and then you've got best take which is kind of like the next era of Google's Top Shot feature when you took a bunch of similar photos your phone could previously identify which was the best and serve it to you but now it can actually create a hybrid of all of them where everyone looks their individual best for up to five people part of me finds it a bit creepy it's like the most real visceral example of photo manipulation in a way that the shot you end up with as a whole is not actually the real moment that was captured then on the other hand it's a very intelligent solution to a very human problem that I and I'm sure most of you have also come across like or not this is the way that phone cameras are headed and then audio Magic Eraser is another one of those situations where you see it in action for the first time and you feel like you've just witnessed magic it figures out the different layers in the audio for example there might be a wind layer or a general background noise layer it separates them into separate compartments and it allows you to erase whichever ones you want like if you're trying to focus on a conversation you're having but there's some really annoying music in the background it'll figure that out and delete the music and this doesn't need to be videos taken on the phone it can be any video which creates it's a really weird situation for me because we use background noise removal a lot for our videos and this phone is actually a much faster way of doing it than a proper professional using top-of-the-line editing software and it can't fix everything but then again neither can those programs and in our experience every audio track that is fixable this can and it will fix so we'll be legitimately sending our videos from a Mac Pro this size to a phone this size to do the work on that's the sign of a good feature and at this point there are tons of examples of this the way the phone can add a light source that shapes light around a person's face the Magic Eraser which can not just remove distractions but also camouflage them and this is also apparently getting better later this year and then of course this new magic editor which includes the erasing but also just goes further and it's one thing seeing the feature get announced on stage but it's a very different feeling seeing fundamental parts of a photo that you've just taken being changed like this the ability to erase people to move people and the sky swapping I've seen phones that can swap Skies before but not like this this is genu genuinely jaw-droppingly realistic and more importantly it's all presented in a package that basically anyone can understand and use okay now with all of that in mind here is where we talk about the drawbacks for starters all of this generative AI stuff for anything that has to like use AI to create something so things like the AI wallpaper making and the magic editor they need a permanent internet connection because every action you take needs to be passed through Google servers plus for magic editor your photos also have to be backed up to your Google account before it's willing to even try and process them and that means is while definitely impressive this whole process is nowhere near as seamless as it was painted out to be Google actually showed us this demo on stage of a lady in front of a waterfall they showed how easy it would be to just erase people in the background get rid of her shoulder strap pick her up move her around the image and then swap out the sky what an insane demo but the reality is quite different and to show my point I downloaded the same image and this is what it's actually like the phone will sometimes struggle to identify what counts as a person in the background and so it's fiddly to select there's a lot of waiting time in between each action like just to erase one set of people it's a whole new loading screen and then for every like fourth or fifth action I take I keep getting this error that magic editor is unable to show results that might violate its terms which is very confusing given that this is literally the exact demo that Google gave now I don't want this to take away from the fact that what it's actually doing is amazing but it just feels so sluggish that you're constantly reminded of how it's not running on device it doesn't feel like your phone is doing this processing and the power is in your hands it very much feels like you've just got access to a login to an AI website that's doing it on your phone's behalf and it's not just the cloud editing that feels slow the entire editing Suite on this phone it chugs and it really makes you realize that the tensor G3 chip inside this phone is not quite Flagship level it leans very heavily on the AI aspect to be able to do some of these really cool pixel things but the raw power especially the graphics power is lacking I think of this like a more modern version of like the Apple A14 chip from 3 years ago in terms of its ability to play games and because it's got less computational power it's less good at general computing so basically any task that Google hasn't specifically optimized it for will naturally happen a bit slower than it would on the competition the phones just generally are not the most stable like sometimes the screen has stopped responding and apps have just randomly bugged out and then there's the thermals two times while I've been using the pixel 8 Pro for prolonged periods of time one while I was doing lots of video samples and one while I was using it as a hot spot that's a fun bit of irony this phone has gotten hot and when it gets hot everything has lagged like the camera feed for example has just become really choppy and you just know that the phone is screaming for you to stop so those are the major problems I faced then we've got a whole load of minor ones so signal signal and core quality of my experience has been pretty good but not the best signal is the one thing that's very hard to scientifically test just because of how many variables there are but it's felt like it's dropped more often than my iPhone 15 Pro when I'm hotspotting which I do a lot of and it looks like why that is is that Google is not using the latest and greatest 5G mod modem in these phones they're using a revised version of an older modem I spent ages trying to get some of the new Google Assistant features to work like the ability to now ask Google's B AI much more complex questions the new upgraded call screening features and the ability to summarize internet Pages for you only to realize that they're actually not available in my country yet they're Us exclusive for the foreseeable future which was not communicated very clearly at all the face unlock is good when it works but it's just not as secure as face ID on the iPhone and also needs to be quite a bit closer to your face as it's not using infrared or anything it's basically just taking a photo and the fingerprint scanner has been completely fine there's no problem but it's just slower than some other phones using more advanced Teck okay that's a lot of stuff now just before we bring it together screens and battery so the screens are actually both great and it feels like they've made sensible compromises on the Bas 8 such that it doesn't feel like you're missing much they're both 120 HZ very bright screens the 8 Pro is actually meant to go even brighter but honestly I can't tell the difference they're both good the bass pixel 7 had a pretty noticeable chin on it it it was no American Dad but you know you could tell the bass pixel 8 it still has a bit of a chin on it but it's trimmed down it's subtle enough now that you can decide not to notice it the 8 Pro is higher resolution than the 8 but by default actually comes set to a slightly lower resolution just below 1080p which is quite unusual but honestly sharp enough that I've not really noticed or felt like I needed to bump it up the pro also has slightly stronger glass and the final perk is that while both phones can dial their refresh rate up to 120 HZ this can go down to 1 HZ whereas this and when you go down to 60 HZ and this does make a bit of a difference to battery I'm relieved to say that finally the pixel 8 Pro feels like a pro for battery life like 7 to 8 hours of screen on time has been a pretty normal thing for me to reach but the Counterpoint to that is that the Basse pixel is a decent amount behind it's fine battery life for someone who's generally a bit hands-off with their phone but for me the normal pixel 8 has been just about enough to get through the day but to the point where I'm getting back to my charger in the evening with a trickle of sweat running down my forehead one new feature that really does help though is this new focus on battery estimations of it being less about specifically what percentage you're on and more about if you continue in the app that you're in with your current levels of power draw exactly what time you will run out okay so should you buy the pixel 8 and the pixel 8 Pro and should you be enjoying this video then a sub to the channel would be appreci 8 it I really want to say yes no phone has convinced me of the AI future that we're moving towards more than these two right here they are exceptionally smart but just a little too much in a way that makes it feel like a concept phone a phone with a set of really cool really powerful specific highlights that genuinely do feel like a glimpse into the future but then slight neglect when it comes to the more simple things like signal and video quality and thermals not to mention just far too much being left in the hands of what's coming soon what's not available yet there's actually a lot more of that that I've not even covered in this video like Zoom inhance that can improve what photos look like when you crop into them after capture improve Magic Eraser performance etc etc etc but at the same time I do think these phones have such a high potential ceiling that I do want to give them the chance to see if they can actually get there so I would say this let's let them sit for 3 months and then let's see if we get to the fixes that we need and then I'll either make a full update video here on YouTube or I'll do a Twitter thread so be sure to be following on there and I will catch you in the next one"
        },
        {
            "id": "BS8x2TicxQ8",
            "title": "Google Pixel 8/8 Pro Review: We&#39;ll Fix It In Post!",
            "description": "Pixel 8 Pro is my new daily driver, but not just because of the hardware... Can we trust Google on the 7 years of software updates?",
            "views": "4636186",
            "likes": "138024",
            "transcript": "- So a common phrase\nin the video world is, eh, we'll fix it in post. Meaning the shot isn't quite perfect, but we'll just fix that\nstuff in post-production, kinda like this. (drums rolling) (magical music) There you go. Or how about a little bit of this too? (drums rolling) (magical music) There we go, much better. See, it's not that it's\na lazy way of doing it, but I feel like a good filmmaker tries to get as reliably good in camera as possible instead of\nrelying on software. And the we'll fix it in\npost version of a smartphone is definitely the Google Pixel. So many of the Pixel's best features are literally fixing it in post, right? Oh, is your face blurry\nin that picture you took? Fine, Face Unblur. Fix it in post. Oh, what's that? You didn't quite get that\nangle right on your photo? Magic Editor. Fix it in post. Oh, was there a weird background audio in that video you took? Easy, we got Audio Eraser, fix it in post, and many of these strategies\nwith a little help from AI, actually work and that's\nwhere the Pixel shines. But there's also some\nthings about smartphones that you kind of just\ncan't really fix in post. First things first. The design on the outside of these phones looks, I would say, familiar. It looks like the past few years of Pixel which I actually really like, but I also do think this\none's a little bit better in a few ways. First of all, the camera circles did the iPhone Dynamic Island thing of combining themselves\ninto one big circle which I actually like with\nthese new bigger sensors here. And then also the Pro Pixels now have a completely flat display, so finally moving away from\nthe slightly curved edges from the past years and a\nsatin back in every color which does a shockingly good\njob at hiding fingerprints, if your team know case like I am. Aside from that though, everything else is right\nwhere you'd expect it. The one thing I wanna see\nif maybe they can fix now is the dust that always accumulates like right under and above the camera bar. Probably the only way to get rid of that is to sort of curve it like they did on the Oppo Find X4 and X3, but I don't know if they'll ever do that. But the biggest improvement\nto the hardware though is definitely upfront, honestly to the point where\nI feel like these new screens sort of tie the phone together\nin a way that they're up at the level of any other flagship phone. So the smaller Pixel 8 now has a 6.2-inch 1080P OLED display, slightly smaller than last year. And that display is surrounded now by perfectly thin even\nbezels all the way around, no more tiny chin like previous years. And it's now bumped up\nto 120 hertz display that gets up to a new maximum\n2,000 nits of brightness which is incredible. It's super bright. They're naming it the Actua display because they feel the\nneed to name everything. But I love how it's visible all the time. Auto brightness has also been\nbehaving this time around which is great. It's not LTPO though, so you'll still probably wanna turn off the always on display to\nsave a bit of battery. But then the Pixel 8 Pro\nhas a new 6.7-inch display. It is LTPO, it's closer to 1440P and it maxes out at 2,400\nnits max brightness. This one is legitimately up there with the brightest displays I've ever seen on a smartphone in person and I definitely did not expect\nthat to come from a Pixel. They're naming this the\nSuper Actua display. So the result is a hardware package on the outside of the phone that honestly feels like you can put it right up alongside any\nflagships from Xiaomi, Samsung, or anyone else, you name it. Just from the way it's\nbuilt, the way it feels, the metal rails, the satin back, the clickiness of the buttons,\nthe super bright display, the even bezels, everything about it, it's just this is a rare\nW for Pixel hardware. And then two other small things\nabout this display, though. One, it's still just a single\nfront-facing camera at the top but Google has found a way with software to get more information out of this camera in order to be able to\nuse it for secure unlock for things like banking apps\nand logging into things. So basically instead of\nadding more hardware up front like an infrared camera or\na dot projector or radar, if you remember that,\nthey just fix it in post with software magic and it's convenient. But then number two, the fingerprint reader has not improved. So remember we were talking\nabout this in the past few years of Pixels, all the best,\nthe highest end flagships feels like they all have that super fast ultrasonic\nfingerprint reader. This one is still optical\nand still just a little bit, just a beat slower than the high end ones. It's not horrible, but you\ncan tell it's not as fast or as consistently accurate\nwith like rain on your phone as something like a Samsung phone. It's also not any bigger, either. But hey, as long as we're\ntalking about the Pixel, we might as well just get right into talking about the camera because this is where you're gonna see the fix it in post pushed\nto its absolute maximum, more than any other phone. So the new camera\nsensors across the board, they do plenty of heavy\nlifting, of course, it's a big 50-megapixel primary sensor shared across both the 8 and the 8 Pro, F1.7 OIS and Pixel photos, they look good, they're sharp, there's tons\nof dynamic range as expected. Auto focus is really fast and it can get a pretty\nshallow depth of field with close up subjects, which is nice. But really most of what you're looking at when you look at a Pixel\nphoto or video is software. So the multiple exposures blended together into a single HDR shot, the strategic relighting\nof recognized faces. I also, I do feel like there's a little extra noise reduction this year. So sometimes details\nget kind of watercolory but at least there's enough resolution that it doesn't look\nterrible when zoomed out. And I've also found there\nis definitely a tendency to over-HDR some images sometimes. And when it comes to\nfeatures, well, oh my god, there are so many now. You probably already\nknow about Magic Eraser. Look, oh, what's that? You've taken a photo and\nsomeone's in the background, you wanna get rid of 'em. Boom, Magic Eraser, fix it in post. Oh, what's that? You have a photo where someone's\nmoving a little too fast or the hands were shaky and\nthe face is kind of blurry. Well, there's a feature\ncalled Face Unblur, literally fix it in post. And then even this new\none called The Best Take, people with kids are gonna love this one. Basically, you know how\nanytime you take a group photo where there's like five or\nsix people in the photo, you just blast, you just\ntake a bunch of pictures and inevitably, one person's face, they're either blinking\nor sneezing or something. It's never perfect. But this feature will let\nyou go into that group shot. And this is for any group\nshot you've ever taken in your Google Photos library, by the way, not just a shot on the Pixel. And it automatically\nrecognizes the burst of photos and lets you pick the best\nface from the whole burst on each person in the photo with surprisingly impressive accuracy. You will genuinely never\nhave that one person with their eyes closed\nor looking the wrong way in a group photo ever again. I guess that makes your\nholiday cards that much easier. But also even in videos, you know, I've taken a lot of videos\non the Pixel 8 and 8 Pro, there's a lot of processing happening. I do think Pixel video is\nimproved over last year. It's less noisy in the shadows and there's some nice\nshallow depth of field with quick autofocus. I shot almost the entire\nCorvette Z06 autofocus video on the Pixel 8 Pro and I\nthink it looks really good, but also in a lot of the shots of my face, there's this artificial\nbrightening processing, like you can see it in my\nfootage before I start talking. When it lands on my face, how\nit just brightens up my face and adds this contrast and\njust throughout the footage, there is a good amount of\nprocessed sharpening going on. Also, the Audio Eraser video feature is all right, I would say. Again, you can only fix so much in post, but basically they show this feature where if you're taking videos and there's some background noise, you can go into the editor and separate out like the\nlayers of different sounds. So there's this really cool UI that they've built in\nthat is super impressive. You go into Edit Audio and Audio Eraser. It analyzes the video and\nthen lets you drag up or down levels of different\nsounds it's identified. So nature and voices and background sounds and wind, you know, depends\non what video you took. It does okay with small\nstuff, but like, I don't know, it's super impressive at a low level, but then it can't really\nsave the most disruptive wind around our studio or the exhaust sound of a five and a half liter\nnaturally aspirated V8. Like it's not magic. About this in the main channel in the Rimac Nevera video. That car is electric and basically has multiple personalities and this one kind of does in the same way. You've probably heard the other cliche of. I will say shout out to the colors though. Honestly the color in\nPixel video is really good. If you told me I could only take pictures by taking stills from\nvideo of any smartphone, I think I would pick the Pixel 8 Pro. Just the footage looks so good. Now Google, here's the\nthing about being so good at software visibly is it\nbecomes way more obvious when you're suddenly not able\nto pull off a software trick on the non-Pro phone that\nyou are able to pull off on the Pro phone, even though\nthey're the same computer. Like the good thing that you\ndid was put the same exact chip the Tensor G3 with the\nsame image signal processor and the same primary camera\nand the same selfie camera in the pro and the non-Pro phones. So this sort of artificial separation between the Pro and the non-Pro\nwith like software locking, it was obvious when Apple did it and it's even more obvious\nwhen Google does it. So if you open up the camera and switch over to Pro Controls, that's only available on the Pro phone. Now, that's funny. Of course, you can argue the non-Pro phone doesn't need Pro controls, but\nit's clearly capable of them. Even if you bury them in\nsettings, it's the same computer. They also both have a 50-megapixel sensor, but because it's locked\nunder the Pro mode, you can only take 50-megapixel\nshots on the Pro phone. The non-Pro phone is always binning. Theoretically that's\ngonna be one of the things that you'll have to pay\nthe 300 extra dollars to get up to the Pro phone for, but also someone's already\nported it to the Pixel 6. So like, come on, Google, you ain't slick. There's even a blog post\nabout some other features that are coming to the Pixel. They have this thing called Zoom Enhance. That's basically a generative\nfill version of Super Res Zoom that's coming later this year only to Pixel 8 Pro for some reason. And especially improved\nMagicERraser version that uses Generative Fill on the 8 Pro and only the 8 Pro. - It's ridiculous. It's obvious what's being done out here. It's a nightly basis. I hope the world can see now what's really going on out here 'cause it's getting ridiculous. It's really ridiculous. - Okay, last camera thing. Magic Editor is... It's wild. It's one of the wildest\nthings they've ever made. It is available on both phones and it definitely goes\nbeyond fixing it in post. So you open up a photo, you hit Edit, and then at the bottom left corner, there's this wonderful colorful\nrainbow Magic Editor button just tempting you to press it. From here, the editor\nUI is basically saying, all right, go ahead and select\nsomething with your hands and then we can change it. We can do whatever you want to it. Select an object and you can\nremove it, move it around, resize it, select a person,\nwe can move 'em up or down or hit the bottom middle button\nto switch the whole scene to golden hour or replace\nthe entire sky in your photo. And then once you submit the edit it takes a few seconds to process, and then kind of like DALL·E, it gives you four options of this edit to pick whichever version\nis the most convincing. They're not, you know, professional\nphotographer level edits meaning you can zoom in and Pixel peep and find some edges sometimes\nthat look weird here or there. I also did try the exact\nsame Generative Fill example that they showed in their commercials of this kid on a park bench where it oppressively fills\nin the missing balloons. When I do it, it kind of tries to do that, but definitely doesn't\ndo it nearly as well. But the truth is zoomed all the way out, these are decently convincing\nedits to regular people and you can just do it with\nany photo in your library, so it really just feels\nlike without knowing how to use Photoshop or any of these image generation AI tools, the Pixel Magic Editor,\nbasically what it did is just it lowered the barrier\nto entry to just lie I guess. Now every once in a while,\nI did get a popup box over my edit attempt that said\nit's unable to show results because it might violate our gen AI terms. But I was never able to\nfind like exactly why or any trend in this. It seemed to come up more often when I tried to edit\na picture of a person, but then it would totally let\nme just select a watermark in a photo and effortlessly delete that, which is probably gonna be\nconcern for some photographers. So yeah, I would just say\nthat I'm probably gonna end up making an entire separate\nvideo just about this tool 'cause it's fascinating and what it brings into the world is wild. But I don't know. What is a photo? But you know what you\ncan't fix in post, though? Battery life. You can't AI your way out\nof a huge 2,400 nit screen burning through battery. You're just gonna need the hardware, you're gonna need a big battery you're gonna need an\nefficient chip for this one. And I'm happy to report that I have had really good\nbattery life on the Pixels. And this is especially on the 8 Pro. So I've gotten six to eight\nhours of screen on time regularly, standby time has been decent. My only real question at this\npoint is, and I only ask this because of the history\nwe've seen with the Pixel, how long will the battery\nlife be this good? Because, you know, it could\nbe great for a few months and then start to fade\nlike previous Pixels, or maybe it'll be great for years, the whole time you own the phone. Only time will tell. At the end of the day though,\nthe Pixel is still great at what it's always been great\nat, which is being smart. Like there are so many features, from call screening, to\nGoogle Assistant everywhere, Google's stock apps getting so good. And the more I use the\nPixel as my daily phone, as I have for so long, the more I just kind of\nget used to this stuff and the harder it is to live\nwithout it on another phone. Android 14 has already breathed life into older pixels already. Literally my biggest primary bug is clicking Twitter\nnotifications, for some reason, Just take an extra beat\nand a half to open. Kind of weird. One of the new features on this one is when you're in any webpage in Chrome, you can pull up Google\nAssistant and just ask it for a summary of the entire\nwebpage you're reading. And Google Assistant\nwith this new AI features reads your screen and generates a summary of three or four bullet points that are typically pretty good. Now I wanna try this\nwith a few other apps, but I basically always got an error saying this app doesn't support summaries, So it looks like the app developers are gonna have to opt in\nto have their apps scraped by the summaries which I kind of suspect a lot of them are not gonna do that. Even Google's own news\napp doesn't support it. So this basically is just a Chrome thing. And then after the summary, it gives you a few cards\nto ask follow up questions about the subject and just\nkeep Googling more stuff. But then just this phone gets a lot of the little stuff right too. Just the little things that\nmake it feel like a flagship. The haptics are excellent. Like it's got some of the\nhighest quality phone calls I've ever heard on a\nphone, stuff like that. Overall, when you put fit\nand finish and hardware up alongside software experience, and I think these new screens especially, it feels like this is finally\nthe generation of Pixel that is right alongside\nthe other flagships of the smartphone world. And it gets supported like a flagship too. Seven years of software updates, seven years of feature drop updates, seven years of security updates, seven years of spare parts available. And it'll do so for the\nnew starting price of $700. And I think it's worth it. I honestly, I think this\nis worth the new price tag. I think everything they've\ndone from the 120 hertz and the brighter screen across the board, this is a phone that I would\nhave no problem recommending. Now, is the 300 extra\ndollars for the Pro worth it? That one's gonna be tough. And again, it's because\nGoogle did such a good job with feature parity, same\nchip, same primary camera between these, so it's gonna come down to the couple of small\ndifferences between them. Do you want that telephoto\ncamera and the bigger screen, bigger battery, bigger phone,\nthe temperature sensor? I don't know. It's harder to recommend\nthe Pro for most people, but the Pixel 8, this is a good phone. So that's basically it. Thanks for watching. Catch you guys in the next one. Peace. (light music)"
        },
        {
            "id": "8Lb9023_D0A",
            "title": "Google Pixel 9 Pro Review - Redemption Time!?",
            "description": "Full review of the Google Pixel 9 Pro and Pro XL, including camera comparisons, all AI features, as well as a battery test and more ...",
            "views": "2170354",
            "likes": "86091",
            "transcript": "I have had a complicated relationship with the Google pixel phones over the years I've always said that at their very core these phones are special they have this beautifully animated friendly customizable software that's always capable of doing a few things so intelligent that they're practically indistinguishable from Magic but at the same time these phones make me rage because so far there's always been a blocker significant enough issues that distract you from being able to focus on that delightful software I've had build quality issues I've had overheating issues I've had signal issues inconsistent camera issues and just generally the phone's being quite a bit slower than the competition issues so that puts this new pixel 9 Pro and the 9 Pro XL which is the one I've been mainly using in a very interesting position they have a lot to prove but if they can prove it then I mean these could basically become my favorite phones ever so this is how the pixel 9 Pro and the pro XL come presented it's a pretty box but sadly it's also a pretty empty box you get the phone you get a cable and there's a Sim ejector somewhere in here well at least it makes my job quicker here's the thing though this is the best built pixel ever it feels almost exactly like an iPhone 15 Pro Max when you pick it up very similar Dimensions very similar flat sides with a slight curve and it's the same weight down to the gram I remember reading a post saying that way more of the people who buy pixels are actually X iPhone users as opposed to X Samsung so I'd be very surprised if this similarity wasn't intentional to even further entice Apple Fans who are still on the fence but either way I mean this as a compliment to the pixel the sides are grippier than their pass phones it looks and feels just really classy especially with these thinner completely even screen bezels and this is also easily the most solidly constructed phone Google has ever made it doesn't Flex one bit and if you haven't already seen it I'd say it very much passed the Jerry rig durability test I've kind of been getting the feeling over the last few years that the pixel would end up as yet another one of those canned Google projects you know the classic downward spiral where things aren't quite there with a tech product so then it doesn't sell well so then it makes less money so then it gets less investment and never improves because of that besides Google is specifically famous for cancelling projects but getting a significant redesign like this feels like a reassurance that Google is still very much kicking around Google is still determined to keep trying to become a definitive part of this Smartphone War and the more that you use this phone the more you realize why that's so important to them but I'll get there oh also I don't normally talk about cases but if you're going to make one this is how it's done this thing is addictively soft it shows up no fingerprints no light scratches it gently swoops around the camera module giving you this soft lip to rest your fingers against there's nice felt on the inside a metal logo and metal buttons which actually match the remaining visible part of the phone and the sprinkle on top is that the fit is perfect every single cutout is exactly centralized which well youd be surprised how often that doesn't happen and you know what design is not the only thing that's on the up here the optical fingerprint scanner that we used to have that was one of my major gripes this new pixel switches that out for an ultrasonic scanner it's basically firing out sound waves instead of light to map out The Ridges of your fingers but the upside of that is that it gives the phone basically a three-dimensional understanding of your prints so it's more reliable and you really feel that I haven't had any signal issues and while it's hard to say anything conclusive about signal because there's just so many factors I do a pretty regular 2 and 1/2 hour trip from Nottingham my hometown to London on the motorway and the signal is famously patchy on this though I was actually flitting between 4G and 5G almost the entire time with only two 5minute bursts of nothing so it's looking likely that the new modem on the inside of this pixel is doing its job the general feel of using the phone is it's Flawless it's the best honestly every single animation has an accompanying feeling generated by the vibration motor even things like a gentle hum as you slide up and down your brightness plus I've not had a single bug which low bar I realized but that automatically makes this the most stable pixel launch in history the battery is actually the battery is not charged so it's on 8% right now let's just plug it into our shiny new anchor Prime power station but yeah the battery life on these Pros is enough I wouldn't call it sparkling I'm talking 6 and 1/2 hours of screen on time on the smaller Pro and 7 on the XL Which is less than my Samsung but enough for almost anyone and it feels like Google's gained control of their overheating problem I mean the solution wasn't rocket science they just finally caught up and put a vapor chamber in the phone like their competitors have been doing for ages that has a lot of KnockOn effects it means that the screen which is bright and pretty Delicious By the way doesn't dim minutes after I take it out on a hot day the camera seems to record continuously without stuttering and games don't dramatically slow down with persistent play in fact I did whip out the good old 3D Mark extreme stress test to put some numbers to this feeling and found that while Galaxy s24 Ultra had 57% stability meaning that by the end of this 30 minute or so stress test it was only running at 57% of the performance it started with the pixel retained 71.7 now that's not the full story cuz while the pixel's stability score is higher its performance to start with is so much lower that even with more stability there isn't a single point in this test where it's better than the s24 ultra every year performance has been a classic pixel weakness that every year Google seems to to keep addressing by just slapping that AI Band-Aid on top and this new phone isn't completely free of that curse either the new tensor G4 chip that you find inside of the pixel9 pros it is still noticeably less fast than the chip inside the best from Samsung Apple OnePlus all of those companies top end phones make basically every action instant whereas the pixel still feels like it enjoys its thinking time you know little things like it taking just a split second for the full resolution image to load when you zoom into it and the phone's storage speed might have something to do with that too I ran multiple tests and the pixel comes out as significantly slower in terms of sequential read and write speeds than Samsung which would explain why it takes longer to load things and I'm just going to be brutally honest this disparity felt like an acceptable compromise when Google was charging $900 for a pro pixel but now we're at $1,100 it needs to get on that level that said in a way it's actually better than I thought it would be I was expecting gaming for example to be a flop but this is Zen Zone zero this is as difficult as mobile games get to run and I've played this for an hour at a time on absolutely maxed out settings with no issues apart from some slightly toasty side rails and also this chip combined with now 16 GB of RAM by default seems to drastically speed up AI tasks I'm talking like 50% faster than they used to be which was much needed one of the key things that got to me with last year's pixel 8s was how St the difference was between how easy and instant Google made AI photo editing look at their launch events versus the fiddly reality of it on the phones made many times worse by the 5 to 10c loading time in between every single action and so the fact that this stuff is so much faster here it already starts to alleviate my blood pressure as for all the new AI stuff they announced I'd say most of it feels a little half-baked which is a phrase I think I've used to describe every single AI phone this year but there are three things three things I absolutely love the thing that they spent most of the time talking about was this one called ad me where if you want to take a group shot but you don't want to ask someone to take the photo you can separately take each person's shot and Google software can merge them together into one and while I would say that is very impressive from a technical perspective I just don't think I'd ever use it I've never really had a situation where I've wanted to take a group shot and I haven't been able to find someone to take that shot and if you can find someone then that still feels like the better option to me cuz that way you don't have to do this little fiddle you don't have to take two separate shots you don't have the risk that it doesn't quite turn out the way you expected which as we all know there is a very decent chance of with any AI feature and also you know it's just that your end result then is a photo of a real moment which maybe I'm oldfashioned but I still think that counts for something there's a whole new app now for image generation called pixel Studio but to be honest while it can generate some pretty quick Nic looking images from scratch based on a prompt it's nothing new or better than what's out there it needs wi-fi even though it's supposedly running on device and when you want to use it to mess with photos you've already taken it's extremely limited and fiddly with the selection tool being practically dysfunctional and like what in Earth is this why are the two key options for your next Generation AI photo editing app to add a caption or add a sticker this would have been cool if we were still living in the year 2000 the phone's assistant is in a slightly weird place basically this phone's default assistant is Gemini Gemini is more heavily AI powered it's way smarter but it also seems to have a lot of limitations with how it can interact with your apps and also doesn't do some of the more basic things that Google Assistant used to do so it feels like we're at this pretty clumsy middle phase where you get both and you can switch between them depending on the feature set you want which makes me feel very much like a beta tester oh but the magic editor is starting to get pretty interesting though I was playing around yesterday with the feature that allows you to zoom out of a photo that's already been taken and I couldn't believe it like look at this shot I click the autof framing button and Bam it's understood that this wooden beam along the top has got to continue it's understood that there's an extra step here and it's estimated what it's likely to look like it's understood that the trees are thinning around here so when it zooms out it's making sure that you can see more of the sky there the idea of this feature isn't new the execution of it very much is and you can now reimagine photos which can actually be very powerful and very convincing I remember my jaw practically hitting a floor when I managed to change my cat into a dog I mean what the Google the only thing I would say is it's a real hit to the features usefulness that you can't use it on shots of people there's a new pixel screenshots app which also falls into the category of pretty good I actually think it's great that there's a separate app to manage screenshots cuz the reasons that I want to find screenshots are always very different to the reasons that I might want to browse my gallery and while what the app does is not distinctly different to what most phones can already do by allowing you to search for things within your screenshots it is one layer more intelligent because your phone can not just look at the specific info in the screenshots but also use AI to take one step back and understand what the screenshot is meaning you're way more likely to be able to find it based on a Vaga description the first thing that I absolutely love though is Gemini live it's it's basically the AI that you're used to but in a much more free flowing way than I think we've ever experienced you talk you listen you can talk over the AI there are no trigger buttons or trigger words it allows you to have something that very closely resembles a real human conversation let's do a little live demo I'm debating between going for an Android phone or an iPhone I'm a simple person what would you recommend okay choosing between Android and iPhone can be tough iPhones are known for being really userfriendly and straightforward they're a good choice if you want a phone that's easy to set up and just works all right then Google thank you U but what I also like about it is that when you wanted to stop talking you don't need to say anything or do anything you just say what you want to say and it will slowly reduce its own volume and listen and I actually think that makes it a really powerful tool because it becomes like a a live bouncing board like I was chatting to it last night I said I'm going to have some people over what could I do for dinner that's a bit different it said why don't you theme it I was like great idea we chatted for another 3 to 4 minutes and by the end of it I had a complete menu plan for my Pokémon themed dinner including the salad I would use to represent grass types and the spicy curry I'd use to repres present fire types now as for the other two AI features that I think are amazing they're both within the camera so let's talk cameras the rear set of cameras have almost identical Hardware to last year's phone so that's a 50 map main 48 map Ultra wide and then a 48 map five times optical zoom and so it's probably not shocking news to learn that the base quality of photos feels not that different from last year so that means good color reproduction a very strong ability to handle High dynamic range scenarios and control those bright spots very comparable levels of detail to Samsung's highest end Galaxy s24 Ultra but then a night mode that's good but just a little softer than Samsung's and a portrait mode that I think it's fair to say falls behind like look at the edge detection here versus the Galaxy it really gives itself away as a phone photo and upsettingly many of the frustrations I had with last year's phone are also still present here zooming in and out is still very laggy it makes it feel unpolished the camera preview can still get grainy even if the end photos are not the transition between lenses feels jumpy there's weird limitations like you can't use your five time zoom lens to take portraits nor can you use it for slowo with instead the phone opting for some very poor quality digital zoom and this really cool cinematic blur mode is 1080p only but the front camera is new this is now a 42 map sensor that's the reason for the Fairly large cutout and I'll take it it lets you go super wide if you want to get those group shots I don't think I've ever seen a phone go wider than this but also I was pleasantly surprised by the detail and you can also shoot some pretty solid 4K video because yes Google has put some work in to bring up the video quality on the pixels 2 and that leads me on to the AI feature video boost it's kind of strange but when you're taking video on this phone this only works on your rear cameras by the way you have the option to boost that video If you select the option then your phone will keep the footage largely unprocessed so that the next time you're on Wi-Fi it can upload it to the cloud and get Google's superpowered data centers to process it even better than your phone itself could it improves the colors the dynamic range the stabilization it can completely rescue grainy footage taken in low light which was one of the biggest weaknesses of past pixel phones it can even upgrade the resolution to 8K and it's one of those features that you feel like it shouldn't work it almost sounds like some kind of elaborate scam but but it does I guess you could say there is a hidden cost associated with it though cuz like if you want 8K video boosted content you're going to need a heck of a lot of cloud storage specifically Google Cloud Storage you'll need about 800 mb per minute of it and also you need to be very careful with this phone about joining other people's data hotspots cuz your phone will pick them up as Wi-Fi networks and before you know it you could have burnt through 10 gab of their data obliviously boosting your videos in the background without you even realizing I know this from personal experience doesn't make you popular but it's this kind of stuff that reminds you why Google never stops trying with the pixels cuz I mean like if this phone succeeds so do all of their services and not just Google photos but also their Gemini AI because this phone is the best possible portal through which to funnel people to them it's also very clear that this is why Google is like the only Company still shipping a top-of-the-line Pro phone starting with just 128 GB of onboard storage which to be honest combined with it costing a whole $100 extra just to get to 256 feels lowkey diabolical to me ah but then here is the other thing about this camera the zoom Zoom see the big tin super res Zoom feature that pixels have is already good like when you zoom in 30 times and you take the shot a surprising amount of improvement is made after that capture to the point where I would say the pixel's long-range Zoom shots are already 95% as good as those on Samsung's s24 Ultra and that's one of that phone's key selling points but then add in the new Zoom enhance AI feature on top of that and Samsung gets absolutely murdered now this obviously does open a can of worms cuz what Google is doing here is inventing detail it's not completely consistent and it's perfectly possible that this texture it's creating isn't completely real so is it actually the better zoom camera I guess that's up to you but which image would I rather have that's pretty clear it's the Google the final thing I would add about cameras is the very underrated panorama mode this is the best phone for taking panoramas it makes them really easy to take they're super detailed and each photo is stitched together extremely seamlessly okay so is this phone good yes it is the pixel 9 Pro either improves upon or completely fixes about 70% of my issues with past pixels everything from cameras to Performance to AI it does that with classic Google perks like this joyous software and 7 years of Android updates with then extras that I didn't even know I wanted like this big redesign or well actually forget the redesign look at this case I really like this thing the key cons are just well you're basically paying $1,200 for the XL model cuz no one wants a flagship phone with just 128 GB of storage and it's still not as fast as the competition okay it's been an hour and the phone is on 67% while I've been using it the whole time and you want to know why it's because of the new anchor Prime charging station the company has sponsoring this video but that doesn't change the fact that this is the new gold standard for a setup it's got a total output of 250 wats so 1 cable into here and this thing can happily charge your laptop three phones and two other gadgets all at full speed plus it's got a 2.26 in LCD interactive charging display which gives you immediate updates on charging status and speed but there is more there's a new fusion power bank which is so cool because this is basically a full-on wall charger and then as soon as you want to go somewhere you automatically have a fully charged 9,600 mAh battery pad not to mention the docking station which is this absolutely ridiculous 14 in1 charging and data transfer solution you can turn a desk like this into a desk like this with one of these this stuff right here is no exaggeration currently the top contenders for what we're going to be kitting out are next gen studio with so check out the full anchor Prime lineup in the link below"
        },
        {
            "id": "LRJPk9BmJY4",
            "title": "Google Pixel 7A Review: New Price!",
            "description": "The price went up, as part of Google's new strategy. Is it worth it? dbrand Teardown skin: http://dbrand.com/MKBHD (Code ...",
            "views": "3274923",
            "likes": "93794",
            "transcript": "[Music] first of all can we talk about something for a second Google is the worst company on Earth at keeping things a secret and I don't think it's on purpose like some people think it's an intentional leak and oh they're they're letting stuff get out about their phone so that's free press no I think they're just bad at it like really really bad at it so everything about the phone is already out before it even comes out that's just the way it is with pixel phones now pixel anything anyway this is the pixel 7A you've probably heard about it or seen some things uh and it turns out pretty much everything you've seen is true because it's a pixel but really what you should know is this is the new mid-ranger from Google and it's a bit more expensive than the previous one 7A costs 499 and it's very similar to the pixel 7. let's talk about it so first things first yes the price did go up the pixel 6A was 449 that release this is the 7A so there should be a good reason to add 50 more dollars so let's just start with what's new which is wireless charging and a new 90 Hertz display honestly these are welcome features wireless charging is a nice one for convenience I will say it's definitely not fast wireless charging it's only seven and a half Watts here so I've noticed literally when I'm navigating and this is wireless charging in my car and it's got high brightness GPS stuff going it just holds its charge it doesn't lower or go up it just stays the same but hey if you have a wireless charger sitting around at the desk at work or at the bedside or something like that it'll definitely be good for a trickle charge overnight which not every phone in this price range can say they have so that's good and then the 90 Hertz display is a funny one because it's actually off by default on this phone like when you first take it out the box and start using it it's a 60 hertz phone but you can go into the display settings and turn turn on smooth display suddenly it's 50 percent more frames and it's dramatically smoother about as smooth as the pixel 7 was it's also the same tensor G2 chip and the same 8 gigs of RAM so performance feels pretty similar to the pixel 7 at 90 Hertz it makes a big difference I do not enjoy using this phone at 60 hertz for this price it did seem a little bit choppier like it was dropping frames and actually operating at 45 to 55 Hertz so yeah turn on that 90 Hertz build quality wise that is where you'll see at least on paper it does take the small step down from the pixel 7. uh plastic back and the the rails are still metal which is nice and it is also IP67 instead of ip68 but honestly you'd be hard-pressed to notice just like using this phone holding it there's no creaking no bending no nothing screams low quality about this build at all so I think that was well done and this is a slightly smaller 6.1 inch flat display still 1080P and it's up to 90 Hertz like I said and it does have some serious color shifting and banding when you get off axis but honestly you know it's still bright it still looks good enough for this price it's Gorilla Glass 3 and also even though the display is slightly smaller the slightly thicker bezels just bring it right back up to basically the same size of a phone as the pixel 7. so it feels like another fair trade and then there is a new set of colors this This little light blue is called c as in Ocean it's the C but there's also a charcoal and snow which are the black and white ones and there's also a red like coral colored one that one is an online only Google Store color pretty fire actually but you know Channel sponsored dbrand will let you spice it up I've never actually shouted out the Jerry rig everything tear down skin because usually dbrand has to wait for someone to actually do the tear down luckily though they were able to pull some strings and get this one made ahead of time so it's ready right for launch and this is a rare first look at the inside of the phone on camera through this skin and it's it's 15 off too along with everything else on their site right now for you guys as long as you go to dbrand.com MKBHD and use code everything but bottom line it still very much looks like a pixel the metal wraparound visor the pill cut out for the cameras the antenna bands in the right places the slot speakers the buttons are still very clicky I mean if this is they've done the hardware well this is a very good trade-off for the hardware price and then do I really even need to get into the software because this story kind of writes itself they do all the same software stuff in the a series phones as they do on the more premium pixels which I like not everybody does that so all the same features all the same stuff that I like about every other pixel is also here I've called the pixel the smartest smartphone in the world because of how good Google assistant is how good the voice to text is with all the on-device transcription the incredible voice recorder app the Google Assistant stuff that screens calls and waits on hold for me the now playing feature that hears songs in the background wherever you go and identifies them for you the material you stuff throughout everything that identifies your wallpaper and matches your system colors to it and of course the promised three years of software updates which hilariously isn't the longest promise support in the industry anymore that actually goes to Samsung's phones which promise like four to five years of support but nevertheless no surprises here so really my only two question marks when I got this phone were battery and cameras so battery would be kind of interesting because it's roughly the same size battery as the pixel 7 so would it have the same battery life or not but then also cameras because For the first time in a while there's new cameras in here all new cameras that we've never seen in a pixel before so a departure from the tried and true so first for battery 4 385 milliamp hours 18 watt charging kind of slow and seven and a half watt wireless charging even slower and then total battery life I'm gonna say average at best so it's a full day of use but definitely nothing more even at 90 Hertz which is fine you know it's mid-range so I got quite a few days with the the three to four hours of screen on time at 90 Hertz with my typical usage and I'd have like 10 left at the end of the day so I'm not really worried about it dying before the end of the day unless it's crazy heavy but even then the wireless charging can kind of save you if you want to prolong its death a little bit we'll see how this ages over time but for now I'm giving it a c plus battery life if that makes sense but let's talk about these cameras okay so pixel 6A last year played it super safe with the cameras because it used the same 12 megapixel sensor from the previous like four years of pixels in a row that Infamous IMX 363 sensor that did so well this one has a brand new 64 megapixel main camera paired with a 13 megapixel Ultra wide and a 13 megapixel selfie camera so when I first started testing it I mean I'm thinking all right well this new sensor keep up with the old tried and true pixel 6A because we all know how good those old cameras were but pretty quickly it became clear that Google has done the work to tighten up the processing with the new sensor and actually sort of match it this time and take advantage of the actual larger sensor so it's not just about the megapixel count matter of fact this 64 megapixel sensor bins down to 16 megapixels by default every time and there is no way in Google's app to take full 64 megapixel photos but it's more about the larger size of the sensor which can bring in more light and give a more shallow natural depth of field so yeah pixel photos look pretty good for a 500 phone there are tons of dynamic range without being too hdre and actually kind of feels like they've evened it out a little bit so it's a little less contrasty but it still has that famous contrasty pixel look and then that F 1.9 Max aperture combined with the new sensor means you can take close-ups of things and have a really shallow depth of field and you can take better low-light photos with faster shutter speeds at night with night sight there is no macro mode I noticed but you can get pretty close up probably I'm gonna say like five inches away from the subject and still be fine not too much fringing the ultra wide here has a lot of the same characteristics but it's particularly distorted and warped at the corners I feel like this this is something like I would expect Google to improve more with their software maybe they'll update this over time but for now the Distortion look is pretty noticeable but it is wide and then the Selfies they look like pixel selfies honestly very solid no complaints tons of range that's a good selfie camera for video you can do 4K 60 from the main camera which the Samsung a54 I just tested I don't think could even do that but then it's 4K 30 from the other cameras which is fine looks normal it this is a top three mid-range smartphone camera but hold on to that thought all the rest of the little parts of this phone I've tested were right in line for this price the haptics were pretty good not as good as the more expensive pixels but pretty good the optical fingerprint reader is just a beat slower than the super fast ultrasonic ones but none of the pixels have particularly fast fingerprint readers anyway so this is par for the course and when the sun hit it I could also see that it was slightly angled to the right not sure if that's normal or not I just know I haven't seen it like that before but let's be real here for the a series it all comes down to the price point and this one has gone up so it is still mid-range but it's like upper like premium mid-range at 500 bucks Verizon is also going to sell a millimeter wave version and theirs will be 550 bucks classic Verizon but still premium mid-range right this is a good phone and I think a lot of people will get it and really like it but for the price I would actually rather go for the pixel 7. it is six months older yes than this brand new a series phone but it's gonna have the same specs it's the same tensor chip and same RAM and everything but it will have more capable cameras on the back and the front a faster 20 watt wireless charging and then a bunch of the smaller little things better haptics better speakers and a cheaper phone it's actually glass on the back like there's just a bunch of little things that add up to a better experience overall it's thinner bezels better accessories because it's six months old already it's also ip68 instead of IP67 and this phone is like 5.99 standard and it was when it came out but it's regularly on sale for much less than that if you can get this phone pixel 7 for in the 500 to 550 range I would take this over the 7A but I guess that's just the middle child effect because Google is now trying this sort of newer thing where they're offering more things at once more pixels for different prices they're keeping the 6A in the lineup at 349 which I think is a really good deal and so now you can get a pixel anywhere from 350 bucks to 1800 bucks choice is yours 7A is kind of right in the middle let me know what you think about this phone and whether or not you'd get this or the older seven in the meantime thanks for watching check out all the new stuff on the channel if you haven't already and I'll catch you guys in the next one peace"
        }
    ]
}